{"persona": "A parent of a 3-year-old child with recurring fever", "persona_chinese": "一位3岁孩子反复发烧的家长"}
{"persona": "A teenager experiencing anxiety about exam stress", "persona_chinese": "一位对考试压力感到焦虑的青少年"}
{"persona": "A college student with irregular sleep patterns and fatigue", "persona_chinese": "一位作息不规律且疲劳的大学生"}
{"persona": "A young professional in their 20s concerned about preventive health", "persona_chinese": "一位20多岁关心预防保健的年轻职场人士"}
{"persona": "A 30-year-old pregnant woman seeking nutrition advice", "persona_chinese": "一位30岁寻求营养建议的孕妇"}
{"persona": "A 35-year-old new mother experiencing postpartum mood changes", "persona_chinese": "一位35岁经历产后情绪变化的新手妈妈"}
{"persona": "A 40-year-old executive with work-related stress and headaches", "persona_chinese": "一位40岁因工作压力导致头痛的高管"}
{"persona": "A 45-year-old woman approaching menopause with symptoms", "persona_chinese": "一位45岁接近更年期并有症状的女性"}
{"persona": "A 50-year-old man with family history of heart disease", "persona_chinese": "一位50岁有心脏病家族史的男性"}
{"persona": "A 55-year-old pre-diabetic seeking lifestyle changes", "persona_chinese": "一位55岁糖尿病前期寻求生活方式改变的患者"}
{"persona": "A 60-year-old retiree wanting to start an exercise program", "persona_chinese": "一位60岁想开始锻炼计划的退休人员"}
{"persona": "A 65-year-old with multiple medications needing management", "persona_chinese": "一位65岁需要管理多种药物的患者"}
{"persona": "A 70-year-old experiencing memory concerns", "persona_chinese": "一位70岁担心记忆力问题的老人"}
{"persona": "An 75-year-old with chronic pain from arthritis", "persona_chinese": "一位75岁患有关节炎慢性疼痛的老人"}
{"persona": "An 80-year-old caregiver seeking advice for elderly spouse", "persona_chinese": "一位80岁为配偶寻求护理建议的照护者"}
{"persona": "A diabetic patient struggling with blood sugar control", "persona_chinese": "一位血糖控制困难的糖尿病患者"}
{"persona": "A hypertensive individual seeking diet modifications", "persona_chinese": "一位寻求饮食调整的高血压患者"}
{"persona": "An asthma patient experiencing seasonal worsening", "persona_chinese": "一位季节性症状加重的哮喘患者"}
{"persona": "A COPD patient managing daily breathing difficulties", "persona_chinese": "一位管理日常呼吸困难的慢阻肺患者"}
{"persona": "A rheumatoid arthritis patient adjusting to new medications", "persona_chinese": "一位适应新药物的类风湿关节炎患者"}
{"persona": "A lupus patient balancing treatment and quality of life", "persona_chinese": "一位平衡治疗和生活质量的红斑狼疮患者"}
{"persona": "A Crohn's disease patient managing dietary triggers", "persona_chinese": "一位管理饮食诱因的克罗恩病患者"}
{"persona": "An irritable bowel syndrome sufferer seeking symptom relief", "persona_chinese": "一位寻求症状缓解的肠易激综合征患者"}
{"persona": "A migraine patient tracking headache patterns", "persona_chinese": "一位跟踪头痛模式的偏头痛患者"}
{"persona": "An epilepsy patient monitoring seizure frequency", "persona_chinese": "一位监测癫痫发作频率的癫痫患者"}
{"persona": "A multiple sclerosis patient managing fatigue", "persona_chinese": "一位管理疲劳的多发性硬化症患者"}
{"persona": "A Parkinson's patient experiencing medication timing issues", "persona_chinese": "一位遇到用药时间问题的帕金森病患者"}
{"persona": "A thyroid disorder patient adjusting hormone replacement", "persona_chinese": "一位调整激素替代的甲状腺疾病患者"}
{"persona": "A chronic kidney disease patient monitoring diet restrictions", "persona_chinese": "一位监控饮食限制的慢性肾病患者"}
{"persona": "A heart failure patient tracking fluid intake and symptoms", "persona_chinese": "一位跟踪液体摄入和症状的心力衰竭患者"}
{"persona": "A person experiencing persistent anxiety and worry", "persona_chinese": "一位持续焦虑和担忧的人"}
{"persona": "An individual with depression seeking treatment options", "persona_chinese": "一位寻求治疗选择的抑郁症患者"}
{"persona": "A panic disorder patient learning coping strategies", "persona_chinese": "一位学习应对策略的恐慌症患者"}
{"persona": "A PTSD survivor working through trauma triggers", "persona_chinese": "一位应对创伤触发因素的创伤后应激障碍幸存者"}
{"persona": "An OCD patient managing intrusive thoughts", "persona_chinese": "一位管理侵入性思维的强迫症患者"}
{"persona": "A bipolar disorder patient monitoring mood swings", "persona_chinese": "一位监测情绪波动的双相情感障碍患者"}
{"persona": "A social anxiety sufferer building confidence", "persona_chinese": "一位建立信心的社交焦虑症患者"}
{"persona": "An eating disorder patient in recovery", "persona_chinese": "一位康复中的饮食失调症患者"}
{"persona": "A substance use disorder individual seeking support", "persona_chinese": "一位寻求支持的物质使用障碍患者"}
{"persona": "A grief-stricken person coping with loss", "persona_chinese": "一位应对失去的悲伤者"}
{"persona": "A person experiencing burnout from overwork", "persona_chinese": "一位因过度工作而感到倦怠的人"}
{"persona": "An insomnia sufferer seeking sleep improvement", "persona_chinese": "一位寻求改善睡眠的失眠症患者"}
{"persona": "A person with ADHD managing focus and organization", "persona_chinese": "一位管理注意力和组织能力的注意力缺陷多动障碍患者"}
{"persona": "An autism spectrum individual navigating social situations", "persona_chinese": "一位在社交场合中寻找方向的自闭症谱系障碍患者"}
{"persona": "A person experiencing sudden severe chest pain", "persona_chinese": "一位突然出现严重胸痛的人"}
{"persona": "An individual with high fever and persistent cough", "persona_chinese": "一位持续高烧和咳嗽的人"}
{"persona": "A patient with severe abdominal pain and vomiting", "persona_chinese": "一位严重腹痛和呕吐的患者"}
{"persona": "Someone experiencing sudden vision changes", "persona_chinese": "一位突然视力变化的人"}
{"persona": "A person with severe allergic reaction symptoms", "persona_chinese": "一位出现严重过敏反应症状的人"}
{"persona": "An individual with suspected food poisoning", "persona_chinese": "一位疑似食物中毒的人"}
{"persona": "A patient experiencing dizziness and fainting spells", "persona_chinese": "一位经历头晕和昏厥发作的患者"}
{"persona": "Someone with unexplained weight loss", "persona_chinese": "一位不明原因体重下降的人"}
{"persona": "A person with persistent night sweats", "persona_chinese": "一位持续盗汗的人"}
{"persona": "An individual experiencing unusual fatigue", "persona_chinese": "一位感到异常疲劳的人"}
{"persona": "A patient with new onset seizures", "persona_chinese": "一位新发癫痫发作的患者"}
{"persona": "Someone with severe headache unlike usual patterns", "persona_chinese": "一位出现与平常不同的严重头痛的人"}
{"persona": "A person with sudden limb weakness or numbness", "persona_chinese": "一位突然肢体无力或麻木的人"}
{"persona": "An individual with difficulty breathing at rest", "persona_chinese": "一位静息时呼吸困难的人"}
{"persona": "A health-conscious individual planning a balanced diet", "persona_chinese": "一位计划均衡饮食的注重健康的人"}
{"persona": "A fitness enthusiast seeking workout optimization", "persona_chinese": "一位寻求优化锻炼的健身爱好者"}
{"persona": "A vegan looking for complete nutrition guidance", "persona_chinese": "一位寻求全面营养指导的纯素食者"}
{"persona": "A marathon runner preparing for an event", "persona_chinese": "一位为赛事准备的马拉松跑者"}
{"persona": "A bodybuilder optimizing protein intake", "persona_chinese": "一位优化蛋白质摄入的健美运动员"}
{"persona": "A weight loss seeker with 50 pounds to lose", "persona_chinese": "一位需要减重50磅的减肥者"}
{"persona": "An underweight person trying to gain healthy mass", "persona_chinese": "一位试图健康增重的体重不足者"}
{"persona": "A shift worker managing irregular eating schedules", "persona_chinese": "一位管理不规律饮食时间的轮班工人"}
{"persona": "A traveler seeking vaccination and travel health advice", "persona_chinese": "一位寻求疫苗接种和旅行健康建议的旅行者"}
{"persona": "A soon-to-be parent preparing for conception", "persona_chinese": "一位准备怀孕的准父母"}
{"persona": "A smoking cessation candidate seeking support", "persona_chinese": "一位寻求支持的戒烟候选者"}
{"persona": "An alcohol reduction seeker for health improvement", "persona_chinese": "一位为改善健康而减少饮酒的人"}
{"persona": "A sedentary office worker starting fitness journey", "persona_chinese": "一位开始健身之旅的久坐办公室工作者"}
{"persona": "A senior wanting bone density improvement strategies", "persona_chinese": "一位想要改善骨密度策略的老年人"}
{"persona": "A person with family cancer history seeking prevention", "persona_chinese": "一位有癌症家族史寻求预防的人"}
{"persona": "A patient experiencing side effects from new medication", "persona_chinese": "一位新药出现副作用的患者"}
{"persona": "An individual confused about multiple medication interactions", "persona_chinese": "一位对多种药物相互作用感到困惑的人"}
{"persona": "A person forgetting to take medications regularly", "persona_chinese": "一位经常忘记服药的人"}
{"persona": "A patient wanting to understand medication mechanisms", "persona_chinese": "一位想了解药物作用机制的患者"}
{"persona": "An individual seeking natural alternatives to prescriptions", "persona_chinese": "一位寻求处方药天然替代品的人"}
{"persona": "A person managing both prescription and OTC medications", "persona_chinese": "一位同时管理处方药和非处方药的人"}
{"persona": "A patient concerned about long-term medication effects", "persona_chinese": "一位担心药物长期影响的患者"}
{"persona": "An individual adjusting to insulin therapy", "persona_chinese": "一位适应胰岛素治疗的人"}
{"persona": "A chemotherapy patient managing treatment side effects", "persona_chinese": "一位管理化疗副作用的患者"}
{"persona": "A person on anticoagulants monitoring dietary interactions", "persona_chinese": "一位服用抗凝剂监测饮食相互作用的人"}
{"persona": "An antibiotic user experiencing gastrointestinal issues", "persona_chinese": "一位使用抗生素出现胃肠道问题的人"}
{"persona": "A pain medication user seeking non-addictive alternatives", "persona_chinese": "一位寻求非成瘾性替代品的镇痛药使用者"}
{"persona": "A steroid patient managing dosage tapering", "persona_chinese": "一位管理类固醇剂量递减的患者"}
{"persona": "An immunosuppressant user monitoring infection risks", "persona_chinese": "一位监测感染风险的免疫抑制剂使用者"}
{"persona": "A pregnant woman in first trimester with morning sickness", "persona_chinese": "一位怀孕初期孕吐的孕妇"}
{"persona": "A breastfeeding mother concerned about medication safety", "persona_chinese": "一位担心药物安全的哺乳期母亲"}
{"persona": "A transgender individual navigating hormone therapy", "persona_chinese": "一位进行激素治疗的跨性别者"}
{"persona": "An athlete recovering from sports injury", "persona_chinese": "一位从运动损伤中恢复的运动员"}
{"persona": "A cancer survivor monitoring for recurrence", "persona_chinese": "一位监测复发的癌症幸存者"}
{"persona": "A transplant recipient managing immunosuppression", "persona_chinese": "一位管理免疫抑制的移植受者"}
{"persona": "A healthcare worker exposed to infectious diseases", "persona_chinese": "一位接触传染病的医护人员"}
{"persona": "A military veteran with service-related health issues", "persona_chinese": "一位有服役相关健康问题的退伍军人"}
{"persona": "A refugee adjusting to new healthcare system", "persona_chinese": "一位适应新医疗系统的难民"}
{"persona": "An international student navigating US healthcare", "persona_chinese": "一位在美国医疗系统中寻找方向的国际学生"}
{"persona": "A homeless individual with limited healthcare access", "persona_chinese": "一位医疗资源有限的无家可归者"}
{"persona": "A rural resident with limited specialist access", "persona_chinese": "一位专科医生资源有限的农村居民"}
{"persona": "A deaf patient seeking accessible healthcare communication", "persona_chinese": "一位寻求无障碍医疗沟通的聋哑患者"}
{"persona": "A wheelchair user with mobility-related health concerns", "persona_chinese": "一位有行动相关健康问题的轮椅使用者"}
{"persona": "A construction worker with chronic back pain", "persona_chinese": "一位患有慢性背痛的建筑工人"}
{"persona": "A nurse experiencing compassion fatigue", "persona_chinese": "一位经历同情疲劳的护士"}
{"persona": "A truck driver managing long-haul health challenges", "persona_chinese": "一位管理长途健康挑战的卡车司机"}
{"persona": "A teacher losing voice from overuse", "persona_chinese": "一位因过度使用而失声的教师"}
{"persona": "A chef with repetitive strain injury", "persona_chinese": "一位患有重复性劳损的厨师"}
{"persona": "A firefighter monitoring lung health", "persona_chinese": "一位监测肺部健康的消防员"}
{"persona": "A pilot managing jet lag and circadian disruption", "persona_chinese": "一位管理时差和昼夜节律紊乱的飞行员"}
{"persona": "A musician with performance anxiety", "persona_chinese": "一位有表演焦虑的音乐家"}
{"persona": "A dentist experiencing neck and shoulder strain", "persona_chinese": "一位颈肩劳损的牙医"}
{"persona": "A hairstylist with contact dermatitis concerns", "persona_chinese": "一位担心接触性皮炎的发型师"}
{"persona": "A data analyst with digital eye strain", "persona_chinese": "一位患有数字眼疲劳的数据分析师"}
{"persona": "A farmer exposed to pesticides seeking health monitoring", "persona_chinese": "一位接触农药寻求健康监测的农民"}
{"persona": "A factory worker with noise-induced hearing concerns", "persona_chinese": "一位担心噪音性听力损失的工厂工人"}
{"persona": "A coal miner monitoring respiratory health", "persona_chinese": "一位监测呼吸系统健康的煤矿工人"}
{"persona": "A patient with abnormal blood test results seeking explanation", "persona_chinese": "一位血液检查结果异常寻求解释的患者"}
{"persona": "An individual confused by complex imaging report", "persona_chinese": "一位对复杂影像报告感到困惑的人"}
{"persona": "A person comparing lab results over multiple years", "persona_chinese": "一位比较多年实验室结果的人"}
{"persona": "A patient wanting to understand genetic test implications", "persona_chinese": "一位想了解基因检测意义的患者"}
{"persona": "An individual interpreting cardiovascular stress test results", "persona_chinese": "一位解读心血管压力测试结果的人"}
{"persona": "A person reviewing cancer screening results", "persona_chinese": "一位查看癌症筛查结果的人"}
{"persona": "A diabetic monitoring A1C trend over time", "persona_chinese": "一位监测糖化血红蛋白趋势的糖尿病患者"}
{"persona": "A patient understanding cholesterol panel breakdown", "persona_chinese": "一位了解胆固醇面板分解的患者"}
{"persona": "An individual interpreting thyroid function test results", "persona_chinese": "一位解读甲状腺功能检查结果的人"}
{"persona": "A person reviewing bone density scan findings", "persona_chinese": "一位查看骨密度扫描结果的人"}
{"persona": "A Spanish-speaking patient navigating English healthcare system", "persona_chinese": "一位在英语医疗系统中寻找方向的西班牙语患者"}
{"persona": "A Chinese immigrant seeking culturally-appropriate dietary advice", "persona_chinese": "一位寻求文化适宜饮食建议的中国移民"}
{"persona": "An Indian patient balancing Ayurvedic and Western medicine", "persona_chinese": "一位平衡阿育吠陀和西医的印度患者"}
{"persona": "A Muslim individual seeking halal dietary guidance", "persona_chinese": "一位寻求清真饮食指导的穆斯林"}
{"persona": "A Jewish patient following kosher restrictions in medical diet", "persona_chinese": "一位在医疗饮食中遵循犹太教规的犹太患者"}
{"persona": "A Latino family seeking pediatric care advice", "persona_chinese": "一位寻求儿科护理建议的拉丁裔家庭"}
{"persona": "An African American patient with sickle cell disease", "persona_chinese": "一位患有镰状细胞病的非裔美国患者"}
{"persona": "An Asian patient concerned about lactose intolerance", "persona_chinese": "一位担心乳糖不耐受的亚裔患者"}
{"persona": "A Middle Eastern refugee with trauma history", "persona_chinese": "一位有创伤史的中东难民"}
{"persona": "A Native American individual incorporating traditional healing", "persona_chinese": "一位融合传统疗法的美洲原住民"}
{"persona": "A 49-year-old male with sudden right lower quadrant pain and palpable mass after defecation, suspected external abdominal hernia, previously healthy, symptoms for 3 hours.", "persona_chinese": "49岁男性，排便后突发右下腹痛并触及包块，疑腹外疝，既往体健，症状3小时。"}
{"persona": "A 59-year-old woman with 30-year GERD, LA-B esophagitis and hiatal hernia; persistent reflux-related cough; partial PPI response; reduced quality of life.", "persona_chinese": "59岁女性，患30年胃食管反流，伴LA-B反流性食管炎及裂孔疝；咳嗽反复，PPI部分缓解，生活质量下降。"}
{"persona": "A 34-year-old male with a two-year history of prolapsing hemorrhoids, now one week of post-defecation spotting, otherwise stable without systemic symptoms.", "persona_chinese": "一名34岁男性，痔疮反复脱出2年，近1周便后点滴出血，无发热恶心呕吐或腹泻，整体情况稳定。"}
{"persona": "A 50-year-old male with a 3-month cauliflower-like penile lesion, bleeding and malodor, likely penile cancer; clinically stable, seeking further treatment.", "persona_chinese": "50岁男性，3个月冠状沟菜花样阴茎肿物，糜烂出血伴臭味，疑阴茎癌；全身情况尚可，求进一步治疗。"}
{"persona": "A 44-year-old male with recurrent nephrolithiasis and significant hypercalcemia (3.1 mmol/L), under evaluation for primary hyperparathyroidism; no bone/joint pain.", "persona_chinese": "44岁男性，反复肾结石且血钙显著升高（3.1mmol/L），正在评估原发性甲状旁腺功能亢进；无骨关节疼痛。"}
{"persona": "A 3-year-old boy with suspected Wilms tumor, presenting with a painless enlarging right upper abdominal mass for 4 months, occasional low-grade fever, decreased appetite.", "persona_chinese": "3岁男童，疑肾母细胞瘤，右上腹无痛性肿块4个月并增大，近来偶发低热、食欲下降，余基本稳定。"}
{"persona": "A 24-year-old male with suspected splenic rupture 7 days after left lower chest trauma; syncope while lifting, admitted two hours later.", "persona_chinese": "24岁男性，左下胸车祸伤后第7天疑脾破裂；搬重物突发晕厥，2小时后入院。"}
{"persona": "A 61-year-old woman with suspected extrahepatic bile duct stones; one month of upper abdominal pain, worsened over three days; afebrile, anicteric, otherwise stable.", "persona_chinese": "61岁女性，疑肝外胆管结石；上腹痛1个月，近3天加重；无发热及明显黄疸，生命体征稳定。"}
{"persona": "An adult patient with traumatic bladder rupture after a fall, severe lower abdominal pain and oliguria, now hospitalized with catheter for urgent management.", "persona_chinese": "成人患者，跌倒后外伤性膀胱破裂，下腹剧痛、少尿，已置导尿管急诊入院治疗，无恶心、呕吐或发热。"}
{"persona": "A 39-year-old woman with 3-year poorly controlled hypertension, recent hypertensive crisis, now stabilized; CT shows 3.5 cm left adrenal mass suspicious for pheochromocytoma.", "persona_chinese": "39岁女性，3年高血压控制差，近期高血压危象后稳定；腹部CT示左侧3.5cm肾上腺肿物，疑嗜铬细胞瘤。"}
{"persona": "A 12-year-old boy with five years of exertional dizziness, fatigue, dyspnea, palpitations, prior anemia diagnosis; now hospitalized with moderate anemia, mild jaundice, marked splenomegaly.", "persona_chinese": "12岁男孩，运动后头晕乏力气促心悸5年，既往贫血；现住院评估，体检示中度贫血、轻度黄疸、脾大达脐。"}
{"persona": "A 70-year-old male from Henan with suspected esophageal cancer, two weeks of progressive dysphagia to solids; otherwise stable without weight loss.", "persona_chinese": "70岁男性，河南籍，疑似食管癌，两周进行性吞咽困难，以硬食为主；总体状况稳定，无体重下降。"}
{"persona": "A 47-year-old male with subarachnoid hemorrhage from ruptured intracranial AVM; 10-day dizziness, nausea, intermittent speech confusion and limb weakness, fever, now seeking further care.", "persona_chinese": "47岁男性，因颅内AVM破裂致蛛网膜下腔出血；10天眩晕恶心、间歇言语混乱与肢体乏力，伴发热，来院求治。"}
{"persona": "A middle-aged adult with lumbar disc herniation, year-long low back and left leg radicular pain, recently worsened by one month of bilateral leg numbness.", "persona_chinese": "一名中年患者，腰椎间盘突出，腰痛并左下肢放射痛一年，近一月加重并出现双下肢麻木。"}
{"persona": "A 51-year-old male with colon cancer and liver metastases, experiencing one month of hepatic discomfort, fatigue, poor appetite, and intermittent right mid-abdominal dull pain.", "persona_chinese": "51岁男性，结肠癌肝转移，近1月肝区胀痛、乏力、食欲差，偶右中腹隐痛，无发热呕吐腹泻及肝炎史。"}
{"persona": "A 33-year-old male with renovascular hypertension, presenting with dizziness and blurred vision; peak BP 238/137 mmHg, now partially controlled on telmisartan/HCTZ.", "persona_chinese": "33岁男性，肾血管性高血压，头晕视物模糊起病；峰值血压238/137mmHg，现用替米沙坦/氢氯噻嗪部分控制。"}
{"persona": "A 38-year-old male with progressive left lower abdominal mass, prior bilateral orchiopexy, left undescended testis; infertile, hospitalized for suspected malignant transformation.", "persona_chinese": "38岁男性，既往双侧隐睾手术，左侧仍未降。左下腹包块进行性增大2年，不育，现入院疑恶变。"}
{"persona": "A 75-year-old male with progressive headache and left-sided weakness over two days, probable chronic subdural hematoma after minor head trauma; worsening yet conscious.", "persona_chinese": "75岁男性，近两天头痛加重伴左侧乏力，疑慢性硬膜下血肿，步态不稳，意识清楚。"}
{"persona": "A 66-year-old woman with a three-year history of gallbladder stones, 10 days of right upper quadrant dull pain, afebrile, anicteric, otherwise stable.", "persona_chinese": "66岁女性，胆囊结石3年史，右上腹隐痛10天，无黄疸、发热、恶心、呕吐和腹泻，无肝炎史，病情稳定。"}
{"persona": "A 54-year-old male with a new left abdominal mass and recent hematuria, hospitalized for evaluation of suspected renal cancer.", "persona_chinese": "54岁男性，左上腹可触肿块伴2天血尿，疑肾癌入院评估，偶有左腰不适。"}
{"persona": "A 56-year-old sanitation worker with acute purulent hand infection after bamboo splinter injury; index finger and thenar swelling, pain, flexion difficulty, fever 38.6°C.", "persona_chinese": "56岁环卫工，竹刺刺伤后左手急性化脓性感染；示指及大鱼际肿痛、屈曲困难，伴发热38.6℃。"}
{"persona": "A 69-year-old male with acute left lower-limb erysipelas causing fever, chills, and burning pain for two days; history of diabetes and tinea pedis.", "persona_chinese": "69岁男性，左下肢丹毒急性发作，发热畏寒伴烧灼痛2天；既往有糖尿病和长期足癣史。"}
{"persona": "A 42-year-old male with three weeks of chest tightness and widened superior mediastinum, under evaluation for primary mediastinal teratoma; otherwise stable.", "persona_chinese": "42岁男性，胸闷3周，影像示上纵隔明显增宽，正评估原发性纵隔畸胎瘤，除胸闷外一般情况稳定。"}
{"persona": "An adult female with 7-year stress urinary incontinence, worsened over 1 year; cough-induced leakage observed, no pelvic organ prolapse or urinary tract tenderness.", "persona_chinese": "成年女性，7年压力性尿失禁，近1年加重；咳嗽诱发漏尿，检查无盆腔器官脱垂或泌尿道压痛。"}
{"persona": "A 25-year-old male with short bowel syndrome after extensive resection for adhesive ischemic small-bowel obstruction; postoperative recovery ongoing with nutritional management needs.", "persona_chinese": "25岁男性，粘连致小肠缺血坏死广泛切除后短肠综合征；术后恢复中，需营养支持与监测。"}
{"persona": "A 64-year-old female with acute left empyema post-pneumonia, persistent high fever and dyspnea, worsening pleural effusion despite IV antibiotics.", "persona_chinese": "64岁女性，肺炎后左侧急性脓胸，高热与气促持续，胸腔积液加重，静脉抗菌治疗无效。"}
{"persona": "A 6-month-old male with progressive neonatal jaundice and clay-colored stools, suspected biliary atresia; alert, feeding adequate, dark urine, no fever.", "persona_chinese": "6个月男婴，出生后早发进行性黄疸、陶土色大便，疑胆道闭锁；精神可，进食尚可，尿黄，无发热。"}
{"persona": "A 25-day-old male infant with sagittal craniosynostosis, enlarged head circumference since birth; breastfeeding well, no vomiting or fever.", "persona_chinese": "25天男婴，矢状缝早闭，出生即头围增大；母乳喂养良好，无呕吐或发热。"}
{"persona": "A 30-year-old male with moderate-to-severe mitral regurgitation, now postoperative after successful CPB mitral valve replacement, weaned off bypass and recovering.", "persona_chinese": "30岁男性，中重度二尖瓣返流，行体外循环二尖瓣置换术后，已顺利停机，术后恢复中。"}
{"persona": "A 44-year-old male with a year-long enlarging thyroid mass and new hoarseness, likely thyroid carcinoma, otherwise stable without dysphagia.", "persona_chinese": "44岁男性，左侧颈前甲状腺肿块渐大1年，近月声音嘶哑，疑甲状腺癌，整体稳定，无吞咽困难或呛咳。"}
{"persona": "A 48-year-old woman with new-onset generalized seizure; MRI shows right frontoparietal mass suspicious for glioma; currently has intermittent left-hand weakness and numbness.", "persona_chinese": "48岁女性，突发全身性癫痫发作；影像示右额顶区占位疑胶质瘤，现间断左手无力麻木。"}
{"persona": "A 63-year-old male cyclist with severe traumatic brain injury after car collision, unconscious with right ear bleeding and projectile vomiting, now in emergency care.", "persona_chinese": "63岁男性骑行者，车祸致重型颅脑损伤，意识障碍，右耳道出血伴喷射性呕吐，现急诊救治中。"}
{"persona": "A 60-year-old woman with suspected pancreatic cancer, progressive epigastric/back pain, obstructive jaundice, dark urine, pale stools, and 7-kg weight loss.", "persona_chinese": "60岁女性，疑似胰腺癌，进行性上腹与背痛，梗阻性黄疸，尿色深、陶土色便，体重下降7公斤。"}
{"persona": "A 45-year-old male construction worker with duodenal bulb ulcer history, two months of postprandial fullness and non-bilious vomiting, concerning for gastric outlet obstruction.", "persona_chinese": "45岁男性建筑工人，既往十二指肠球部溃疡，近2月餐后饱胀伴非胆汁性呕吐，就诊时考虑胃出口梗阻。"}
{"persona": "A 65-year-old male, one year post-curative gastrectomy, with two weeks of abdominal pain and jaundice; imaging suggests distal CBD malignancy; no response to conservative care.", "persona_chinese": "65岁男性，胃癌根治术后一年，近两周腹痛伴黄疸；影像提示胆总管下段恶性病变，保守治疗无效。"}
{"persona": "A 31-year-old woman with primary aldosteronism, severe hypokalemia, and left adrenal adenoma; hypertension partially controlled on medication, recently developed limb weakness.", "persona_chinese": "31岁女性，原发性醛固酮增多症，低钾显著，左侧肾上腺腺瘤；降压药部分控压，近期出现肢体无力。"}
{"persona": "A 70-year-old male with a left posterior neck carbuncle, febrile with foul purulent drainage; longstanding diabetes and hypertension complicate his acute infection.", "persona_chinese": "70岁男性，左后颈部痈肿破溃，恶臭脓性分泌物流出并发热；既往糖尿病15年、高血压20年，处于急性感染期。"}
{"persona": "A 54-year-old male with acute left knee pain and limited motion 3 hours after a car accident, likely tibial plateau fracture, previously healthy.", "persona_chinese": "54岁男性，车祸后3小时左膝疼痛、活动受限，既往体健，考虑胫骨平台骨折。"}
{"persona": "A 59-year-old male with progressive epigastric pain, anorexia, and 5-kg weight loss, likely gastric cancer; history of H. pylori gastritis.", "persona_chinese": "59岁男性，进行性上腹痛、食欲减退与5公斤体重下降，疑胃癌；既往幽门螺杆菌相关慢性胃炎。"}
{"persona": "A 50-year-old woman with suspected acute liver failure, two weeks of jaundice, profound fatigue, nausea, and vomiting, without prior history, needing urgent evaluation.", "persona_chinese": "50岁女性，疑急性肝衰竭，黄疸、极度乏力伴恶心呕吐已2周，无明显既往史，急需评估处理。"}
{"persona": "A 67-year-old male with intracranial hemorrhage, 14+ hours of worsening dizziness, ataxia, single emesis, and progressive impaired consciousness despite initial symptomatic treatment.", "persona_chinese": "67岁男性，颅内出血，14余小时头晕加重，步态不稳，呕吐1次，意识进行性受损，经初步对症治疗无明显缓解。"}
{"persona": "A 31-year-old male with moyamoya-related subarachnoid hemorrhage, persistent severe headaches, and uncontrolled hypertension despite nifedipine; currently symptomatic, no focal deficits.", "persona_chinese": "31岁男性，烟雾病致蛛网膜下腔出血；头痛持续加重、伴恶心，高血压控制差，服硝苯地平，现无明显神经缺损。"}
{"persona": "A 37-year-old female with right-hand crush injury, multiple finger fractures, and partial distal little-finger amputation, arriving one hour after machine accident.", "persona_chinese": "37岁女性，右手压砸伤伴多指骨折及小指远节不全离断，伤后一小时到院就诊。"}
{"persona": "A 65-year-old male with screening-detected elevated PSA and biopsy-confirmed prostate cancer one month ago; asymptomatic, smooth enlarged prostate on exam.", "persona_chinese": "65岁男性，筛查发现PSA升高，1月前穿刺确诊前列腺癌；目前无症状，指检腺体光滑轻度增大。"}
{"persona": "[A 59-year-old male heavy smoker with 3 months of worsening cough, low-grade fever, fatigue, blood-streaked sputum; suspected primary lung cancer.]", "persona_chinese": "[59岁男性，长期吸烟者，咳嗽加重3月，低热乏力并痰中带血1月，口服治疗无效，疑原发性肺癌。]"}
{"persona": "A 31-year-old female with suspected familial adenomatous polyposis, two months of increased loose stools and intermittent melena, otherwise stable and afebrile.", "persona_chinese": "31岁女性，疑家族性腺瘤性息肉病，近两月大便增多稀烂、间断黑便，无发热腹痛等，全身情况稳定。"}
{"persona": "A 32-year-old male with aneurysmal subarachnoid hemorrhage from multiple intracranial aneurysms, recurrent sudden headaches and nausea, currently hospitalized for further evaluation and treatment.", "persona_chinese": "32岁男性，因多发颅内动脉瘤致蛛网膜下腔出血，反复突发头痛伴恶心，现住院进一步评估与治疗。"}
{"persona": "A 32-year-old male with one month of painless right scrotal enlargement, suspected testicular tumor; history of childhood orchiopexy, currently undergoing evaluation.", "persona_chinese": "32岁男性，右侧阴囊无痛性增大1月，疑似睾丸肿瘤；幼年行隐睾固定术，目前就诊评估中。"}
{"persona": "A 35-year-old woman with hepatic cystic echinococcosis complicated by biliary fistula, presenting with two weeks of intermittent fever and epigastric discomfort.", "persona_chinese": "35岁女性，囊型肝包虫病合并胆瘘，近2周间断发热、上腹胀痛1周，现就诊评估治疗。"}
{"persona": "A 22-year-old male with left varicocele causing scrotal heaviness for one year; worsens with standing/exercise, improves with rest; hospitalized for evaluation.", "persona_chinese": "22岁男性，左侧精索静脉曲张，阴囊坠胀1年，久站/运动加重，平卧缓解，已入院评估治疗。"}
{"persona": "A 49-year-old male with acute suppurative peritonitis and subphrenic abscess, two weeks of abdominal pain, distension, fever, one week jaundice; longstanding cholelithiasis and cholangitis.", "persona_chinese": "49岁男性，急性化脓性腹膜炎伴膈下脓肿，腹痛腹胀发热2周、黄疸1周，既往胆囊结石和胆管炎病史。"}
{"persona": "A 7-year-old boy with suspected cholangitis from bile duct dilatation, 3 days of abdominal pain and fever, new jaundice, dark urine, poor appetite, and malaise.", "persona_chinese": "7岁男童，疑胆管扩张致胆管炎，腹痛发热3天，新发黄疸，尿茶色，偶陶土样便，食欲差，精神差。"}
{"persona": "A medical patient with 急腹症的诊断与鉴别诊断 案例分析-胆管炎", "persona_chinese": "一位急腹症的诊断与鉴别诊断 案例分析-胆管炎的患者"}
{"persona": "An adult postoperative patient after car crash trauma with acute suppurative peritonitis and abdominal compartment syndrome, critically ill with multi-organ dysfunction for three days.", "persona_chinese": "一名成年术后患者，车祸外伤后出现急性化脓性腹膜炎和腹腔间隔室综合征，危重伴多器官功能障碍已3天。"}
{"persona": "A 52-year-old male with 16-year poorly controlled hypertension, now with acute Stanford type B aortic dissection after 4 hours of tearing chest and back pain.", "persona_chinese": "52岁男性，16年高血压控制不佳，突发胸背撕裂样疼痛4小时，现为急性Stanford B型主动脉夹层。"}
{"persona": "A 75-year-old male with a two-week thyroid mass and choking on liquids, no hoarseness, undergoing preoperative evaluation for general anesthesia.", "persona_chinese": "75岁男性，体检发现甲状腺占位2周，饮水呛咳无声音嘶哑，现行全身麻醉术前评估。"}
{"persona": "A 52-year-old woman with decade-long acromegaly from likely GH-secreting pituitary adenoma, now with 6-month progressive bilateral visual decline, untreated.", "persona_chinese": "52岁女性，疑生长激素分泌性垂体腺瘤致肢端肥大十余年，近半年双眼视力进行性下降，未治疗。"}
{"persona": "A 33-year-old woman with long-standing recurrent preprandial hypoglycemia from suspected insulinoma, worsening over 2.5 years with neuroglycopenic episodes relieved by food.", "persona_chinese": "33岁女性，疑胰岛素瘤致长期餐前低血糖，近2.5年加重，发作伴意识障碍和出汗，进食后缓解。"}
{"persona": "A 65-year-old male with one month of painless gross hematuria, suspected bladder cancer; stable vitals, no irritative urinary symptoms, heavy smoker, otherwise well.", "persona_chinese": "65岁男性，1月无痛性肉眼血尿，疑膀胱癌；生命体征平稳，无尿频尿急尿痛，重度吸烟者，整体状况良好。"}
{"persona": "A 32-year-old woman with long-standing severe obesity (peak 240 kg), joint pain and exertional breathlessness; prior diet/exercise/acupuncture failed; otherwise stable without OSA or hypertension.", "persona_chinese": "32岁女性，十余年重度肥胖（最高240公斤），伴关节痛、步行气喘；节食、运动、针灸无效；无睡眠呼吸暂停或高血压，整体稳定。"}
{"persona": "A 28-year-old male farmer with a left-hand snakebite, 24 hours of persistent swelling and pain, post local wound care, otherwise healthy.", "persona_chinese": "28岁男性农民，左手蛇咬伤，持续肿痛24小时，基层已消毒包扎，现来院就诊，既往体健。"}
{"persona": "A 29-year-old woman with intermittent epigastric pain and a 3-cm gastric submucosal mass, suspected GIST; anemic, positive fecal occult blood test, under evaluation.", "persona_chinese": "29岁女性，间歇性上腹痛，胃镜见约3cm胃大弯黏膜下肿物，疑胃间质瘤；贫血，便潜血阳性，评估中。"}
{"persona": "A 65-year-old male with one week of recurrent dark red hematochezia, now worsened by ~600 mL bleed, dizziness, mental dullness, and oliguric acute kidney injury.", "persona_chinese": "65岁男性，反复暗红色便血1周，近期约600ml再发，加重至头晕、神志淡漠，并出现少尿性急性肾损伤。"}
{"persona": "A 24-year-old postpartum woman, three weeks into breastfeeding, with two days of painful left breast swelling and sudden high fever, consistent with acute mastitis.", "persona_chinese": "24岁产后哺乳3周女性，左乳胀痛2天，突发高热伴乏力，临床考虑急性乳腺炎。"}
{"persona": "A 52-year-old male with suspected perforated peptic ulcer, sudden severe epigastric pain, fever, acute abdomen, after months of postprandial dyspepsia.", "persona_chinese": "52岁男性，疑胃十二指肠溃疡穿孔；突发剧烈上腹痛伴发热，呈急腹症；既往半年餐后隐痛、反酸嗳气。"}
{"persona": "A 21-year-old male with progressive left distal femur pain and night pain; X-ray suggests bone tumor; recently hospitalized for evaluation.", "persona_chinese": "21岁男性，左股骨远端疼痛进行性加重伴夜间痛；膝X线示异常占位疑骨肿瘤，近期入院评估。"}
{"persona": "A 28-year-old female with right nephroptosis, chronic dull right flank pain for 6 months; occasional palpitations, fatigue, insomnia, dizziness; no urinary symptoms, otherwise stable.", "persona_chinese": "28岁女性，右肾下垂，右腰部持续钝痛6个月，偶有心悸、乏力、失眠、眩晕，无泌尿刺激症状，整体情况稳定。"}
{"persona": "A 52-year-old woman with atrial septal defect, experiencing two years of exertional palpitations and dyspnea, worsened after a cold; cough improved, persistent exertional symptoms.", "persona_chinese": "52岁女性，房间隔缺损，活动后心悸胸闷气促2年，感冒后加重；抗感染利尿后咳嗽缓解，但活动后症状仍持续。"}
{"persona": "A 46-year-old male truck driver with a 1-year history of erectile dysfunction, worsened over 3 months; diabetic for 3 years, now seeking evaluation.", "persona_chinese": "46岁男性货车司机，勃起功能障碍1年，近3月加重；糖尿病3年，现就诊评估。"}
{"persona": "A 62-year-old woman with suspected intrahepatic bile duct stones, 1-month epigastric and chest/back discomfort worsening over 2 days, without jaundice, fever, or GI symptoms.", "persona_chinese": "62岁女性，疑似肝内胆管结石，1个月上腹及胸背部不适，加重2天，无黄疸、发热、恶心呕吐或腹泻。"}
{"persona": "An 80-year-old male with painless progressive jaundice; CT shows a pancreatic head mass, suspected pancreatic cancer; otherwise healthy, under evaluation for surgery.", "persona_chinese": "80岁男性，无痛性进行性黄疸半月余；CT示胰头肿物疑胰腺癌；体健，正评估手术。"}
{"persona": "A 30-year-old male presenting two hours after a 5-meter fall with acute abdominal and right shoulder pain, under evaluation for suspected liver laceration.", "persona_chinese": "30岁男性，坠落约5米后2小时就诊，腹痛伴右肩痛，疑为肝破裂，急诊评估中。"}
{"persona": "A 42-year-old woman with a painless right breast mass for one month, no nipple discharge, stable, undergoing evaluation for suspected breast cancer.", "persona_chinese": "42岁女性，右乳无痛性肿块1月余，无乳头溢液，病情平稳，正接受评估，考虑乳腺癌可能。"}
{"persona": "A 67-year-old male with biopsy-confirmed scrotal Paget disease, three-year enlarging pruritic ulcer refractory to topical therapy, recently diagnosed.", "persona_chinese": "一名67岁男性，活检确诊阴囊Paget病，三年进行性瘙痒性溃疡，长期皮肤病治疗无效，近期确诊。"}
{"persona": "A 75-year-old gentleman seeking attentive evaluation for recent health worries; values clear explanations, family involvement, and a calm, respectful care approach.", "persona_chinese": "75岁男士，近期对健康有疑虑，盼全面评估；愿与家人同行，期待耐心倾听与清楚说明，共商照护计划。"}
{"persona": "An adult seeking thoughtful care, describing recent changes in energy and comfort, hoping for clear guidance and a compassionate evaluation.", "persona_chinese": "一位成年人前来就诊，近日体力与睡眠有变化，期待被耐心倾听，获得清晰说明与贴心评估。"}
{"persona": "A 65-year-old man seeking care for recent health changes, values clear guidance, hopes to stay active, and wants a thoughtful, respectful evaluation.", "persona_chinese": "65岁男性，近期感到身体变化前来评估；期望清楚解释与耐心倾听，重视家庭支持，并努力保持独立与日常活力。"}
{"persona": "A 67-year-old man returning for benign prostatic hyperplasia follow-up reports recently worsening storage-predominant LUTS—urinary frequency, urgency, and increased nocturia. He denies dysuria, hematuria, flank pain, fever/chills, or abdominal discomfort; seeks treatment options.", "persona_chinese": "67岁男性，前列腺增生复诊；近期贮尿期症状加重：尿频、尿急、夜尿明显增多。否认尿痛、血尿、腰痛、发热寒战及腹痛腹胀；希望获得进一步治疗方案。"}
{"persona": "At 65, he presents with persistently elevated PSA (5.56 ng/mL; f/t ratio 0.19), MRI showing BPH with prostatitis and a left TZ apical PI-RADS 3 nodule; recent biopsy benign, seeking treatment guidance.", "persona_chinese": "65岁男性，PSA持续升高（5.56 ng/mL，游离/总比值0.19）；MRI提示前列腺增生伴前列腺炎，左侧尖部移行带PI‑RADS 3结节；近期穿刺良性，咨询后续治疗。"}
{"persona": "With years of resistant hypertension (~150/105 on metoprolol, HCTZ, amlodipine), she now seeks management for a newly discovered 21‑mm right adrenal nodule—homogeneous, smooth, moderately enhancing on CT; adenoma suspected. Hysteroscopic myomectomy in 2017.", "persona_chinese": "她长期顽固性高血压（约150/105，服用美托洛尔、氢氯噻嗪、氨氯地平），因新发现右肾上腺21 mm结节寻求治疗方案；CT均匀、边缘整齐、中度强化，倾向腺瘤；2017年行宫腔镜肌瘤切除。"}
{"persona": "Over five years, a 60-year-old man has developed progressively worsening voiding difficulty—marked hesitancy, rare nocturia (0–1/night)—without frequency, urgency, dysuria, fever, or hematuria. Doxazosin offers limited benefit; he seeks alternatives for obstructive LUTS.", "persona_chinese": "近5年逐渐进展的排尿困难，60岁男性；以明显尿等待为主，夜尿稀少（0–1次），无尿频、尿急、尿痛、发热或肉眼血尿。多沙唑嗪效果有限，寻求阻塞性LUTS治疗选择。"}
{"persona": "He seeks care after two days of right-sided flank pain and oliguria; CT reveals bilateral proximal ureteral calculi with hydronephrosis, leukocytosis with neutrophilia, CRP 91, acidemia (pH 7.28), and severe obstructive AKI (creatinine 865).", "persona_chinese": "他因两天右侧腰痛与少尿就诊；CT示双侧近端输尿管结石伴肾积水，化验见白细胞15.6、中性粒83%、CRP 91、pH 7.28、肌酐865，提示阻塞性急性肾损伤并炎症反应。"}
{"persona": "An elderly man, 75, returns for BPH follow-up with recent irritative LUTS—frequency, urgency, and marked nocturia—without dysuria, hematuria, flank/back or abdominal pain, fever or chills; he seeks management guidance.", "persona_chinese": "他为75岁男性，因前列腺增生复诊；近期出现刺激性下尿路症状：尿频、尿急、夜尿显著增加。否认尿痛、血尿、腰背或腹部疼痛、发热寒战，寻求治疗建议。"}
{"persona": "He seeks care for over two years of gross hematuria. PSA 0.8 ng/mL, MRI: BPH protruding into bladder, right peripheral PI-RADS 3; biopsy shows Gleason 3+3 prostate adenocarcinoma. Hypertension on nifedipine, TIA three years ago.", "persona_chinese": "他因持续2年多的肉眼血尿就诊。PSA 0.8 ng/mL；MRI示前列腺增生上突膀胱底，右侧周围带PI-RADS 3；穿刺证实前列腺腺癌Gleason 3+3。既往高血压服硝苯地平，3年前曾有TIA。"}
{"persona": "An 83-year-old man describes several months of lower urinary tract symptoms—frequency, urgency, hesitancy, weak stream—without hematuria or urethral pain. Otherwise well: normal appetite, bowel habits, and sleep, with stable weight, concerned about management.", "persona_chinese": "83岁男性，数月来出现下尿路症状：尿频、尿急、排尿等待与尿流弱；无血尿或尿道痛。其余状况良好，食欲、睡眠和排便正常，体重稳定，关注治疗方案。"}
{"persona": "At 70, he returns for BPH follow-up with new irritative LUTS—urinary frequency, urgency, and increased nocturia. No dysuria, hematuria, flank or abdominal pain, or fever. Prior prostate biopsy confirmed benign hyperplasia.", "persona_chinese": "70岁男性复诊，近期出现刺激性下尿路症状：尿频、尿急、夜尿增多。无尿痛、血尿，亦无腰背或腹部疼痛、发热寒战或畏寒。既往前列腺穿刺证实良性增生。"}
{"persona": "Eighty-three-year-old man, one year after prostate laser enucleation, voiding well without LUTS, now notes a PSA of 8.5 ng/mL. He seeks interpretation and guidance on need for further workup or treatment.", "persona_chinese": "83岁男性，前列腺激光剜除术后一年，排尿良好、无下尿路症状；近期体检PSA 8.5 ng/mL，对结果存疑，寻求解释及是否需要进一步评估或治疗的建议。"}
{"persona": "At 74, he reports progressive hesitancy and a weak urinary stream over recent months; an outside hospital noted prostate enlargement (benign prostatic hyperplasia). He now seeks targeted therapy to relieve lower urinary tract obstruction.", "persona_chinese": "他，74岁，近数月出现起尿迟缓、尿流变弱且逐渐加重；外院提示前列腺增大，考虑良性前列腺增生。现寻求缓解下尿路梗阻的针对性治疗方案。"}
{"persona": "An 82-year-old man reports recent progressive voiding difficulty culminating in acute urinary retention; an outside hospital placed an indwelling Foley. He seeks catheter removal and prostate/urothelial tumor markers to exclude malignancy.", "persona_chinese": "82岁男性，近期排尿困难加重并发生急性尿潴留，外院留置Foley导尿管。现希望拔管，并检测前列腺及泌尿系肿瘤标志物以排除恶性病变。"}
{"persona": "At 59, she developed two days of left flank pain; afternoon fever 39.1°C with nausea and emesis, HR 109. CT shows mid‑left ureteral stone with hydronephrosis and cortical atrophy. Labs: pyuria, neutrophilia (85.6%), platelets 83.", "persona_chinese": "59岁女性，左侧腰背痛2天；今下午高热39.1℃，伴恶心呕吐，心率109。CT示左侧输尿管中段结石致上段积水，左肾皮质萎缩。实验室：脓尿，中性粒细胞85.6%，血小板83。"}
{"persona": "She reports sudden, severe right-sided flank and lumbar pain. No fever or nausea/vomiting; visible hematuria with urination, normal bowel movements—features consistent with renal colic from a ureteral stone.", "persona_chinese": "她自述右侧腰背部剧痛骤起。无发热或恶心呕吐；排尿时可见肉眼血尿，排便正常——表现符合肾绞痛，考虑输尿管结石可能。"}
{"persona": "At 51, he reports recent, severe LUTS—frequency, urgency, hesitancy, weak/narrowed stream, incomplete emptying, nocturia x2. MRI shows BPH (39x54x53 mm); PSA 5.547 ng/mL; PVR 60 mL; IPSS 33.", "persona_chinese": "51岁男性，近期重度下尿路症状：尿频、尿急、排尿等待、尿流细弱、排尿不尽，夜尿2次。MRI示前列腺增生（39×54×53 mm）；PSA 5.547 ng/mL；PVR 60 mL；IPSS 33分。"}
{"persona": "Asymptomatic at 63, he was found two weeks ago to harbor a right mid-renal nodule (~2 cm): partial diffusion restriction, arterial hyperenhancement with venous washout, cortical indentation, slight sinus protrusion, intact capsule—clear cell RCC suspected.", "persona_chinese": "63岁，未见症状，两周前发现右肾中部结节（约2厘米）；部分弥散受限，动脉期明显强化、静脉期减弱，伴皮质凹陷与轻度突入肾窦，包膜完整，倾向透明细胞癌。"}
{"persona": "In his late seventies, a man with years-long lower urinary tract symptoms—hesitancy, weak stream, straining, frequency, urgency, nocturia; afebrile—a pattern strongly suggesting benign prostatic hyperplasia with bladder outlet obstruction.", "persona_chinese": "年近八旬男性，长期下尿路症状：排尿迟缓、尿线细、用力排尿，伴尿频、尿急、夜尿多；体温正常，整体表现高度提示良性前列腺增生并膀胱出口梗阻。"}
{"persona": "He, 68, has >2 months of PSA elevation (936 ng/mL). MRI: heterogeneous prostate with central nodules and 9–11 o’clock peripheral lesions. Biopsy cores 6–14 malignant, Gleason 4+4=8 (ISUP 4/5); high-risk prostate adenocarcinoma.", "persona_chinese": "68岁男性，PSA异常升高逾2月（936 ng/mL）。MRI示前列腺信号不均，中央带结节及外周带9–11点病灶。穿刺6–14针癌变，Gleason 4+4=8，ISUP 4/5，考虑高危前列腺腺癌。"}
{"persona": "At 87, with a coronary stent and on anticoagulation, he has two years of urinary frequency/urgency, catheter-dependent retention; PSA 234 ng/mL and PET/CT showing prostate cancer invading bladder/rectum with pelvic nodal metastases and bladder stones.", "persona_chinese": "他87岁，既往冠脉支架，长期抗凝；两年尿频尿急，现为导尿管依赖的尿潴留；PSA 234 ng/mL；PET/CT示前列腺癌侵犯膀胱/直肠，伴盆腔淋巴结转移及膀胱结石。"}
{"persona": "At 72, he’s catheter-dependent after 10 days of indwelling Foley for urinary retention with obstructive voiding symptoms. PSA measures 16.47 ng/mL. MRI reveals right peripheral-zone PI-RADS 4 and 3 foci; prior transrectal biopsy benign.", "persona_chinese": "72岁男性，排尿梗阻症状明显，因尿潴留留置Foley导尿已10天。PSA 16.47 ng/mL。MRI示右侧外周带PI-RADS 4与3灶；此前经直肠穿刺活检为良性。"}
{"persona": "At 68, he reports a year of rising PSA and obstructive LUTS: daytime frequency, post-void dribbling, occasional split stream, worse after holding urine; minimal nocturia; no dysuria, hematuria, or fever; partial response to doxazosin and TCM.", "persona_chinese": "他，68岁，近一年PSA持续升高；以梗阻性下尿路症状为主：白天尿频、憋尿后排尿困难、偶有尿分叉与滴沥；夜尿0-1次；无尿痛、肉眼血尿或发热；多沙唑辛及中成药后稍有改善。"}
{"persona": "He’s 79, male, with two weeks of bothersome lower urinary tract symptoms—frequency and urgency. PSA 2.98 ng/mL. Prostate MRI reveals a PI-RADS 4 lesion, heightening concern for clinically significant prostate cancer.", "persona_chinese": "他79岁，男性，近半月出现明显下尿路症状——尿频、尿急。PSA 2.98 ng/ml；前列腺MRI示PI-RADS 4级结节，令其担忧可能存在临床意义的前列腺癌。"}
{"persona": "At 65, he reports recent-onset lower urinary tract symptoms: daytime frequency, urgency, and pronounced post-void residual sensation, with nocturia 3–4 times nightly disrupting sleep—classic mixed storage/voiding pattern, suggestive of benign prostatic hyperplasia.", "persona_chinese": "已65岁的他，近期出现下尿路症状：白天尿频、尿急，排尿不尽感明显；夜间起夜3-4次，严重干扰睡眠。贮尿与排尿症状并存，提示良性前列腺增生。"}
{"persona": "Seventy-year-old man with six months of obstructive LUTS—hesitancy and weak stream. Outside-hospital MRI confirmed BPH; PSA 10.4 ng/mL. On doxazosin, improved further after Youlifu; seeks optimization of medical therapy.", "persona_chinese": "70岁男性，半年来出现梗阻性下尿路症状：排尿踌躇、尿流无力。外院MRI证实前列腺增生；PSA 10.4 ng/mL。口服多沙唑嗪，加入优利福后进一步改善，正寻求优化药物治疗。"}
{"persona": "Two days of right flank pain and 39.9°C fevers. CT: proximal right ureteral stone with hydronephrosis and perinephric stranding. PCT 15.99, CRP 340, platelets 106. HR 107, BP 143/100; diabetic with heart failure/CAD—suspected urosepsis.", "persona_chinese": "右腰痛2天，高热至39.9℃。CT示右侧输尿管近段结石，上尿路积水并肾周渗出。PCT 15.99、CRP 340、血小板106；心率107、血压143/100。糖尿病合并心衰/冠心病，倾向尿源性脓毒症。"}
{"persona": "At 26, she has a two‑month history of incidentally detected left renal angiomyolipoma—upper‑pole 4×8×6 cm, fat‑containing, heterogeneously enhancing, partly exophytic with perinephric fat blurring; asymptomatic yet anxious about hemorrhage risk and treatment.", "persona_chinese": "她26岁，体检偶然发现左肾上极血管平滑肌脂肪瘤已两月：4×8×6cm，含脂肪，强化不均，部分外突，肾周脂肪间隙模糊；无症状，但担心出血风险与治疗选择。"}
{"persona": "Three months post-REZUM for symptomatic BPH, he enjoys a strong urinary stream, minimal urgency, no nocturia, and negligible post-void residual; now asymptomatic, he questions the need for ongoing or additional therapy and appropriate follow-up.", "persona_chinese": "REZUM水蒸汽热疗治疗BPH后第3个月，他排尿有力，尿急很少，无夜尿，残余尿几乎为零；目前症状基本消失，正询问是否还需继续或追加治疗及随访安排。"}
{"persona": "Two and a half years after HoLEP, this 75-year-old man reports a persistently bifurcated urinary stream despite strong flow; no incontinence, gross hematuria, urgency, frequency, dysuria, or fever; seeks management advice.", "persona_chinese": "前列腺钬激光剜除术（HoLEP）术后两年半的75岁男性，排尿通畅且尿流良好，但持续出现尿线分叉。无尿失禁、肉眼血尿、尿急尿频、排尿疼痛或发热，寻求评估与治疗建议。"}
{"persona": "Middle-aged man, 51, asymptomatic, with an incidentally detected right renal mass present >1 month. Contrast-enhanced CT shows a ~1 cm enhancing mid-pole cortical lesion (cT1a), prompting surgical planning, likely nephron-sparing resection.", "persona_chinese": "51岁男性，无症状，体检偶发右肾占位已1个多月。增强CT示右肾中极约1 cm强化皮质实性病灶（cT1a），拟行外科治疗，优先考虑肾单位保留性部分肾切除。"}
{"persona": "At 58, he reports recent-onset nocturia, rising 3–4 times nightly. He denies daytime frequency, urgency, or dysuria, suggesting isolated nocturnal lower urinary tract symptoms primarily disrupting sleep rather than voiding comfort.", "persona_chinese": "58岁男性，近期出现夜尿增多，每晚起床排尿3–4次；白天无尿频、尿急或尿痛，呈孤立性夜间下尿路症状，主要困扰为睡眠中断。"}
{"persona": "At 66, PSA 49–50 ng/mL persistently over 3 months; biopsy confirms prostate adenocarcinoma, Gleason 4+3. PET-CT: enlarged, FDG-avid prostate with calcifications. Hypertension 20 years on telmisartan/HCTZ; prior clavicle plate, right hip arthroplasty; no family history.", "persona_chinese": "他，66岁，PSA在3个月内持续49–50 ng/mL；活检证实前列腺腺癌，Gleason 4+3。PET-CT示前列腺增大、FDG摄取增高并见钙化。20年高血压，服替米沙坦/氢氯噻嗪；既往锁骨钢板、右髋置换；无家族史。"}
{"persona": "He is a 67-year-old man with nocturia and a two-year history of left perineal fullness that improves post-void. He denies renal colic, nausea/vomiting, or back/flank pain—consistent with LUTS, suspect BPH or chronic prostatitis.", "persona_chinese": "他为67岁男性，夜尿增多；左侧会阴胀满已有2年，排尿后缓解。无肾绞痛、恶心呕吐、腰背或肋腹痛。表现为下尿路症状，倾向前列腺增生或慢性前列腺炎可能。"}
{"persona": "At 68, one month after HoLEP for obstructive benign prostatic hyperplasia, his urinary stream is strong and effortless, without dysuria. He seeks a clear postoperative plan—medications, pelvic floor recovery, and follow-up testing.", "persona_chinese": "68岁男性，术前因良性前列腺增生导致梗阻性下尿路症状；术后1个月完成钬激光剜除术，现尿流强、排尿顺畅、无尿痛。询问后续用药、盆底训练及随访安排。"}
{"persona": "At 53, he reports progressive LUTS—weak, thin stream, frequency, urgency, incomplete emptying. IPSS 26. Uroflow Qmax 10.9→10.5 mL/s with VOL 265→196 mL; prostate 51.9 mL, PVR 44 mL. Urodynamics: detrusor underactivity plus bladder outlet obstruction.", "persona_chinese": "53岁男性，进行性下尿路症状：尿流细弱、尿频尿急、排尿不尽。IPSS 26分。尿流率Qmax 10.9→10.5 mL/s，排尿量265→196 mL；前列腺约51.9 mL，残余尿44 mL。尿动力：逼尿肌收缩力减弱并伴膀胱出口梗阻。"}
{"persona": "Male, 58, five days after percutaneous nephrolithotomy, suddenly sees bright-red drainage from his nephrostomy tube. He now struggles to pass urine, feeling obstructed, and fears postoperative renal bleeding with clot retention.", "persona_chinese": "患者，男，58岁，术后第5天（经皮肾镜取石术），肾造瘘管突然引流鲜红血液；现小便困难，有阻塞感。担心术后肾出血并血块潴留。"}
{"persona": "At 43, he reports 3–5 days of glans erythema with intense pruritus. Foreskin is long yet retractable; meticulous daily cleansing hasn’t helped, pointing to balanitis—likely candidal or irritant from occlusive moisture.", "persona_chinese": "他43岁，近几天出现龟头发红伴明显瘙痒。包皮偏长但可上翻；每日清洁无效，提示龟头炎，可能为念珠菌性或刺激性，与潮湿、包裹环境相关。"}
{"persona": "At 66, he describes a year of progressive LUTS: hesitancy with delayed start, weak and slow stream, and occasional incomplete emptying. Nighttime urination 4–5 times with normal volumes points toward BPH-related bladder outlet obstruction.", "persona_chinese": "66岁男性，近一年出现进行性下尿路症状：排尿等待、尿流无力且缓慢，偶有排尿不尽。夜尿4–5次且每次尿量正常，整体指向良性前列腺增生相关的膀胱出口梗阻。"}
{"persona": "She, 53, notes recent dysuria—acidic aching with micturition—and stress urinary incontinence precipitated by exertion. Afebrile, no chest tightness. Presentation suggests uncomplicated lower urinary tract irritation rather than systemic infection.", "persona_chinese": "她53岁，近期出现排尿酸痛（尿痛、排尿时灼酸感），伴用力诱发的压力性尿失禁。无发热、无胸闷；更像下尿路刺激表现，暂不支持全身性感染。"}
{"persona": "He describes several days of progressively worsening voiding difficulty—urinary hesitancy and weak stream—consistent with lower urinary tract symptoms, raising concern for benign prostatic hyperplasia–related bladder outlet obstruction in a 72-year-old man.", "persona_chinese": "他近几日排尿困难逐步加重，尿起始迟缓、尿流无力，符合下尿路症状，令人担忧良性前列腺增生相关的膀胱出口梗阻；男性，72岁。"}
{"persona": "At 52, he recently learned of benign prostatic hyperplasia on outside evaluation: ultrasound shows mild enlargement with a 26 mL post-void residual; PSA 2.93 ng/mL. Symptoms weren’t detailed, yet he seeks management guidance.", "persona_chinese": "52岁男性，近期外院检查发现良性前列腺增生；B超示轻度增大，排尿后残余尿26 mL，PSA 2.93 ng/mL。症状未详述，他对此担忧，寻求治疗方案。"}
{"persona": "He returns for BPH follow-up at 71, reporting urinary frequency, urgency, and worsening nocturia. PSA 1.67 ng/mL; MRI reveals a prostatic lesion. No dysuria or hematuria; family history of prostate cancer, seeking management advice.", "persona_chinese": "他因既往前列腺增生复诊，71岁，近期尿频、尿急、夜尿增多，无尿痛血尿或腰背痛发热。PSA 1.67 ng/mL，MRI示前列腺占位，前列腺癌家族史阳性，寻求治疗方案。"}
{"persona": "At 57, he reports several weeks of progressively worsening lower urinary tract symptoms—hesitancy, urgency, frequency, and a weak, delayed stream. His IPSS is 22, consistent with severe LUTS, suggesting benign prostatic obstruction.", "persona_chinese": "57岁男性，他近月来下尿路症状进行性加重：排尿困难、尿急尿频，起尿迟且尿流细。IPSS 22分，属重度，倾向良性前列腺梗阻。"}
{"persona": "At 72, he developed acute urinary retention requiring an indwelling Foley. A trial without catheter at 7 days failed; re-catheterized for two weeks, he seeks definitive options to resolve persistent retention and regain independent voiding.", "persona_chinese": "72岁男性，急性尿潴留需留置导尿。7天拔管试验失败，随后再次留置2周；他担忧持续潴留，咨询可恢复自主排尿的明确治疗方案与下一步管理。"}
{"persona": "Young woman, 24, with a 3-month incidental left renal mass (~25×21 mm) near the hilum: mild FDG uptake, arterial enhancement/venous washout, intralesional fat on MRI; bilateral small fat nodules; veins clear; pathology pending—ccRCC vs angiomyolipoma; possible microscopic pedicle nodes.", "persona_chinese": "24岁女性，体检偶发现左肾近肾门肿块约25×21mm已3月；PET轻度FDG增高，CT动脉期强化/静脉期洗脱；MRI示病灶内脂肪信号、强化不均；双肾多发小脂肪结节；左肾静脉/下腔静脉通畅；病理待定，透明细胞癌与AML待鉴别，肾蒂微小淋巴结转移不能除外。"}
{"persona": "At 69, he reports a two-year history of progressive lower urinary tract symptoms—hesitancy, weak/thin stream, nocturia, frequency, and urgency—without dysuria, seeking evaluation for suspected BPH-related bladder outlet obstruction and treatment options.", "persona_chinese": "69岁，他自述两年来下尿路症状进行性加重：排尿迟缓、尿流细弱、夜尿增多、尿频与尿急，无尿痛；为疑似前列腺增生导致的膀胱出口梗阻前来就诊并咨询治疗方案。"}
{"persona": "A septuagenarian man with many years of progressive LUTS—urinary hesitancy, weak stream, straining, frequency, urgency, and prominent nocturia—remains afebrile, suggesting benign prostatic hyperplasia without infection, and seeks management options.", "persona_chinese": "高龄男性，长期进展性的下尿路症状：起尿迟缓、尿流变细、用力排尿、尿频、尿急及明显夜尿；体温正常，倾向良性前列腺增生而非感染，现寻求治疗方案。"}
{"persona": "He’s concerned about a month-long PSA rise after two weeks of bicalutamide. Post-TURP pathology: acinar adenocarcinoma, Gleason 4+5=9, ~70% involvement. FDG-avid prostate; iliac nodes. MRI: bulky gland with BPH calcifications; incidental liver cysts, bone islands.", "persona_chinese": "他因PSA持续升高逾一月而担忧，曾服比卡鲁胺2周。TURP后病理示腺泡腺癌，Gleason 4+5=9，肿瘤约70%。FDG摄取增高、髂旁淋巴结；MRI示饱满腺体伴BPH钙化；伴肝囊肿、骨岛。"}
{"persona": "Age 26, male with lifelong redundant foreskin notes a two-day surge of whitish subpreputial discharge and glans discomfort; concerned about early balanitis from smegma accumulation and seeking appropriate treatment guidance.", "persona_chinese": "这位26岁男性，长期包皮过长，近两天包皮下白色分泌物明显增多并伴龟头不适；担心因包皮垢堆积引发早期龟头炎/包皮龟头炎，正寻求合适的治疗建议。"}
{"persona": "Elderly man, 78, with acute-onset voiding difficulty persisting >24 hours after removal of an indwelling urinary catheter; persistent dysuria without relief raises concern for post-catheter urinary retention or bladder outlet obstruction.", "persona_chinese": "78岁男性，拔除留置尿管后超过24小时仍持续排尿困难，症状未缓解；表现提示拔管后尿潴留或膀胱出口梗阻的可能性。"}
{"persona": "He, 61, recently had screening revealing PSA 7.234 ng/mL with a free-to-total PSA ratio of 14%. No reported urinary symptoms; he fears malignancy risk and seeks guidance on further workup and management.", "persona_chinese": "他为61岁男性，近期体检PSA 7.234 ng/ml，f/TPSA 14%。未诉尿路症状，担忧前列腺恶性风险，期望获得进一步诊断评估与治疗建议。"}
{"persona": "She is a 34-year-old woman with a >6-month incidental left renal mass: imaging shows a fat-containing upper-pole lesion (−75–42 HU; MRI 58×37 mm), highly suggestive of renal angiomyolipoma, plus bilateral renal cysts; asymptomatic.", "persona_chinese": "34岁女性，体检偶发现左肾占位逾半年；影像示上极含脂病灶（CT −75–42 HU，MRI 58×37 mm），考虑肾血管平滑肌脂肪瘤，伴双肾囊肿；无症状。"}
{"persona": "Attending follow-up for benign prostatic hyperplasia, this 65-year-old man reports storage-predominant LUTS—frequency, urgency, and marked nocturia. Denies dysuria, gross hematuria, flank/back pain, fever/chills, or abdominal pain/distension.", "persona_chinese": "65岁男性，前列腺增生复诊，近期以储尿期下尿路症状为主：尿频、尿急，夜尿显著增加。否认尿痛、肉眼血尿、腰背或肋区痛、发热寒战及腹痛腹胀。"}
{"persona": "He underwent laser vaporization for BPH six months ago; voiding normalized post-catheter, but three weeks later developed weak, non-linear stream with poor force and urinary incontinence. Last month: urethral stricture; dilation gave little relief.", "persona_chinese": "他半年前接受前列腺增生的激光汽化术，拔管后排尿通畅；三周后尿流变细且分叉、尿力差并失禁。上月诊断尿道狭窄，行扩张，疗效有限。"}
{"persona": "At 65, he seeks guidance after PSA 5.56 ng/mL, fPSA 1.06, ratio 0.19; MRI shows BPH with prostatitis and a PI-RADS 3 apex left transition-zone nodule, stable versus prior; recent biopsy benign hyperplasia.", "persona_chinese": "65岁男性，因PSA升高（5.56 ng/ml，游离1.06，f/t比值0.19）来咨询；影像示前列腺增生伴炎症，尖部左侧移行带PI-RADS 3结节，较前稳定；近期穿刺证实良性增生，询问治疗方案。"}
{"persona": "One year after prostate laser enucleation for BPH, this 83-year-old man voids well but reports a PSA of 8.5 ng/mL on screening, asking if treatment is warranted and which options.", "persona_chinese": "前列腺激光剜除术后一年，这位83岁男性排尿顺畅、无明显下尿路症状；体检PSA 8.5 ng/mL，对术后升高存疑，咨询是否需要干预及可选方案。"}
{"persona": "A 67-year-old man with established benign prostatic hyperplasia presents for follow-up, noting recent lower urinary tract storage symptoms—frequency, urgency, and worsening nocturia—without dysuria, hematuria, flank/abdominal pain, fever, or chills, seeking management options.", "persona_chinese": "67岁男性，既往良性前列腺增生，现复诊；近期出现下尿路贮尿症状：尿频、尿急、夜尿加重。否认尿痛、血尿、腰腹痛及发热寒战，前来寻求治疗方案。"}
{"persona": "At 75, he returns for BPH follow-up with storage-predominant LUTS—urinary frequency, urgency, and marked nocturia—absent dysuria, hematuria, abdominal/flank pain, or infectious signs; seeking guidance on management.", "persona_chinese": "75岁男性前来前列腺增生复诊，近期以储尿期症状为主：尿频、尿急、夜尿明显增多；无尿痛、血尿、腹痛或腰部不适，亦无发热寒战；询求治疗建议。"}
{"persona": "She, 53, struggles with refractory hypertension (≈150/105) despite metoprolol, hydrochlorothiazide, and amlodipine. Two weeks ago, CT found a 21‑mm right adrenal nodule with moderate enhancement, no lymphadenopathy—adenoma suspected; hysteroscopic myomectomy in 2017; seeking guidance.", "persona_chinese": "她，53岁，顽固性高血压（≈150/105），长期服用美托洛尔、氢氯噻嗪、氨氯地平。两周前CT示右侧肾上腺21mm结节，中度强化、密度均匀，后腹膜未见淋巴结肿大，倾向腺瘤；2017年行宫腔镜子宫肌瘤切除，现寻求治疗建议。"}
{"persona": "At 87, he reports 2 years of urinary frequency/urgency, now retention with indwelling catheter; PSA 234 ng/mL; PET-CT: prostate cancer invading bladder/rectum with pelvic nodal spread, bladder stones; CAD stent on anticoagulation, seeking treatment guidance.", "persona_chinese": "他87岁，近2年尿频尿急，现已尿潴留需留置导尿；PSA 234 ng/mL；PET-CT示前列腺癌侵犯膀胱/直肠并盆腔淋巴结转移，伴膀胱结石；冠心病支架，长期抗凝，现求治疗方案。"}
{"persona": "An 82-year-old man with acute urinary retention necessitating an indwelling Foley catheter at an outside facility; reports voiding difficulty suggestive of bladder outlet obstruction. He seeks catheter removal and prostate cancer evaluation, including PSA.", "persona_chinese": "82岁男性，近期急性尿潴留，在外院留置导尿；近来排尿困难，考虑膀胱出口梗阻。他希望拔除导尿管，并进行前列腺肿瘤评估，包括PSA检测。"}
{"persona": "At 72, he developed marked voiding difficulty progressing to retention; an indwelling catheter for ten days. PSA 16.47 ng/mL. MRI shows right peripheral zone PI-RADS 4 lesion plus a PI-RADS 3 focus; prior biopsy benign.", "persona_chinese": "72岁男性，近期排尿困难加重至尿潴留，已留置导尿10天。PSA 16.47 ng/ml。MRI示右侧外周带PI-RADS 4结节，另有PI-RADS 3灶；此前前列腺穿刺示良性。"}
{"persona": "He seeks care for right-sided flank pain and scant urine over 48 hours; CT confirms bilateral proximal ureteral stones with hydronephrosis. Labs: WBC 15.6, neutrophils 83%, CRP 91, creatinine 865, pH 7.28—obstructive AKI suspected.", "persona_chinese": "他因右侧腰痛伴尿量减少48小时前来就医；CT证实双侧输尿管上段结石并积水。化验：白细胞15.6、N%83%、CRP91、肌酐865、pH7.28，考虑梗阻性急性肾损伤。"}
{"persona": "At 74, he reports progressively worsening voiding difficulty; an outside facility diagnosed prostatic enlargement consistent with BPH. He seeks guidance on relieving LUTS through medications or minimally invasive options to improve quality of life.", "persona_chinese": "74岁男性，近期出现进行性排尿困难；外院诊断前列腺增大，考虑良性前列腺增生。他希望了解缓解下尿路症状的治疗选择（如药物或微创手术），以改善生活质量。"}
{"persona": "He, 70, returns after biopsy-proven benign prostatic hyperplasia. Recent lower urinary tract symptoms—frequency, urgency, nocturia—without dysuria, hematuria, lumbar/flank pain, fever or chills; no abdominal pain or distension.", "persona_chinese": "他，70岁，前次穿刺证实良性前列腺增生，此次复诊。近期出现下尿路症状：尿频、尿急、夜尿增多；无尿痛、血尿、腰部疼痛或酸胀、发热寒战，亦无腹痛腹胀。"}
{"persona": "She reports a recent, sudden onset of intense right flank and lumbar pain with visible hematuria on voiding. Afebrile, without nausea or vomiting, and bowel movements are normal—features strongly suggest acute ureteral colic.", "persona_chinese": "她近期突然出现右侧腰背部剧烈疼痛，排尿时有肉眼血尿。无发热、无恶心呕吐，排便正常；整体临床表现高度提示急性肾绞痛或输尿管结石。"}
{"persona": "At 51, asymptomatic yet flagged on screening: a ~1 cm right mid‑pole renal mass on contrast-enhanced CT, present over a month; diagnosis confirmed, with surgical resection advised and next steps under consideration.", "persona_chinese": "51岁男性，无症状，体检发现右肾中极约1cm占位，已1个多月。增强CT证实右肾肿物，考虑肾肿瘤；医生建议手术切除，正评估下一步方案。"}
{"persona": "A 63-year-old man with a 2–2.3 cm right renal mass discovered 2 weeks ago, asymptomatic; arterially hyperenhancing with venous washout, restricted diffusion, cortical indentation, partial renal sinus protrusion, intact capsule—imaging favors clear cell RCC.", "persona_chinese": "63岁男性，右肾约2.0–2.3 cm占位，发现2周，无症状；动脉期明显强化、静脉/髓质期减退，弥散受限，压迫皮质并部分突入肾窦，包膜完整，影像倾向透明细胞癌。"}
{"persona": "At 60, he reports a 5-year progression of voiding difficulty dominated by hesitancy and obstructive LUTS, minimal nocturia, no frequency or urgency. Doxazosin offers only partial relief, prompting him to seek more effective therapy.", "persona_chinese": "60岁男性，5年来排尿困难逐渐加重，以尿等待为主的梗阻性下尿路症状；夜尿0–1次，无尿频、尿急。多沙唑嗪仅部分缓解，现寻求更有效的治疗方案。"}
{"persona": "Now 58, he describes several weeks of isolated nocturia—3–4 nightly awakenings to void—without urgency, dysuria, or daytime frequency. Sleep is fragmented. He seeks management options, wondering about benign prostatic hyperplasia versus nocturnal polyuria.", "persona_chinese": "58岁，近几周出现孤立性夜尿，每晚起夜3–4次；无尿急、尿痛，白天无尿频。睡眠被反复打断。他想寻求治疗方案，担心良性前列腺增生或夜间多尿。"}
{"persona": "At 26, she is asymptomatic, incidentally found two months ago to have a left renal upper‑pole mass (~4×8×6 cm), partly exophytic with fat density and heterogeneous enhancement; perinephric fat stranding suggests angiomyolipoma prone to hemorrhage.", "persona_chinese": "26岁女性，无症状；两月前体检偶然发现左肾上极包块，约4×8×6 cm，部分外生，含脂肪密度，增强不均匀，周围脂肪间隙模糊；影像学提示血管平滑肌脂肪瘤，有出血风险。"}
{"persona": "He seeks guidance after two years of hematuria; PSA 0.8 ng/mL. MRI: BPH bulging into bladder and right peripheral-zone PI-RADS 3 focus; biopsy confirms Gleason 3+3 adenocarcinoma. Hypertension on nifedipine (135/90), TIA 3 years ago.", "persona_chinese": "他因血尿持续逾两年前来求治；PSA 0.8 ng/mL。MRI示前列腺增生向膀胱底突出，右周围带PI-RADS 3灶；穿刺证实前列腺腺癌Gleason 3+3。既往高血压服硝苯地平（约135/90），三年前有TIA。"}
{"persona": "At 77, he has endured years of lower urinary tract symptoms—hesitancy, weak stream, straining, frequency, urgency, and recurrent nocturia—while remaining afebrile. The pattern suggests benign prostatic hyperplasia causing bladder outlet obstruction.", "persona_chinese": "77岁，他多年饱受下尿路症状：排尿迟缓、尿线细、排尿费力、尿频、尿急、夜尿增多；体温正常。整体指向前列腺增生所致膀胱出口梗阻。"}
{"persona": "At 43, uncircumcised with redundant yet retractable foreskin, he reports several days of pruritic erythema limited to the glans. Daily cleansing failed; presentation points to balanitis—candidal or irritant etiologies.", "persona_chinese": "43岁男性，未行包皮环切，包皮过长但可上翻，近几日龟头红斑伴瘙痒。每日清洗仍无缓解；表现倾向龟头炎/包皮龟头炎，可能为念珠菌或刺激性。"}
{"persona": "At 51, he reports recent lower urinary tract symptoms—frequency, urgency, hesitancy, weak, narrow stream, and incomplete emptying—with nocturia twice nightly. MRI confirms BPH (39×54×53 mm); PSA 5.547 ng/mL, PVR 60 mL, IPSS 33.", "persona_chinese": "年过五十的他近期出现明显下尿路症状：尿频、尿急、排尿等待、尿流细弱、排尿不尽，夜尿两次。MRI示前列腺增生（39×54×53mm）；PSA 5.547ng/ml，PVR 60ml，IPSS 33分。"}
{"persona": "At 59, she has 2 days of left flank pain, now 39.1°C fever with HR 109 and one vomit. CT: left mid-ureteral stone with hydronephrosis. Labs show leukocyturia, neutrophilia, thrombocytopenia; CRP 9.38, PCT 0.04.", "persona_chinese": "59岁，她左侧腰背痛2天，今起高热39.1°C、心率109，恶心并呕吐一次。CT示左侧输尿管中段结石致积水。实验室：尿白细胞增多、中性偏高、血小板83；CRP 9.38，PCT 0.04。"}
{"persona": "At 68, a year of rising PSA and LUTS—hesitancy after holding urine, frequency, split stream, dribbling—without urgency, dysuria, or hematuria; nocturia 0–1x. Partial response to doxazosin and Chinese patent medicine; BPH versus malignancy remains.", "persona_chinese": "他68岁，PSA一年持续升高；梗阻性下尿路症状：憋尿后排尿困难、日间尿频、尿线分叉、尿后滴沥；无尿急、尿痛或肉眼血尿，夜尿0–1次。改用多沙唑嗪及中成药后部分缓解；良性前列腺增生与恶性肿瘤需鉴别。"}
{"persona": "An octogenarian male reports several months of bothersome LUTS—hesitancy with delayed initiation, frequency, urgency, and waiting—without dysuria or hematuria. Otherwise well: stable weight, preserved appetite, normal bowel function and sleep.", "persona_chinese": "年逾八旬男性，数月来出现明显下尿路症状：起尿迟缓与尿等待、排尿困难，伴尿频尿急；无血尿、无排尿疼痛。精神体力尚可，食欲佳，体重稳定，睡眠与大便正常。"}
{"persona": "Seventy-year-old man enduring six months of obstructive lower urinary tract symptoms and urinary difficulty; MRI confirms benign prostatic hyperplasia, PSA 10.4. On doxazosin; symptoms notably improved after adding silodosin. Seeking guidance on next-step management.", "persona_chinese": "这位70岁男性，半年来以排尿困难为主的梗阻性下尿路症状。MRI提示前列腺增生，PSA 10.4。服用多沙唑嗪，加用优利福后症状好转，正寻求下一步治疗方案。"}
{"persona": "He’s 26 with a long, redundant foreskin; over the past two days he’s noticed abundant whitish subpreputial discharge and glans discomfort, suggesting smegma buildup with early balanitis, possibly candidal, on a background of partial phimosis.", "persona_chinese": "26岁，包皮明显过长；近两日包皮内白色分泌物增多并伴龟头不适，提示包皮垢堆积与早期龟头炎，可能为念珠菌感染，亦考虑轻度包茎背景。"}
{"persona": "At 57, he reports recent, progressively worsening lower urinary tract symptoms—hesitancy with prolonged initiation, weak stream, urinary frequency and urgency; IPSS 22 denotes severe LUTS, pointing toward benign prostatic hyperplasia.", "persona_chinese": "他57岁，近期下尿路症状逐步加重：排尿踌躇、起始时间延长、尿流细弱，伴尿频尿急；IPSS 22分提示症状重度，临床倾向良性前列腺增生。"}
{"persona": "He is 52, recently evaluated externally: PSA 2.93 ng/mL; ultrasound shows mild prostatic enlargement with post‑void residual 26 mL. No urinary symptoms reported, yet worried about benign prostatic hyperplasia and management.", "persona_chinese": "他52岁，近期在外院检查：PSA 2.93 ng/ml，B超示前列腺轻度增生，膀胱残余尿26 ml。未诉明显排尿症状，但心存担忧，寻求良性前列腺增生的治疗方案。"}
{"persona": "He reports a >2‑month persistent PSA surge to 936 ng/mL. MRI shows enlarged, heterogeneous prostate with central‑zone nodules and 9–11 o’clock peripheral lesions. Biopsy cores 6–14 harbor adenocarcinoma, Gleason 4+4=8 (ISUP 4/5). PET‑CT favors right‑sided dominance.", "persona_chinese": "近两月PSA持续飙升至936 ng/mL。MRI示前列腺增大、信号不均，中央带结节及9–11点周围带病灶。穿刺6–14针提示腺癌，Gleason 4+4=8，ISUP 4/5；PET‑CT提示右侧优势。"}
{"persona": "At 65, he has developed over recent weeks bothersome LUTS: frequency, urgency, incomplete emptying, and nocturia 3-4 times nightly, disrupting sleep and pointing to benign prostatic hyperplasia.", "persona_chinese": "他65岁，近几周出现明显下尿路症状：尿频、尿急、排尿不尽，夜尿每晚3-4次，严重干扰睡眠，整体表现提示良性前列腺增生可能。"}
{"persona": "At 75 and 2.5 years post-HoLEP, he voids robustly yet notes a persistent split urinary stream. No incontinence, gross hematuria, urgency, frequency, dysuria, or fever; seeking management for this isolated issue.", "persona_chinese": "75岁，HoLEP术后2年半；排尿通畅，却持续出现尿流分叉。无尿失禁、肉眼血尿、尿急、尿频、尿痛或发热；就这一单一问题寻求处理方案。"}
{"persona": "Two days of right flank pain and fevers to 39.9°C. CT confirms proximal right ureteral stone with hydronephrosis, perirenal exudation. Labs: PCT 15.99, CRP 340, neutrophils 94.5%, glucose 13.1; tachycardic, hypertensive; with heart failure, CAD.", "persona_chinese": "她两天右侧腰痛并高热至39.9℃；CT示右侧输尿管起始段结石、上尿路积水、肾周渗出。化验：降钙素原15.99、CRP340、N 94.5%、血糖13.1；心动过速、血压偏高；既往心衰、冠心病。"}
{"persona": "Midlife man, 45, with lifelong redundant prepuce (long foreskin); he can’t tell if this represents phimosis or simple excess skin and asks whether circumcision is medically indicated now, absent stated complications.", "persona_chinese": "45岁男性，自幼包皮过长，拿不准属包茎还是单纯包皮冗长；未提及反复感染或疼痛，咨询此时是否需要行包皮环切及其适应证。"}
{"persona": "She’s a 24-year-old woman, 3 months post incidental discovery of a 2.4 cm left renal hilar mass: mild FDG uptake, arterial enhancement with venous washout; ccRCC suspected, pedicle micro-nodes questionable; bilateral tiny fat-signal nodules.", "persona_chinese": "24岁女性，体检3个月前偶发现左肾近肾门约2.4cm肿块；FDG轻度增高，动脉期不均匀强化、静脉期明显衰减；倾向透明细胞癌，肾蒂微小淋巴结可疑；双肾多发小脂肪信号结节。"}
{"persona": "Recently flagged by screening, a 61-year-old man shows PSA 7.234 ng/mL; his free-to-total PSA ratio is low at 14%, raising malignancy concern despite no reported LUTS, and he seeks management guidance.", "persona_chinese": "近期筛查提示，一名61岁男性PSA升至7.234 ng/ml；游离/总PSA比值仅14%，虽无明显下尿路症状，仍担忧恶性风险，正寻求分层评估与下一步治疗方案。"}
{"persona": "At 57, he had BPH-related LUTS, underwent Rezūm 3 months ago; now enjoys a strong stream and unobstructed voiding without irritative symptoms. Seeks guidance on follow-up and whether ongoing medication or further intervention is needed.", "persona_chinese": "57岁，因良性前列腺增生(BPH)相关下尿路症状(LUTS)于3个月前行Rezūm治疗；现自述尿流有力、排尿通畅，无明显刺激症状。希望明确随访安排，以及是否需继续用药或进一步干预。"}
{"persona": "He is 67, troubled by nocturia and a two-year left perineal fullness that eases post-void. No renal colic, nausea/vomiting, or back pain. Seeking guidance for lower urinary tract symptoms.", "persona_chinese": "67岁男性，夜尿增多，左侧会阴部胀满持续2年，排尿后缓解。无肾绞痛、恶心呕吐或腰背痛。希望获得下尿路症状的评估与治疗建议。"}
{"persona": "At 66, he reports a year of painless LUTS: hesitancy, weak and slow stream, occasional incomplete emptying, and nocturia 4–5 times with normal volumes. Pattern strongly suggests benign prostatic hyperplasia.", "persona_chinese": "66岁男性，一年余无痛性下尿路症状：起始迟缓、尿流细弱缓慢，间有排尿不尽，夜尿4–5次且每次尿量尚可；整体表现高度提示良性前列腺增生。"}
{"persona": "Hypertensive 66-year-old man on telmisartan/HCTZ; PSA persistently high (49→50 ng/mL over 3 months). Biopsy confirms prostate adenocarcinoma, Gleason 4+3=7. PET-CT: enlarged, FDG-avid gland with calcifications. History: right hip arthroplasty, left clavicle plating, back lipoma excision.", "persona_chinese": "66岁男性，20年高血压，口服替米沙坦氢氯噻嗪。PSA持续升高（49→50 ng/ml，3个月）。活检示前列腺腺癌，Gleason 4+3=7。PET-CT示腺体增大、FDG高代谢并见钙化；既往右髋置换、左锁骨钢板、背部脂肪瘤切除。"}
{"persona": "Two weeks of urinary frequency and urgency plague a 79-year-old man. Despite PSA 2.98 ng/mL, MRI detects a PI‑RADS 4 prostate nodule, prompting concern for clinically significant malignancy and management planning.", "persona_chinese": "近半月反复尿频、尿急困扰一名79岁男性。PSA 2.98 ng/mL，MRI发现前列腺PI‑RADS 4级结节，担忧临床意义性前列腺癌，正寻求合适的管理与治疗。"}
{"persona": "Five days after percutaneous nephrolithotomy with a nephrostomy, this 58-year-old man reports sudden bright-red drainage from the tube and difficulty voiding with a blocked sensation—concerning for clot retention and delayed postoperative vascular bleeding.", "persona_chinese": "经皮肾镜取石术后第5天，58岁男性留置肾造瘘，造瘘管突现鲜红色引流，伴排尿困难与梗阻感；表现提示血块潴留及延迟性术后血管性出血。"}
{"persona": "A 53-year-old woman reporting recent-onset dysuria with a burning, cramping quality and concurrent stress urinary incontinence; afebrile, without chest tightness, suggesting uncomplicated lower urinary tract involvement without systemic features.", "persona_chinese": "她为53岁女性，近期出现灼痛性排尿并合并压力性尿失禁；无发热、无胸闷，提示以下尿路受累为主，尚无全身感染征象。"}
{"persona": "At 53, he presents with steadily worsening LUTS—hesitancy, delayed start, weak stream, frequency and urgency—and nocturia 2–3 times nightly; concerned it indicates advancing benign prostatic hyperplasia.", "persona_chinese": "53岁男性，近期下尿路症状逐步加重：尿等待、起始延迟、尿流无力、尿频尿急，夜尿2–3次；他担心这提示良性前列腺增生在进展。"}
{"persona": "A 65-year-old man under follow-up for benign prostatic hyperplasia now reports new-onset, storage-predominant LUTS—urinary frequency, urgency, and increased nocturia—without dysuria, hematuria, back/flank pain, fever, chills, or abdominal complaints; seeking management advice.", "persona_chinese": "65岁男性，前列腺增生复诊；近期出现以储尿症状为主的LUTS：尿频、尿急、夜尿增多。无尿痛、血尿、腰背/肋区痛，亦无发热、畏寒/寒战或腹部不适；希望获得治疗建议。"}
{"persona": "At 34 and asymptomatic, she’s had a left renal mass for six months: ultrasound 98×67 mm high-echo; CT fat density (-75 to -42 HU); MRI favors upper-pole AML 58×37 mm; small bilateral cysts; no DM/HTN.", "persona_chinese": "34岁且无症状，她左肾占位已持续半年：超声高回声98×67mm；CT呈脂肪密度(-75至-42HU)并脂肪间隙模糊；MRI倾向左肾上极血管平滑肌脂肪瘤58×37mm；伴双肾小囊肿，无糖尿病/高血压。"}
{"persona": "A 72-year-old man with acute urinary retention initially managed by indwelling catheter; a day‑7 trial without catheter (TWOC) failed, prompting re-catheterization for two weeks. He seeks definitive therapy to regain spontaneous voiding.", "persona_chinese": "72岁男性，急性尿潴留，先行留置导尿；第7天试行拔管（TWOC）失败，复置导尿并持续2周。现希望获得根治性治疗，恢复自主排尿并明确病因。"}
{"persona": "Now 71, he returns for BPH follow-up reporting urinary frequency, urgency, and increased nocturia without dysuria or hematuria. PSA 1.67 ng/mL; MRI reveals a prostatic mass. Strong family history of prostate cancer; seeks management options.", "persona_chinese": "71岁男性，他为前列腺增生复诊；诉尿频、尿急、夜尿增多，无尿痛、血尿及腰痛发热。PSA 1.67 ng/mL，MRI示前列腺占位。有前列腺癌家族史，寻求治疗方案。"}
{"persona": "One month after HoLEP for obstructive BPH, he, age 68, reports a strong, unobstructed stream without dysuria and seeks guidance on medication discontinuation, pelvic-floor rehabilitation, and follow-up PSA and uroflowmetry.", "persona_chinese": "行前列腺钬激光剜除术1个月后，68岁男性排尿通畅、尿流有力，无排尿痛；现咨询后续管理：既往药物是否停用、骨盆底康复训练，以及PSA与尿流率随访。"}
{"persona": "A sexually active 25-year-old man with lifelong redundant, nonretractile foreskin—never able to expose the glans. Voiding and intercourse remain normal, without infections; he asks if this is phimosis and whether circumcision is needed.", "persona_chinese": "25岁男性，包皮过长自幼，始终无法上翻，龟头从未外露。排尿与性生活正常，未诉疼痛或感染；现咨询是否属于包茎，以及是否需行包皮环切术。"}
{"persona": "57‑year‑old man with prior stone‑related left renal atrophy presents with right flank pain and 37.7°C fever; CT: two proximal right ureteral stones. Labs: creatinine 241, CRP 128, WBC 11.85, PCT 0.222; urine output normal.", "persona_chinese": "57岁男性，既往因结石致左肾萎缩；现右侧腰痛并昨夜低热37.7℃。CT示右侧输尿管上段两枚结石。化验：肌酐241、CRP 128、白细胞11.85、PCT 0.222；自述尿量正常。"}
{"persona": "Male, 53, with progressive LUTS—frequency, urgency, weak, thin stream, incomplete emptying. Severe by IPSS 26. Over 6 months, Qmax ~10–11 mL/s (VOL 265→196 mL). Prostate 51.9 mL, PVR 44 mL. Urodynamics: detrusor underactivity with BOO.", "persona_chinese": "53岁男性，进行性下尿路症状：尿频、尿急、尿流细弱、排尿不尽。IPSS 26分。6个月内Qmax约10–11 mL/s（尿量265→196 mL）。前列腺约51.9 mL，残余尿44 mL。尿动力：逼尿肌收缩力减弱合并膀胱出口梗阻。"}
{"persona": "A 72-year-old man reporting several days of progressively worsening voiding difficulty—marked hesitancy and weak stream—suggestive of lower urinary tract obstruction, likely BPH, and seeking therapeutic options to mitigate an emerging urinary retention risk.", "persona_chinese": "72岁男性，近几日排尿困难逐步加重，表现为起始迟缓与尿流细弱；提示下尿路梗阻，倾向良性前列腺增生，担忧进展为尿潴留，亟盼合适的治疗方案。"}
{"persona": "At 72, this man reports progressively worsening LUTS—hesitancy, weak stream, frequency, urgency, nocturia, and incomplete emptying. His self-administered IPSS is high, and he seeks guidance on treatment options for suspected BPH.", "persona_chinese": "72岁男性，进行性下尿路症状：排尿犹豫、尿流细弱、尿频、尿急、夜尿增多、排尿不尽。自测IPSS偏高，担心良性前列腺增生，前来咨询治疗选择。"}
{"persona": "At 68, he reports a one-week course of suprapubic discomfort, urinary hesitancy and weak stream with a persistent urge-to-void, suggesting incomplete bladder emptying consistent with possible bladder outlet obstruction/BPH.", "persona_chinese": "68岁男性，近一周出现耻骨上区不适、排尿踟蹰与尿流变弱，持续强烈尿意难解，提示膀胱排空不全，考虑膀胱出口梗阻/良性前列腺增生可能。"}
{"persona": "At 78, he reports acute-onset voiding difficulty persisting >24 hours after catheter removal. Persistent LUTS with poor urinary flow raises concern for post-catheter urinary retention and possible bladder outlet obstruction.", "persona_chinese": "78岁，他在拔除导尿管后已超过一天仍排尿困难。下尿路症状持续、尿流差，提示拔管后尿潴留风险，不排除膀胱出口梗阻等可能。"}
{"persona": "He reports a month-long PSA rise despite two weeks of bicalutamide. Post transurethral prostate vaporization and holmium lithotripsy, pathology showed acinar adenocarcinoma, Gleason 4+5=9 with 70% involvement, with BPH/calcifications; MRI abnormal with bilateral iliac nodes.", "persona_chinese": "他自述PSA升高已逾1个月，2周比卡鲁胺无效。经尿道前列腺气化电切及膀胱结石钬激光术后，病理示腺泡型前列腺腺癌（Gleason 4+5=9，肿瘤约占70%）、伴增生和钙化，FDG代谢增高；MRI异常，见双侧髂旁淋巴结。"}
{"persona": "Now in his seventies, he describes many years of combined storage and voiding LUTS—frequency, urgency, nocturia, hesitancy, thin weak stream, and straining. Afebrile, the pattern points toward benign prostatic outlet obstruction.", "persona_chinese": "年逾七十的男性，长期出现储尿期与排尿期并存的下尿路症状：尿频、尿急、夜尿增多、起尿迟缓、尿线细弱、排尿费力。体温正常，整体表现提示良性前列腺出口梗阻。"}
{"persona": "A 69-year-old man reporting a 2-year progression of lower urinary tract symptoms—hesitancy, weak/thin stream, nocturia, frequency, and urgency without dysuria—now seeks guidance on management options for suspected BPH-related obstruction.", "persona_chinese": "69岁男性，2年来下尿路症状进行性加重：排尿迟缓、尿流细弱、夜尿增多、尿频尿急，无尿痛；现为疑似前列腺增生所致梗阻寻求治疗选择。"}
{"persona": "She is a 56-year-old woman with sudden left flank/back pain for 1 day, nausea, and worsening chills without fever, seeks urgent care. CT: left UPJ stone with hydronephrosis; labs normal WBC, low procalcitonin, creatinine 88.", "persona_chinese": "她，56岁女性，突发左侧腰背痛1天，恶心，畏寒寒战加重但无发热，遂就诊。CT示左侧肾盂输尿管连接处结石伴上尿路积水；WBC 7.46、N 51.6%、肌酐88、PCT 0.024。"}
{"persona": "At 64, he reports recently progressive obstructive voiding with frequency and urgency; nocturia improved on medication (likely alpha-blocker) yet persists twice nightly, suggesting LUTS from BPH with only a partial pharmacologic response.", "persona_chinese": "64岁，近期出现进行性排尿困难并伴尿频、尿急；用药后夜尿有所改善却仍每夜2次，考虑良性前列腺增生相关LUTS，药物反应仅部分，疗效尚不满意。"}
{"persona": "Middle-aged uncircumcised man (38) reporting lifelong redundant prepuce that covers the glans at rest. Asymptomatic—no phimosis, dysuria, balanoposthitis, malodor, or painful intercourse. Normal voiding/erections; seeks guidance on circumcision necessity.", "persona_chinese": "38岁未行环切，包皮过长，自小如此，静止时覆盖龟头。无症状：无包茎、排尿困难、龟头包皮炎、异味或性交疼痛。排尿与勃起正常，咨询是否需要手术。"}
{"persona": "She has month-long hematuria with right ureteral lesion: PET-CT shows FDG‑avid mid‑distal thickening and hydroureteronephrosis; ureteroscopy found a 5‑cm villous mass 2 cm from the orifice, biopsy inflammatory granulation. Hypertension; GFR reduced bilaterally, right excretion obstructed.", "persona_chinese": "她近1月出现肉眼血尿并发现右输尿管占位；PET‑CT示中下段FDG增高伴右侧积水；镜下距开口2cm有5cm绒毛样肿物，活检炎性肉芽；既往高血压，双肾GFR下降、右排泄受阻。"}
{"persona": "At 76, he underwent laser vaporization for BPH; voiding improved post-catheter, then by week three devolved to a thin, fragmented stream, weak flow, and incontinence. Diagnosed with urethral stricture; last month’s dilation gave minimal relief.", "persona_chinese": "76岁，半年前因前列腺增生行激光汽化；拔管后排尿短期通畅，第三周即出现尿流细碎、尿势弱并尿失禁。上月确诊尿道狭窄，行扩张治疗，疗效有限。"}
{"persona": "At 51, he reports several weeks of worsening erectile dysfunction: reduced penile rigidity and brief maintenance during intercourse, yet intact morning erections. Preserved nocturnal penile tumescence hints at psychogenic or mixed etiology; seeks evidence-based therapy.", "persona_chinese": "51岁男性，近数周出现勃起功能障碍：阴茎硬度下降、性交维持时间短，但晨勃仍在。保留的夜间勃起提示心理性或混合因素，他主动寻求循证治疗方案。"}
{"persona": "At 63, he reports a year of nocturnal voiding difficulty, persistent LUTS despite concurrent tamsulosin, doxazosin, silodosin, plus eplerenone; refractory features raise concern for BPH with nocturnal outlet obstruction.", "persona_chinese": "63岁男性，一年来夜间排尿困难、下尿路症状持续；尽管合用坦索罗辛、多沙唑嗪、赛洛多辛及爱普列特，疗效不佳。症状难治，考虑良性前列腺增生致夜间出口梗阻。"}
{"persona": "At 26, he reports lifelong redundant prepuce; typically asymptomatic, yet intercourse occasionally provokes penile discomfort. No phimosis, dysuria, or recurrent balanitis noted. Seeking advice on circumcision versus conservative measures.", "persona_chinese": "26岁，包皮过长，自青春期即存在；日常无症状，但性交时偶发阴茎不适。否认包茎、排尿异常、反复龟头炎；正权衡包皮环切与保守治疗的必要性。"}
{"persona": "At 50, he has years of obstructive lower urinary tract symptoms; voiding difficulty has worsened in the past two months. He is seeking options for suspected benign prostatic hyperplasia to improve urinary flow.", "persona_chinese": "年满50岁，他多年饱受梗阻性下尿路症状困扰，近两个月排尿不畅明显加重；为改善尿流，正寻求针对疑似良性前列腺增生的治疗方案。"}
{"persona": "At 70, she has a 36‑mm exophytic mid‑left renal mass with arterial‑phase hyperenhancement for over 3 weeks, plus a 50‑mm upper‑pole cyst. Diabetes and hypertension controlled; recent toe amputation for diabetic foot necrosis; no allergies.", "persona_chinese": "70岁女性，左肾中极外向36mm占位，动脉期明显强化，已发现3周余；左肾上极50mm囊肿。糖尿病、高血压控制良好；近期糖足坏疽行趾截；无过敏史。"}
{"persona": "At 64, he reports severe nocturia—5–6 awakenings nightly—with persistent incomplete bladder emptying. Prostate measures 46×41×35 mm and post‑void residual is 190 mL; a left renal cyst is present. Seeks targeted relief.", "persona_chinese": "年逾六十的他，近期夜尿显著，每晚起夜5–6次，并觉排尿不尽。前列腺46×41×35 mm，排尿后残余尿190 mL；同时发现左肾囊肿。期望精准缓解。"}
{"persona": "One week post right-sided PCNL for nephrolithiasis, she develops sudden bright-red gross hematuria and bleeding through the nephrostomy. CT shows a right renal pelvic clot, no perirenal hematoma; PCN in place. Hb 117, Cr 95.", "persona_chinese": "右侧经皮肾取石术后1周，她突发鲜红色肉眼血尿，并从肾造口引流管出血。CT示右肾盂血块，无肾周血肿；PCN在位，膀胱无血块。Hb117，Cr95。"}
{"persona": "He has prostate adenocarcinoma, bilateral seminal vesicle invasion; Gleason 4+3=7. Six months of rising PSA despite apalutamide. MRI shows TZ cysts, PZ T2 low without DWI restriction; bone scan shows sacrum/right ilium/left acetabulum sclerosis.", "persona_chinese": "他患前列腺腺癌，双侧精囊侵犯；Gleason 4+3=7。近6个月PSA在阿帕他胺治疗下仍上升。MRI示移行带多发囊变、外周带T2低而DWI阴性；骨显像见骶骨/右髂骨/左髋臼硬化灶。"}
{"persona": "At 71, he follows up for BPH after stopping finasteride two months prior; on tamsulosin monotherapy, he reports frequency, urgency, and nocturia, without dysuria, hematuria, back or abdominal pain, fever, or chills.", "persona_chinese": "71岁男性复诊前列腺增生；两月前停用非那雄胺，现单用坦索罗辛。诉尿频、尿急、夜尿增多；无尿痛、血尿，亦无腰背或腹痛、发热、寒战等全身症状。"}
{"persona": "Elderly man, 86, with recent-onset storage LUTS—marked urinary frequency and urgency—without flank pain, fever/chills, or hematuria. Afebrile, clinically stable; profile suggests BPH-related irritative symptoms or overactive bladder rather than infection.", "persona_chinese": "高龄男性，86岁，近期出现储尿期下尿路症状：尿频、尿急；无腰痛、发热寒战或血尿。更倾向良性前列腺增生相关刺激症状或膀胱过度活动，感染可能性低。"}
{"persona": "He is 26, with lifelong redundant prepuce and a fully retractile foreskin; asymptomatic—no pain, dysuria, or infections. Prompted by a friend’s “medication-assisted” circumcision, he asks about true indications versus elective circumcision.", "persona_chinese": "男性26岁，自幼包皮过长但龟头可完全外翻，平素无不适，无疼痛、排尿异常或感染。受朋友“药物辅助”包皮手术影响，咨询是否存在医学指征，或仅属择期手术。"}
{"persona": "He has been anuric for two days; CT confirms bilateral ureteral stones with hydronephrosis. Afebrile, normotensive (124/82) with HR 74, yet creatinine 849 µmol/L—an obstructive post-renal AKI demanding urgent decompression (ureteral stents or nephrostomy).", "persona_chinese": "他已两天无尿；CT证实双侧输尿管结石并双肾积水。无发热，血压124/82、心率74；肌酐849 µmol/L——肾后性急性肾损伤，需紧急减压（双J支架或肾造瘘）。"}
{"persona": "He, a 69‑year‑old man, describes several months of storage‑predominant LUTS—urinary frequency and urgency—without dysuria or gross hematuria and no clear trigger. Anxiety with insomnia persists; mood low. Appetite intact; bowel habits normal; weight stable.", "persona_chinese": "他，69岁男性，近数月出现以储尿期为主的下尿路症状：尿频、尿急；无尿痛或肉眼血尿，亦无明确诱因。伴焦虑与失眠、情绪低落；食欲尚可，排便正常，体重稳定。"}
{"persona": "At 77, he reports no hematuria, fever, low back pain, nor nausea/vomiting; a recent check-up detected prostatic enlargement, suggestive of BPH, in the absence of acute urinary symptoms.", "persona_chinese": "77岁男性，近期体检检出前列腺增大；他无血尿、发热、腰酸腰痛或恶心呕吐，未见急性泌尿系统症状，体征倾向良性前列腺增生。"}
{"persona": "A 68-year-old man with a 4-year progression of LUTS: nocturia 4–5/night, frequency, urgency, split stream, intermittency, episodic dysuria; no gross hematuria or fever. On tamsulosin plus finasteride with modest benefit; multiple urinary retention episodes.", "persona_chinese": "68岁男性，4年渐进性下尿路症状（LUTS）：夜尿每晚4–5次、尿频尿急、尿流分叉与间断，间歇性排尿痛；无肉眼血尿或发热。长期服用坦索罗辛+非那雄胺疗效一般，曾多次尿潴留。"}
{"persona": "At 91, he reports recent onset of voiding difficulty and frank urinary retention. On terazosin plus finasteride; prior cerebral infarction informs risk, and he seeks individualized management of BPH-related lower urinary tract obstruction.", "persona_chinese": "年届91，近来出现排尿困难与明显尿潴留。正在服用特拉唑嗪和非那雄胺；既往脑梗死，期望针对良性前列腺增生所致下尿路梗阻制定更安全、有效的个体化方案。"}
{"persona": "Three days after circumcision, a 30-year-old man notes localized erythema and edema at the foreskin incision without bleeding; the gauze dressing has come off, prompting concern about immediate wound care and infection risk.", "persona_chinese": "环切术后第3天，30岁男性切口处局灶性发红与肿胀，无活动性出血；包扎纱布已脱落，担心伤口即时护理及潜在感染风险。"}
{"persona": "At 67, he reports two weeks of obstructive voiding and nocturia 3–4/night, no dysuria or hematuria. PSA 20 ng/mL; imaging: enlarged calcified prostate, Bosniak I cysts, mild left ureteral dilation; Foley removed; prostate MRI pending.", "persona_chinese": "67岁男性，近两周排尿受阻、夜尿3–4次，无尿痛或血尿。PSA 20 ng/mL；影像示前列腺增大并钙化、双肾Bosniak I囊肿、左上段输尿管轻度扩张；导尿已拔，拟行前列腺MRI。"}
{"persona": "An octogenarian man with a month-plus of lower urinary tract symptoms—frequency, urgency, marked hesitancy with prolonged initiation—alongside a left inguinal hernia; denies hematuria or dysuria, and reports stable mood, appetite, bowels, sleep, and weight.", "persona_chinese": "八旬男性，近一个多月出现下尿路症状：尿频、尿急、明显排尿踟蹰、启动时间延长；伴左侧腹股沟疝。无血尿、无尿痛；情绪、胃口、排便、睡眠及体重稳定。"}
{"persona": "He reports six weeks of progressive lower urinary tract symptoms—hesitancy with prolonged initiation, weak stream, frequency, urgency, and nocturia—without incontinence, fever, or back pain, raising concern for BPH-related bladder outlet obstruction.", "persona_chinese": "他近六周下尿路症状渐进加重：尿等待、尿流细弱、尿频尿急及夜尿；无尿失禁、发热或腰背痛，考虑良性前列腺增生相关的膀胱出口梗阻。"}
{"persona": "A 69-year-old man reports two days of acute lower urinary tract symptoms—urinary frequency and urgency—accompanied by hematuria. Worried about the cause, he seeks timely evaluation and guidance on treatment.", "persona_chinese": "69岁男性，近两天出现急性下尿路症状：尿频、尿急，并伴血尿；对病因心存忧虑，正寻求尽快评估与治疗方案建议。"}
{"persona": "At 64, he lives with longstanding BPH causing obstructive LUTS—hesitancy and weak stream. A recent acute urinary retention episode required temporary catheterization; now decatheterized and on medical therapy, he seeks prevention and better flow.", "persona_chinese": "64岁，长期受良性前列腺增生困扰，呈阻塞性下尿路症状——排尿费力、尿流弱。近日发生急性尿潴留并短期导尿；现已拔管且用药中，寻求防复发与改善尿流方案。"}
{"persona": "At 58, she endures eight years of resistant hypertension, spikes to 180/110 with dizziness and headaches. Serial CT shows bilateral adrenal adenomas (right lipid-poor), fatty liver, left-lobe hemangioma/AVF; three years of flank ache; under surveillance.", "persona_chinese": "58岁女性，8年难治性高血压，最高180/110，伴头晕头痛。复查CT示双侧肾上腺腺瘤（右侧乏脂），并脂肪肝及肝左内叶小血管瘤/动静脉瘘。近3年双侧腰隐痛，持续随访观察。"}
{"persona": "A 62-year-old man with known benign prostatic hyperplasia returns for follow-up, reporting recent worsening urinary frequency, urgency, and nocturia, without dysuria, hematuria, flank or abdominal pain, fever, or chills—seeking guidance on management.", "persona_chinese": "62岁男性，既往诊断前列腺增生，此次复诊；近期尿频、尿急、夜尿明显增多；否认尿痛、血尿、腰背酸痛或腹胀腹痛，亦无发热、寒战或畏寒，寻求进一步治疗与管理建议。"}
{"persona": "Pregnant woman in her second trimester experiencing persistent morning sickness and fatigue, seeking nutritional guidance and safe remedies to manage symptoms while ensuring fetal health.", "persona_chinese": "孕中期女性，持续孕吐和疲劳，寻求营养指导和安全缓解方法，同时确保胎儿健康。"}
{"persona": "Toddler with recurring ear infections over the past six months, parents concerned about antibiotic overuse and exploring preventive strategies.", "persona_chinese": "幼儿，近半年反复中耳炎，家长担心抗生素过度使用，希望了解预防策略。"}
{"persona": "College athlete recovering from ACL reconstruction surgery three months ago, eager to return to competitive sports but uncertain about rehabilitation timeline.", "persona_chinese": "大学运动员，三个月前行前交叉韧带重建术，急于恢复竞技状态，但对康复时间表存疑。"}
{"persona": "Middle-aged woman with newly diagnosed Type 2 diabetes, overwhelmed by dietary restrictions and medication regimen, seeking practical lifestyle modification advice.", "persona_chinese": "中年女性，新诊断2型糖尿病，被饮食限制和用药方案困扰，寻求实用的生活方式调整建议。"}
{"persona": "Elderly man with progressive memory loss and confusion, family members worried about Alzheimer's disease and seeking early intervention options.", "persona_chinese": "老年男性，进行性记忆力减退和意识混乱，家属担心阿尔茨海默病，寻求早期干预方案。"}
{"persona": "Teenager struggling with severe acne affecting self-esteem, previously tried over-the-counter treatments without success, considering isotretinoin therapy.", "persona_chinese": "青少年，严重痤疮影响自信心，尝试过非处方药无效，考虑异维A酸治疗。"}
{"persona": "New mother experiencing postpartum depression symptoms including persistent sadness, anxiety about infant care, and difficulty bonding with baby.", "persona_chinese": "新手妈妈，出现产后抑郁症状，包括持续悲伤、对婴儿护理焦虑及与宝宝建立情感联系困难。"}
{"persona": "Construction worker with chronic lower back pain from years of heavy lifting, seeking non-surgical pain management options to continue working.", "persona_chinese": "建筑工人，多年重体力劳动导致慢性腰痛，寻求非手术疼痛管理方案以继续工作。"}
{"persona": "Child with suspected ADHD showing difficulty concentrating in school, parents seeking evaluation and guidance on behavioral interventions versus medication.", "persona_chinese": "儿童，疑似注意力缺陷多动障碍，在校注意力难以集中，家长寻求评估及行为干预与药物治疗的指导。"}
{"persona": "Office worker experiencing burnout with chronic stress, insomnia, and tension headaches, looking for work-life balance strategies and stress management techniques.", "persona_chinese": "办公室职员，职业倦怠伴慢性压力、失眠和紧张性头痛，寻找工作生活平衡策略和压力管理技巧。"}
{"persona": "Woman in her fifties experiencing menopause symptoms including hot flashes, mood swings, and sleep disturbances, exploring hormone replacement therapy options.", "persona_chinese": "五十多岁女性，更年期症状包括潮热、情绪波动和睡眠障碍，探索激素替代疗法选项。"}
{"persona": "Young adult with seasonal allergies causing persistent sneezing, nasal congestion, and itchy eyes, seeking long-term management beyond antihistamines.", "persona_chinese": "青年，季节性过敏导致持续打喷嚏、鼻塞和眼痒，寻求抗组胺药以外的长期管理方案。"}
{"persona": "Cancer survivor five years post-treatment, attending regular follow-up appointments, concerned about recurrence and maintaining quality of life.", "persona_chinese": "癌症幸存者，治疗后五年，定期随访，担心复发并关注生活质量维护。"}
{"persona": "Smoker attempting to quit after 20-year habit, experiencing withdrawal symptoms and seeking support for nicotine addiction cessation.", "persona_chinese": "吸烟者，尝试戒除20年烟瘾，出现戒断症状，寻求尼古丁成瘾戒断支持。"}
{"persona": "Overweight individual with sleep apnea diagnosed recently, prescribed CPAP machine but struggling with compliance and seeking weight loss strategies.", "persona_chinese": "超重人群，近期诊断睡眠呼吸暂停，开具CPAP机但依从性差，寻求减重策略。"}
{"persona": "Migraine sufferer experiencing debilitating headaches three times weekly, tried multiple preventive medications, exploring botox injections or alternative therapies.", "persona_chinese": "偏头痛患者，每周三次致残性头痛，尝试多种预防性药物，探索肉毒素注射或替代疗法。"}
{"persona": "Vegan athlete concerned about adequate protein and vitamin B12 intake, seeking nutritionist consultation for performance optimization.", "persona_chinese": "纯素运动员，担心蛋白质和维生素B12摄入不足，寻求营养师咨询以优化运动表现。"}
{"persona": "Elderly woman with osteoporosis and history of hip fracture, managing fall prevention at home while on bisphosphonate therapy.", "persona_chinese": "老年女性，骨质疏松症并髋部骨折史，服用双膦酸盐治疗，关注家庭防跌倒管理。"}
{"persona": "Restaurant chef with repetitive strain injury in wrist from years of chopping, experiencing numbness and weakness, considering carpal tunnel surgery.", "persona_chinese": "餐厅厨师，多年切菜导致腕部重复性劳损，出现麻木无力，考虑腕管综合征手术。"}
{"persona": "Traveler preparing for international trip to malaria-endemic region, seeking vaccination schedule and antimalarial prophylaxis recommendations.", "persona_chinese": "旅行者，准备前往疟疾流行地区旅行，寻求疫苗接种计划和抗疟预防用药建议。"}
{"persona": "Person with chronic migraines and irritable bowel syndrome, exploring gut-brain connection and dietary triggers for symptom management.", "persona_chinese": "慢性偏头痛合并肠易激综合征患者，探索肠脑联系及饮食诱因以管理症状。"}
{"persona": "Adolescent with type 1 diabetes transitioning to insulin pump therapy, learning carbohydrate counting and adjusting to new technology.", "persona_chinese": "青少年，1型糖尿病，转向胰岛素泵治疗，学习碳水化合物计数并适应新技术。"}
{"persona": "Marathon runner dealing with plantar fasciitis pain, seeking physical therapy exercises and orthotic recommendations to continue training.", "persona_chinese": "马拉松跑者，足底筋膜炎疼痛，寻求物理治疗锻炼和矫形器建议以继续训练。"}
{"persona": "Patient with rheumatoid arthritis on methotrexate experiencing joint pain flare-up, discussing biologic therapy options with rheumatologist.", "persona_chinese": "类风湿关节炎患者，服用甲氨蝶呤，关节疼痛发作，与风湿科医生讨论生物制剂治疗选项。"}
{"persona": "Shift nurse working nights for ten years, struggling with circadian rhythm disruption, chronic fatigue, and increased cardiovascular disease risk.", "persona_chinese": "夜班护士，十年夜间工作，昼夜节律紊乱，慢性疲劳，心血管疾病风险增加。"}
{"persona": "Person with social anxiety disorder experiencing panic attacks in crowded places, exploring cognitive behavioral therapy and SSRI medication options.", "persona_chinese": "社交焦虑症患者，在拥挤场所出现恐慌发作，探索认知行为疗法和SSRI药物选项。"}
{"persona": "Elderly man with Parkinson's disease experiencing tremors and mobility issues, adjusting medication dosages and considering deep brain stimulation.", "persona_chinese": "老年男性，帕金森病，震颤和行动障碍，调整药物剂量并考虑脑深部电刺激。"}
{"persona": "Woman with polycystic ovary syndrome struggling with irregular periods, hirsutism, and infertility, seeking hormonal treatment and fertility counseling.", "persona_chinese": "多囊卵巢综合征女性，月经不规律、多毛症和不孕，寻求激素治疗和生育咨询。"}
{"persona": "Child with peanut allergy carrying epinephrine auto-injector, parents educating school staff about emergency response protocols.", "persona_chinese": "花生过敏儿童，携带肾上腺素自动注射器，家长向学校人员普及紧急应对方案。"}
{"persona": "Person with chronic kidney disease stage 3, monitoring protein intake and blood pressure, discussing dialysis preparation with nephrologist.", "persona_chinese": "慢性肾病3期患者，监测蛋白质摄入和血压，与肾科医生讨论透析准备。"}
{"persona": "Asthma patient with exercise-induced bronchospasm, using rescue inhaler before workouts, seeking better preventive controller medication.", "persona_chinese": "哮喘患者，运动诱发支气管痉挛，锻炼前使用急救吸入器，寻求更好的预防性控制药物。"}
{"persona": "Teenager with eating disorder showing signs of anorexia nervosa, family concerned about rapid weight loss and distorted body image.", "persona_chinese": "青少年，饮食障碍呈现神经性厌食症迹象，家人担心快速体重下降和身体形象扭曲。"}
{"persona": "Patient with atrial fibrillation on anticoagulation therapy, monitoring INR levels regularly and managing stroke prevention.", "persona_chinese": "心房颤动患者，接受抗凝治疗，定期监测INR水平并管理卒中预防。"}
{"persona": "Person with gluten sensitivity experiencing bloating and diarrhea, transitioning to gluten-free diet and learning to read food labels.", "persona_chinese": "麸质敏感者，腹胀和腹泻，转向无麸质饮食并学习阅读食品标签。"}
{"persona": "Elderly couple caring for spouse with dementia at home, seeking respite care resources and caregiver support groups.", "persona_chinese": "老年夫妇，在家照顾痴呆症配偶，寻求临时看护资源和照护者支持小组。"}
{"persona": "Professional experiencing erectile dysfunction, exploring underlying cardiovascular causes and treatment options including PDE5 inhibitors.", "persona_chinese": "专业人士，勃起功能障碍，探索潜在心血管原因及PDE5抑制剂等治疗选项。"}
{"persona": "Woman with endometriosis suffering from severe pelvic pain and heavy menstrual bleeding, considering hormonal suppression or surgical intervention.", "persona_chinese": "子宫内膜异位症女性，严重盆腔疼痛和月经过多，考虑激素抑制或手术干预。"}
{"persona": "Pilot with recent diagnosis of hypertension, concerned about aviation medical certification and medication side effects on flight performance.", "persona_chinese": "飞行员，近期诊断高血压，担心航空医学认证和药物副作用对飞行表现的影响。"}
{"persona": "Person with chronic obstructive pulmonary disease using supplemental oxygen, participating in pulmonary rehabilitation program to improve exercise tolerance.", "persona_chinese": "慢性阻塞性肺病患者，使用补充氧气，参加肺康复计划以提高运动耐量。"}
{"persona": "Student with test anxiety experiencing physical symptoms like rapid heartbeat and nausea before exams, seeking counseling and relaxation techniques.", "persona_chinese": "学生，考试焦虑，考前出现心跳加速和恶心等身体症状，寻求心理咨询和放松技巧。"}
{"persona": "Person with hypothyroidism on levothyroxine replacement therapy, monitoring TSH levels and managing weight gain and fatigue symptoms.", "persona_chinese": "甲状腺功能减退患者，服用左甲状腺素替代治疗，监测TSH水平并管理体重增加和疲劳症状。"}
{"persona": "Musician with performance-related stage fright, experiencing trembling hands and memory lapses, exploring beta-blockers and cognitive techniques.", "persona_chinese": "音乐家，表演相关怯场，手抖和记忆失误，探索β受体阻滞剂和认知技术。"}
{"persona": "Patient with fibromyalgia experiencing widespread chronic pain, sleep disturbances, and cognitive fog, trying multimodal pain management approach.", "persona_chinese": "纤维肌痛患者，广泛慢性疼痛、睡眠障碍和认知雾，尝试多模式疼痛管理方法。"}
{"persona": "Person with lactose intolerance experiencing digestive discomfort after dairy consumption, learning about lactase supplements and dairy alternatives.", "persona_chinese": "乳糖不耐受者，摄入乳制品后消化不适，了解乳糖酶补充剂和乳制品替代品。"}
{"persona": "Transgender individual undergoing hormone replacement therapy, monitoring physical changes and addressing mental health support needs.", "persona_chinese": "跨性别者，接受激素替代治疗，监测身体变化并满足心理健康支持需求。"}
{"persona": "Person with gout experiencing acute joint pain attacks, managing uric acid levels through diet modification and urate-lowering medication.", "persona_chinese": "痛风患者，急性关节疼痛发作，通过饮食调整和降尿酸药物管理尿酸水平。"}
{"persona": "Healthcare worker exposed to tuberculosis, undergoing latent TB testing and considering preventive isoniazid therapy.", "persona_chinese": "医护人员，接触结核病，接受潜伏结核检测并考虑预防性异烟肼治疗。"}
{"persona": "Person with hearing loss using hearing aids, learning to adjust settings in different environments and considering cochlear implant evaluation.", "persona_chinese": "听力损失者，使用助听器，学习在不同环境中调节设置并考虑人工耳蜗评估。"}
{"persona": "Elderly person with macular degeneration experiencing progressive vision loss, receiving anti-VEGF injections and adapting home for visual impairment.", "persona_chinese": "老年人，黄斑变性，进行性视力丧失，接受抗VEGF注射并调整家居以适应视力障碍。"}
{"persona": "Person recovering from stroke three months ago, attending physical and occupational therapy to regain motor function and speech abilities.", "persona_chinese": "中风康复者，三个月前发病，参加物理和职业治疗以恢复运动功能和言语能力。"}
{"persona": "Health-conscious professional in thirties seeking comprehensive executive health screening package to establish baseline health metrics and identify potential risk factors.", "persona_chinese": "三十多岁注重健康的专业人士，寻求全面的高管健康体检套餐以建立基线健康指标并识别潜在风险因素。"}
{"persona": "Traditional Chinese medicine enthusiast exploring acupuncture and herbal remedies for energy balance and overall wellness without specific illness.", "persona_chinese": "中医养生爱好者，探索针灸和草药调理以平衡气血和整体养生，并无特定疾病。"}
{"persona": "Woman considering cosmetic procedures including Botox and dermal fillers, seeking consultation about safety, results, and maintenance requirements.", "persona_chinese": "女性考虑美容医疗项目，包括肉毒素和真皮填充剂，咨询安全性、效果和后续维护要求。"}
{"persona": "Couple planning pregnancy seeking preconception counseling on genetic screening, folic acid supplementation, and lifestyle optimization for fertility.", "persona_chinese": "计划怀孕的夫妇，寻求孕前咨询，包括遗传筛查、叶酸补充和生育力优化的生活方式建议。"}
{"persona": "Biohacker experimenting with intermittent fasting and nootropics, tracking biomarkers and seeking medical oversight for optimization protocols.", "persona_chinese": "生物黑客，尝试间歇性禁食和智能药物，追踪生物标志物并寻求医学监督以优化方案。"}
{"persona": "Person with family history of colon cancer seeking guidance on appropriate screening timeline and preventive colonoscopy scheduling.", "persona_chinese": "结肠癌家族史者，寻求适当筛查时间表和预防性结肠镜检查安排的指导。"}
{"persona": "Longevity enthusiast researching anti-aging interventions including NAD+ supplementation, senolytics, and rapamycin for healthspan extension.", "persona_chinese": "长寿爱好者，研究抗衰老干预措施，包括NAD+补充、衰老细胞清除剂和雷帕霉素以延长健康寿命。"}
{"persona": "Parent seeking age-appropriate sex education resources and guidance for preteen child entering puberty.", "persona_chinese": "家长为即将进入青春期的孩子寻求适龄性教育资源和指导。"}
{"persona": "Corporate employee requesting workplace ergonomic assessment to prevent repetitive strain injuries and optimize desk setup.", "persona_chinese": "企业员工，要求工作场所人体工程学评估，以预防重复性劳损并优化办公桌设置。"}
{"persona": "Individual seeking therapeutic massage and myofascial release for muscle tension relief and stress reduction without underlying pathology.", "persona_chinese": "个人寻求治疗性按摩和肌筋膜放松以缓解肌肉紧张和减压，无潜在病理。"}
{"persona": "Tech worker concerned about blue light exposure and digital eye strain, exploring protective eyewear and screen time management strategies.", "persona_chinese": "科技工作者，担心蓝光暴露和数字眼疲劳，探索护目镜和屏幕时间管理策略。"}
{"persona": "Meditation practitioner seeking guidance on breathwork techniques and mindfulness-based stress reduction programs for mental wellness.", "persona_chinese": "冥想练习者，寻求呼吸技巧指导和基于正念的减压计划以促进心理健康。"}
{"persona": "Woman exploring hormone optimization therapy for perimenopause symptoms and bioidentical hormone replacement consultation.", "persona_chinese": "女性探索围绝经期症状的激素优化治疗和生物同源激素替代咨询。"}
{"persona": "Athlete requesting VO2 max testing and lactate threshold analysis to optimize training zones and performance.", "persona_chinese": "运动员要求最大摄氧量测试和乳酸阈值分析以优化训练区间和表现。"}
{"persona": "Person with sedentary lifestyle seeking personalized exercise prescription from sports medicine physician to safely begin fitness journey.", "persona_chinese": "久坐生活方式者，向运动医学医生寻求个性化运动处方以安全开始健身之旅。"}
{"persona": "Entrepreneur experiencing decision fatigue and cognitive decline, seeking nootropic consultation and cognitive enhancement strategies.", "persona_chinese": "企业家遭遇决策疲劳和认知下降，寻求智能药物咨询和认知增强策略。"}
{"persona": "Patient seeking second opinion on recommended elective surgery, reviewing risks, benefits, and alternative treatment options.", "persona_chinese": "患者就推荐的择期手术寻求第二意见，审查风险、收益和替代治疗选项。"}
{"persona": "Individual requesting pharmacogenomic testing to understand genetic variations affecting drug metabolism and personalize medication choices.", "persona_chinese": "个人要求药物基因组学检测以了解影响药物代谢的遗传变异并个性化用药选择。"}
{"persona": "Health insurance member confused about coverage options, deductibles, and navigating healthcare system for optimal care access.", "persona_chinese": "医疗保险会员对承保选项、免赔额和医疗系统导航感到困惑，寻求最佳医疗服务途径。"}
{"persona": "Person exploring functional medicine approach to address chronic fatigue through comprehensive metabolic testing and root cause analysis.", "persona_chinese": "个人探索功能医学方法，通过全面代谢检测和根本原因分析解决慢性疲劳。"}
{"persona": "Individual seeking medical clearance for scuba diving certification, requiring cardiovascular and pulmonary fitness evaluation.", "persona_chinese": "个人为潜水认证寻求医疗许可，需要心血管和肺功能适应性评估。"}
{"persona": "Person concerned about electromagnetic field exposure from devices, seeking evidence-based guidance on health risks and protective measures.", "persona_chinese": "个人担心设备的电磁场暴露，寻求基于证据的健康风险和防护措施指导。"}
{"persona": "Woman seeking fertility preservation consultation including egg freezing options before cancer treatment or age-related decline.", "persona_chinese": "女性在癌症治疗前或年龄相关衰退前寻求生育力保存咨询，包括冻卵选项。"}
{"persona": "Parent requesting guidance on childhood vaccination schedule, addressing vaccine hesitancy concerns with scientific evidence.", "persona_chinese": "家长就儿童疫苗接种时间表寻求指导，用科学证据解决疫苗犹豫担忧。"}
{"persona": "Individual exploring chelation therapy and heavy metal detoxification protocols after environmental exposure assessment.", "persona_chinese": "个人在环境暴露评估后探索螯合疗法和重金属排毒方案。"}
{"persona": "Person seeking sleep architecture analysis through polysomnography to optimize sleep quality and circadian rhythm alignment.", "persona_chinese": "个人通过多导睡眠图寻求睡眠结构分析，以优化睡眠质量和昼夜节律调整。"}
{"persona": "Frequent flyer concerned about radiation exposure from air travel, seeking dosimetry consultation and health impact assessment.", "persona_chinese": "频繁飞行者担心航空旅行的辐射暴露，寻求剂量测定咨询和健康影响评估。"}
{"persona": "Individual requesting microbiome analysis and personalized probiotic recommendations for gut health optimization.", "persona_chinese": "个人要求微生物组分析和个性化益生菌建议以优化肠道健康。"}
{"persona": "Person exploring peptide therapy including BPC-157 and TB-500 for tissue repair and recovery enhancement.", "persona_chinese": "个人探索肽疗法，包括BPC-157和TB-500，用于组织修复和恢复增强。"}
{"persona": "Parent seeking guidance on introducing solid foods to infant, understanding allergen introduction protocols and nutritional requirements.", "persona_chinese": "家长寻求婴儿辅食引入指导，了解过敏原引入方案和营养需求。"}
{"persona": "Individual considering medical tourism for dental implants abroad, seeking advice on quality standards and post-procedure care.", "persona_chinese": "个人考虑海外医疗旅游进行牙种植，寻求质量标准和术后护理建议。"}
{"persona": "Person exploring cryotherapy and hyperbaric oxygen therapy for athletic recovery and inflammation reduction.", "persona_chinese": "个人探索冷冻疗法和高压氧疗法用于运动恢复和炎症减轻。"}
{"persona": "Professional seeking workplace health and safety consultation regarding chemical exposure and proper protective equipment selection.", "persona_chinese": "专业人士就化学品暴露和适当防护装备选择寻求工作场所健康与安全咨询。"}
{"persona": "Individual requesting bone density screening and calcium metabolism assessment for osteoporosis prevention in early menopause.", "persona_chinese": "个人在早期绝经期要求骨密度筛查和钙代谢评估以预防骨质疏松。"}
{"persona": "Person exploring red light therapy and photobiomodulation for skin rejuvenation and wound healing enhancement.", "persona_chinese": "个人探索红光疗法和光生物调节用于皮肤年轻化和伤口愈合增强。"}
{"persona": "Individual seeking telomere length testing and interpretation for biological age assessment and longevity planning.", "persona_chinese": "个人寻求端粒长度检测和解读以评估生物年龄和长寿规划。"}
{"persona": "Parent concerned about child's growth trajectory, seeking endocrinology consultation for height prediction and growth hormone evaluation.", "persona_chinese": "家长担心孩子生长轨迹，寻求内分泌科咨询以预测身高和生长激素评估。"}
{"persona": "Individual exploring IV vitamin therapy and nutrient infusions for energy optimization and immune support.", "persona_chinese": "个人探索静脉维生素疗法和营养输注以优化能量和免疫支持。"}
{"persona": "Person seeking guidance on safe sun exposure for vitamin D synthesis versus skin cancer prevention balance.", "persona_chinese": "个人寻求安全日晒指导以平衡维生素D合成与皮肤癌预防。"}
{"persona": "Individual requesting comprehensive allergy testing including food sensitivity panel and environmental allergen identification.", "persona_chinese": "个人要求全面过敏测试，包括食物敏感性面板和环境过敏原识别。"}
{"persona": "Person exploring continuous glucose monitoring for metabolic health optimization despite absence of diabetes diagnosis.", "persona_chinese": "个人探索连续血糖监测以优化代谢健康，尽管未诊断糖尿病。"}
{"persona": "Individual seeking naturopathic consultation for holistic health approach combining conventional and complementary medicine.", "persona_chinese": "个人寻求自然疗法咨询，结合常规医学和补充医学的整体健康方法。"}
{"persona": "Professional athlete requesting platelet-rich plasma therapy consultation for sports injury prevention and performance enhancement.", "persona_chinese": "职业运动员要求富血小板血浆疗法咨询以预防运动损伤和提高表现。"}
{"persona": "Person exploring sauna therapy and heat stress adaptation for cardiovascular health and longevity benefits.", "persona_chinese": "个人探索桑拿疗法和热应激适应以获得心血管健康和长寿益处。"}
{"persona": "Individual seeking medical advice for high-altitude trekking preparation including altitude sickness prevention strategies.", "persona_chinese": "个人为高海拔徒步准备寻求医疗建议，包括高原反应预防策略。"}
{"persona": "Person exploring stem cell banking options for future regenerative medicine applications and family health security.", "persona_chinese": "个人探索干细胞储存选项以备未来再生医学应用和家庭健康保障。"}
{"persona": "Individual requesting comprehensive thyroid panel beyond TSH to optimize thyroid function and address subclinical issues.", "persona_chinese": "个人要求TSH以外的全面甲状腺面板以优化甲状腺功能并解决亚临床问题。"}
{"persona": "Person seeking guidance on safe essential oil use for aromatherapy and natural health applications.", "persona_chinese": "个人寻求精油安全使用指导以用于芳香疗法和自然健康应用。"}
{"persona": "Individual exploring wearable health technology data interpretation for activity tracking and health metric optimization.", "persona_chinese": "个人探索可穿戴健康技术数据解读以进行活动追踪和健康指标优化。"}
{"persona": "Person requesting environmental medicine consultation for mold exposure assessment and remediation guidance.", "persona_chinese": "个人要求环境医学咨询以评估霉菌暴露和修复指导。"}
{"persona": "Cardiology patient with three weeks of exertional chest pain; ECG shows ST-segment depression in leads V4-V6, troponin I elevated at 0.8 ng/mL, echocardiogram reveals left ventricular ejection fraction of 45%, scheduled for coronary angiography.", "persona_chinese": "心内科患者，三周活动后胸痛；心电图V4-V6导联ST段压低，肌钙蛋白I升高0.8 ng/mL，超声心动图示左室射血分数45%，拟行冠脉造影。"}
{"persona": "Gastroenterology patient with six months of epigastric burning pain; upper endoscopy revealed duodenal ulcer 8mm in diameter, rapid urease test positive for H. pylori, serum gastrin 150 pg/mL, biopsy pending.", "persona_chinese": "消化内科患者，六个月上腹部烧灼痛；胃镜示十二指肠溃疡直径8mm，快速尿素酶试验阳性检出幽门螺杆菌，血清胃泌素150 pg/mL，活检待查。"}
{"persona": "Neurology patient presenting with thunderclap headache onset 2 hours ago; non-contrast CT head shows subarachnoid hemorrhage in basal cisterns, lumbar puncture reveals xanthochromia with RBC count 5000/μL, blood pressure 180/110 mmHg.", "persona_chinese": "神经内科患者，2小时前霹雳样头痛起病；头颅CT平扫示基底池蛛网膜下腔出血，腰穿脑脊液黄色，红细胞计数5000/μL，血压180/110 mmHg。"}
{"persona": "Orthopedic patient with right ankle pain after twisting injury; X-ray demonstrates Weber B lateral malleolus fracture with 3mm displacement, no syndesmotic widening, Ottawa rules positive, scheduled for ORIF surgery.", "persona_chinese": "骨科患者，扭伤后右踝疼痛；X线示Weber B型外踝骨折伴3mm移位，下胫腓联合无分离，渥太华规则阳性，拟行切开复位内固定术。"}
{"persona": "Pulmonology patient with progressive dyspnea over 18 months; spirometry shows FEV1/FVC ratio 0.55, FEV1 48% predicted post-bronchodilator, chest CT reveals diffuse centrilobular emphysema, arterial blood gas pH 7.38, PaCO2 52 mmHg, PaO2 68 mmHg on room air.", "persona_chinese": "呼吸科患者，18个月进行性呼吸困难；肺功能示FEV1/FVC 0.55，支气管舒张后FEV1占预计值48%，胸部CT示弥漫小叶中心型肺气肿，动脉血气pH 7.38、PaCO2 52 mmHg、PaO2 68 mmHg（室内空气）。"}
{"persona": "Endocrinology patient with polyuria and polydipsia for 3 months; fasting glucose 285 mg/dL, HbA1c 10.2%, random C-peptide 0.3 ng/mL, positive GAD65 antibodies at 45 U/mL, diagnosed with latent autoimmune diabetes in adults.", "persona_chinese": "内分泌科患者，3个月多尿多饮；空腹血糖285 mg/dL，糖化血红蛋白10.2%，随机C肽0.3 ng/mL，GAD65抗体阳性45 U/mL，诊断成人隐匿性自身免疫性糖尿病。"}
{"persona": "Nephrology patient with bilateral lower extremity edema; serum creatinine 3.8 mg/dL, eGFR 18 mL/min/1.73m², 24-hour urine protein 4.5 grams, albumin 2.8 g/dL, renal ultrasound shows bilateral increased echogenicity with preserved size, kidney biopsy scheduled.", "persona_chinese": "肾内科患者，双下肢水肿；血肌酐3.8 mg/dL，eGFR 18 mL/min/1.73m²，24小时尿蛋白4.5克，白蛋白2.8 g/dL，肾脏超声示双肾回声增强、大小正常，拟行肾穿刺活检。"}
{"persona": "Hematology patient with severe fatigue and pallor; CBC shows hemoglobin 6.8 g/dL, MCV 68 fL, MCH 22 pg, serum iron 25 μg/dL, ferritin 8 ng/mL, TIBC 450 μg/dL, peripheral smear reveals microcytic hypochromic anemia with anisopoikilocytosis.", "persona_chinese": "血液科患者，严重乏力面色苍白；血常规示血红蛋白6.8 g/dL、MCV 68 fL、MCH 22 pg，血清铁25 μg/dL、铁蛋白8 ng/mL、总铁结合力450 μg/dL，外周血涂片示小细胞低色素性贫血伴红细胞大小不等形态异常。"}
{"persona": "Dermatology patient with six-month pruritic rash on extensor surfaces; skin biopsy shows hyperkeratosis with parakeratosis, elongated rete ridges, and dermal T-cell infiltrate consistent with psoriasis, PASI score 18, failed topical corticosteroids.", "persona_chinese": "皮肤科患者，六个月伸侧瘙痒性皮疹；皮肤活检示角化过度伴角化不全、表皮突延长、真皮T细胞浸润符合银屑病，PASI评分18分，外用皮质类固醇治疗无效。"}
{"persona": "Oncology patient with persistent cough and hemoptysis; chest CT reveals 4.2 cm spiculated mass in right upper lobe with mediastinal lymphadenopathy, PET-CT shows SUVmax 8.5, bronchoscopy biopsy confirms adenocarcinoma, staging CT abdomen/pelvis negative for metastases.", "persona_chinese": "肿瘤科患者，持续咳嗽伴咯血；胸部CT示右上叶4.2 cm毛刺状肿块伴纵隔淋巴结肿大，PET-CT示SUVmax 8.5，支气管镜活检证实腺癌，腹盆腔CT分期未见转移。"}
{"persona": "Rheumatology patient with bilateral hand joint swelling for 8 months; morning stiffness lasting 90 minutes, RF positive at 180 IU/mL, anti-CCP antibodies 250 U/mL, CRP 45 mg/L, ESR 68 mm/hr, X-ray shows periarticular osteopenia and marginal erosions in MCPs.", "persona_chinese": "风湿科患者，双手关节肿胀8个月；晨僵持续90分钟，RF阳性180 IU/mL，抗CCP抗体250 U/mL，CRP 45 mg/L，ESR 68 mm/hr，X线示掌指关节周围骨质疏松及边缘性骨侵蚀。"}
{"persona": "Infectious disease patient with 5 days of fever up to 39.5°C and confusion; blood cultures positive for Streptococcus pneumoniae, CSF analysis shows WBC 850/μL with 85% neutrophils, protein 180 mg/dL, glucose 25 mg/dL, Gram stain shows gram-positive diplococci.", "persona_chinese": "感染科患者，5天发热最高39.5°C伴意识混乱；血培养阳性肺炎链球菌，脑脊液白细胞850/μL中性粒85%、蛋白180 mg/dL、葡萄糖25 mg/dL，革兰染色见革兰阳性双球菌。"}
{"persona": "Hepatology patient with jaundice and pruritus for 2 weeks; total bilirubin 12.5 mg/dL, direct 9.8 mg/dL, alkaline phosphatase 650 U/L, ALT 95 U/L, AST 110 U/L, anti-mitochondrial antibodies positive 1:320, ultrasound shows no biliary dilation, liver biopsy confirms primary biliary cholangitis.", "persona_chinese": "肝病科患者，黄疸伴瘙痒2周；总胆红素12.5 mg/dL、直接9.8 mg/dL，碱性磷酸酶650 U/L、ALT 95 U/L、AST 110 U/L，抗线粒体抗体阳性1:320，超声示胆道无扩张，肝活检证实原发性胆汁性胆管炎。"}
{"persona": "Urology patient with gross hematuria and left flank pain; CT urogram reveals 7mm obstructing stone at left ureteropelvic junction with moderate hydronephrosis, serum creatinine 1.4 mg/dL, urinalysis shows 100+ RBCs/hpf, no pyuria, stone analysis scheduled.", "persona_chinese": "泌尿科患者，肉眼血尿伴左侧腰痛；CT尿路造影示左肾盂输尿管连接处7mm梗阻性结石伴中度肾积水，血肌酐1.4 mg/dL，尿常规红细胞100+/HPF，无脓尿，拟行结石成分分析。"}
{"persona": "Gynecology patient with menorrhagia and pelvic pressure; pelvic ultrasound shows 8 cm intramural fibroid, hemoglobin 9.2 g/dL, ferritin 15 ng/mL, endometrial biopsy benign, MRI confirms single fibroid without suspicious features, discussing surgical options.", "persona_chinese": "妇科患者，月经过多伴盆腔压迫感；盆腔超声示8 cm肌壁间子宫肌瘤，血红蛋白9.2 g/dL、铁蛋白15 ng/mL，子宫内膜活检良性，MRI证实单发肌瘤无可疑征象，正商讨手术方案。"}
{"persona": "Psychiatry patient with major depressive episode; PHQ-9 score 23, failed two SSRI trials, thyroid function normal, vitamin B12 580 pg/mL, brain MRI unremarkable, considering TMS therapy or medication augmentation with aripiprazole.", "persona_chinese": "精神科患者，重度抑郁发作；PHQ-9评分23分，两种SSRI治疗失败，甲状腺功能正常、维生素B12 580 pg/mL，脑MRI未见异常，考虑经颅磁刺激治疗或阿立哌唑增效。"}
{"persona": "Otolaryngology patient with progressive hearing loss; pure tone audiometry shows bilateral moderate-to-severe sensorineural hearing loss at high frequencies, tympanometry type A bilaterally, MRI internal auditory canals negative for acoustic neuroma, referred for hearing aid evaluation.", "persona_chinese": "耳鼻喉科患者，进行性听力下降；纯音测听示双侧中重度高频感音神经性聋，鼓室导抗双侧A型，内听道MRI排除听神经瘤，转诊助听器评估。"}
{"persona": "Ophthalmology patient with sudden vision loss in right eye; visual acuity 20/200 OD, relative afferent pupillary defect present, fundoscopy shows pale optic disc edema, OCT demonstrates thickening of retinal nerve fiber layer, MRI brain with gadolinium shows optic neuritis, started on IV methylprednisolone.", "persona_chinese": "眼科患者，右眼突发视力下降；视力右眼20/200，相对性传入瞳孔缺陷阳性，眼底镜见苍白性视盘水肿，OCT示视网膜神经纤维层增厚，钆增强脑MRI示视神经炎，已开始静脉甲泼尼龙治疗。"}
{"persona": "Vascular surgery patient with claudication at 100 meters; ankle-brachial index 0.55 on right, 0.62 on left, CT angiography shows severe stenosis of right superficial femoral artery and moderate left iliac disease, HbA1c 8.5%, LDL 145 mg/dL, discussing revascularization options.", "persona_chinese": "血管外科患者，行走100米出现间歇性跛行；踝肱指数右侧0.55、左侧0.62，CT血管造影示右股浅动脉重度狭窄及左髂动脉中度病变，糖化血红蛋白8.5%、LDL 145 mg/dL，正商讨血运重建方案。"}
{"persona": "Emergency medicine patient with acute abdominal pain and vomiting; CT abdomen/pelvis shows acute appendicitis with periappendiceal fat stranding and fluid, WBC 16,800/μL with left shift, CRP 85 mg/L, ultrasound confirms non-compressible appendix 9mm diameter, surgical consultation requested.", "persona_chinese": "急诊科患者，急性腹痛伴呕吐；腹盆腔CT示急性阑尾炎伴阑尾周围脂肪间隙模糊及积液，白细胞16,800/μL伴核左移，CRP 85 mg/L，超声证实阑尾不可压缩直径9mm，已请外科会诊。"}
{"persona": "Geriatrics patient with recurrent falls and cognitive decline; MMSE 22/30, MRI brain shows moderate white matter hyperintensities and cortical atrophy, vitamin B12 195 pg/mL, TSH 4.8 mIU/L, gait assessment reveals reduced stride length and increased double support time, comprehensive fall risk evaluation ongoing.", "persona_chinese": "老年科患者，反复跌倒伴认知下降；MMSE 22/30分，脑MRI示中度脑白质高信号及皮质萎缩，维生素B12 195 pg/mL、TSH 4.8 mIU/L，步态评估显示步幅减小、双支撑时间延长，正进行综合跌倒风险评估。"}
{"persona": "Allergy/immunology patient with anaphylaxis history; skin prick testing positive to peanut (8mm wheal), tree nuts, and shellfish, specific IgE to peanut >100 kU/L, prescribed two epinephrine auto-injectors, pulmonary function tests normal, considering oral immunotherapy enrollment.", "persona_chinese": "变态反应/免疫科患者，过敏性休克病史；皮肤点刺试验花生阳性（风团8mm）、坚果和贝类阳性，花生特异性IgE >100 kU/L，已开具两支肾上腺素自动注射器，肺功能正常，考虑参加口服免疫治疗。"}
{"persona": "Bariatric surgery candidate with BMI 42 kg/m²; failed 6-month supervised weight loss program, obstructive sleep apnea confirmed on polysomnography (AHI 35), HbA1c 7.8%, fatty liver on ultrasound, psychological evaluation completed, discussing sleeve gastrectomy versus gastric bypass.", "persona_chinese": "减重外科候选者，BMI 42 kg/m²；6个月监督减重计划失败，多导睡眠图证实阻塞性睡眠呼吸暂停（AHI 35），糖化血红蛋白7.8%，超声示脂肪肝，心理评估完成，正商讨袖状胃切除术与胃旁路术。"}
{"persona": "Palliative care patient with metastatic pancreatic cancer; CT shows progression despite chemotherapy with new liver lesions and peritoneal carcinomatosis, CA 19-9 elevated to 1850 U/mL, ECOG performance status 3, pain poorly controlled on oral morphine 60mg TID, considering palliative radiation and hospice referral.", "persona_chinese": "姑息治疗患者，转移性胰腺癌；CT示化疗后病情进展出现新发肝转移灶及腹膜癌，CA 19-9升至1850 U/mL，ECOG体力状态评分3分，口服吗啡60mg每日三次疼痛控制不佳，考虑姑息放疗及安宁疗护转诊。"}
{"persona": "Sports medicine patient with anterior cruciate ligament tear; MRI shows complete mid-substance ACL tear with bone contusion in lateral femoral condyle, Lachman test positive with no endpoint, pivot shift grade 2, meniscal examination normal, planning arthroscopic ACL reconstruction with hamstring autograft.", "persona_chinese": "运动医学科患者，前交叉韧带撕裂；MRI示ACL中段完全撕裂伴股骨外髁骨挫伤，Lachman试验阳性无终点感，轴移试验2级阳性，半月板检查正常，计划关节镜下腘绳肌自体移植ACL重建术。"}
{"persona": "Pain management patient with chronic lower back pain radiating to left leg; lumbar MRI shows L4-L5 disc herniation with nerve root compression, EMG/NCS confirms L5 radiculopathy, failed conservative therapy including physical therapy and NSAIDs, currently on gabapentin 900mg TID, considering epidural steroid injection.", "persona_chinese": "疼痛科患者，慢性腰痛放射至左下肢；腰椎MRI示L4-L5椎间盘突出压迫神经根，肌电图/神经传导证实L5神经根病，保守治疗包括物理治疗和NSAIDs无效，目前服用加巴喷丁900mg每日三次，考虑硬膜外类固醇注射。"}
{"persona": "Transplant surgery patient with end-stage liver disease; MELD score 28, Child-Pugh class C, portal hypertension with ascites requiring weekly paracentesis, hepatorenal syndrome type 2, albumin 2.2 g/dL, INR 2.8, active on liver transplant waiting list, blood type O.", "persona_chinese": "移植外科患者，终末期肝病；MELD评分28分、Child-Pugh C级，门脉高压伴腹水需每周穿刺放液，2型肝肾综合征，白蛋白2.2 g/dL、INR 2.8，已列入肝移植等待名单，O型血。"}
{"persona": "Critical care patient with septic shock; admitted to ICU with source identified as urosepsis, lactate 6.2 mmol/L, requiring norepinephrine 0.3 mcg/kg/min for blood pressure support, procalcitonin 18 ng/mL, on broad-spectrum antibiotics pending culture results, mechanically ventilated on ARDS protocol.", "persona_chinese": "重症医学科患者，感染性休克；入住ICU诊断尿源性脓毒症，乳酸6.2 mmol/L，需去甲肾上腺素0.3 mcg/kg/min维持血压，降钙素原18 ng/mL，广谱抗生素治疗待培养结果，机械通气采用ARDS方案。"}
{"persona": "Maternal-fetal medicine patient at 32 weeks gestation with preeclampsia; blood pressure 160/105 despite labetalol, 24-hour urine protein 5.2 grams, platelet count 95,000/μL, AST 180 U/L, ALT 150 U/L, fetal ultrasound shows estimated weight 10th percentile with normal umbilical artery Doppler, admitted for magnesium sulfate and delivery planning.", "persona_chinese": "母胎医学科患者，孕32周先兆子痫；血压160/105（拉贝洛尔治疗中），24小时尿蛋白5.2克，血小板95,000/μL、AST 180 U/L、ALT 150 U/L，胎儿超声示估计体重第10百分位、脐动脉多普勒正常，已入院给予硫酸镁并计划分娩。"}
{"persona": "Neonatology patient, 28-week preterm infant; birth weight 980 grams, Apgar scores 4 and 6, respiratory distress syndrome requiring surfactant and mechanical ventilation, cranial ultrasound shows grade II intraventricular hemorrhage, caffeine started for apnea of prematurity, total parenteral nutrition initiated.", "persona_chinese": "新生儿科患者，28周早产儿；出生体重980克，Apgar评分4分和6分，呼吸窘迫综合征需肺表面活性物质及机械通气，颅脑超声示II级脑室内出血，已开始咖啡因治疗早产儿呼吸暂停，开始全肠外营养。"}
{"persona": "Plastic surgery patient with third-degree burns covering 35% TBSA; full-thickness burns on bilateral upper extremities and anterior torso from house fire, initial fluid resuscitation per Parkland formula, escharotomy performed on right arm for compartment syndrome, planning staged excision and skin grafting, pain controlled with IV fentanyl PCA.", "persona_chinese": "整形外科患者，三度烧伤占体表面积35%；房屋火灾致双上肢和前胸全层烧伤，按Parkland公式初始液体复苏，右臂行焦痂切开术治疗筋膜室综合征，计划分期切痂植皮，静脉芬太尼PCA控制疼痛。"}
{"persona": "Medical genetics patient with family history of breast cancer; BRCA1 genetic testing reveals pathogenic variant c.5266dupC, bilateral breast MRI shows no suspicious lesions, CA 15-3 normal, discussing risk-reduction strategies including bilateral prophylactic mastectomy versus enhanced surveillance, referral to genetic counselor completed.", "persona_chinese": "医学遗传学科患者，乳腺癌家族史；BRCA1基因检测发现致病性变异c.5266dupC，双侧乳腺MRI未见可疑病灶，CA 15-3正常，正商讨降险策略包括双侧预防性乳房切除术与加强监测，已转诊遗传咨询师。"}
{"persona": "Nuclear medicine patient undergoing bone scan for prostate cancer staging; PSA 45 ng/mL, Gleason score 4+4=8 on biopsy, Tc-99m MDP bone scan shows multiple focal areas of increased uptake in spine and pelvis suspicious for metastases, CT chest/abdomen/pelvis shows pelvic lymphadenopathy, oncology consultation scheduled.", "persona_chinese": "核医学科患者，接受骨扫描进行前列腺癌分期；PSA 45 ng/mL，活检Gleason评分4+4=8，Tc-99m MDP骨扫描示脊柱和骨盆多发局灶摄取增高疑似转移，胸腹盆腔CT示盆腔淋巴结肿大，已安排肿瘤科会诊。"}
{"persona": "Sleep medicine patient with severe daytime sleepiness; Epworth Sleepiness Scale 18, overnight polysomnography shows sleep latency 3 minutes, REM latency 5 minutes, five sleep-onset REM periods on MSLT, hypocretin-1 level in CSF <110 pg/mL, diagnosed with narcolepsy type 1, starting modafinil therapy.", "persona_chinese": "睡眠医学科患者，严重日间嗜睡；Epworth嗜睡量表18分，夜间多导睡眠图示睡眠潜伏期3分钟、REM潜伏期5分钟，多次睡眠潜伏期试验见5次睡眠起始REM期，脑脊液食欲素-1水平<110 pg/mL，诊断1型发作性睡病，开始莫达非尼治疗。"}
{"persona": "Occupational medicine patient with suspected silicosis; 15-year history of sandblasting work, progressive dyspnea on exertion, chest X-ray shows bilateral upper lobe nodular opacities and eggshell calcification of hilar nodes, high-resolution CT confirms small rounded opacities in upper zones, spirometry shows restrictive pattern with FVC 65% predicted.", "persona_chinese": "职业病科患者，疑似矽肺；15年喷砂作业史，进行性活动后呼吸困难，胸片示双肺上叶结节状阴影及肺门淋巴结蛋壳样钙化，高分辨CT证实上肺小圆形阴影，肺功能示限制性通气功能障碍FVC占预计值65%。"}
{"persona": "Forensic psychiatry patient undergoing competency evaluation; charged with assault, MMSE 28/30, no evidence of psychosis on structured interview, toxicology screen positive for cannabis, psychiatric history significant for bipolar disorder currently stable on lithium, comprehensive evaluation of criminal responsibility and fitness to stand trial in progress.", "persona_chinese": "司法精神病学科患者，接受刑事责任能力鉴定；被控伤害罪，MMSE 28/30分，结构化访谈无精神病性症状证据，毒物筛查大麻阳性，精神病史示双相情感障碍目前锂盐治疗稳定，正进行刑事责任能力和受审能力综合评估。"}
{"persona": "Addiction medicine patient with opioid use disorder; using heroin daily for 3 years, previous overdose requiring naloxone, hepatitis C antibody positive with detectable HCV RNA, HIV negative, motivated for treatment, starting buprenorphine/naloxone induction with integrated counseling and harm reduction services.", "persona_chinese": "成瘾医学科患者，阿片类物质使用障碍；3年每日使用海洛因，既往过量需纳洛酮救治，丙型肝炎抗体阳性伴HCV RNA可检出，HIV阴性，治疗动机强，开始丁丙诺啡/纳洛酮诱导并整合咨询及减害服务。"}
{"persona": "Preventive cardiology patient with familial hypercholesterolemia; LDL cholesterol 280 mg/dL despite high-intensity statin, lipoprotein(a) 150 nmol/L, coronary calcium score 85 Agatston units at age 45, family history of premature CAD, carotid ultrasound shows increased intima-media thickness, considering PCSK9 inhibitor therapy.", "persona_chinese": "预防心脏病学科患者，家族性高胆固醇血症；高强度他汀治疗LDL胆固醇仍280 mg/dL，脂蛋白(a) 150 nmol/L，45岁冠脉钙化评分85 Agatston单位，早发冠心病家族史，颈动脉超声示内中膜厚度增加，考虑PCSK9抑制剂治疗。"}
{"persona": "Interventional radiology patient with hepatocellular carcinoma; Child-Pugh A cirrhosis, single 3.5 cm lesion in segment 7, AFP 450 ng/mL, triphasic CT shows arterial hyperenhancement with washout, portal vein patent, scheduled for transarterial chemoembolization, liver function tests AST 68 U/L, ALT 72 U/L, bilirubin 1.2 mg/dL.", "persona_chinese": "介入放射学科患者，肝细胞癌；Child-Pugh A级肝硬化，第7段单发3.5 cm病灶，AFP 450 ng/mL，三期CT示动脉期明显强化伴廓清，门静脉通畅，计划经动脉化疗栓塞，肝功能AST 68 U/L、ALT 72 U/L、胆红素1.2 mg/dL。"}
{"persona": "Rehabilitation medicine patient post-stroke; left MCA territory infarct 6 weeks ago, NIH Stroke Scale 8, right hemiparesis with upper extremity strength 3/5 and lower extremity 4/5, mild expressive aphasia, FIM score 85, currently in acute inpatient rehabilitation with physical therapy, occupational therapy, and speech therapy.", "persona_chinese": "康复医学科患者，卒中后；6周前左侧大脑中动脉供血区梗死，NIH卒中量表8分，右侧偏瘫上肢肌力3级、下肢4级，轻度表达性失语，FIM评分85分，目前住院康复接受物理治疗、作业治疗和言语治疗。"}
{"persona": "Clinical pharmacology patient experiencing adverse drug reaction; developed Stevens-Johnson syndrome 10 days after starting allopurinol for gout, mucocutaneous involvement affecting 8% BSA, skin biopsy confirms epidermal necrosis with dermal-epidermal separation, HLA-B*5801 genotyping positive, admitted to burn unit, allopurinol permanently contraindicated, considering febuxostat as alternative.", "persona_chinese": "临床药理学科患者，药物不良反应；痛风开始别嘌醇治疗10天后出现Stevens-Johnson综合征，黏膜皮肤受累体表面积8%，皮肤活检证实表皮坏死伴表皮真皮分离，HLA-B*5801基因分型阳性，入住烧伤科，别嘌醇永久禁忌，考虑非布司他替代。"}
{"persona": "Tropical medicine patient returning from sub-Saharan Africa with fever; 10 days of intermittent high fevers with chills and sweats, thick and thin blood smears positive for Plasmodium falciparum with 5% parasitemia, G6PD screening normal, rapid diagnostic test positive, thrombocytopenia 85,000/μL, starting artemisinin-based combination therapy.", "persona_chinese": "热带医学科患者，撒哈拉以南非洲返回后发热；10天间歇性高热伴寒战出汗，厚薄血膜恶性疟原虫阳性寄生虫血症5%，G6PD筛查正常，快速诊断试验阳性，血小板减少85,000/μL，开始青蒿素类联合疗法。"}
{"persona": "Wound care patient with chronic venous leg ulcer; 8 cm diameter ulcer on medial malleolus present for 6 months, ankle-brachial index 1.05, venous duplex ultrasound shows superficial venous insufficiency without DVT, bacterial culture grew MRSA, biofilm present, receiving sharp debridement and negative pressure wound therapy.", "persona_chinese": "伤口护理科患者，慢性静脉性腿部溃疡；内踝8 cm直径溃疡已6个月，踝肱指数1.05，静脉多普勒超声示浅静脉功能不全无深静脉血栓，细菌培养MRSA生长，存在生物膜，接受锐性清创及负压伤口治疗。"}
{"persona": "Electrophysiology patient with recurrent palpitations; 24-hour Holter monitor shows frequent episodes of supraventricular tachycardia with rates up to 180 bpm, baseline ECG demonstrates delta wave consistent with Wolff-Parkinson-White syndrome, echocardiogram structurally normal, EP study confirms accessory pathway, scheduled for catheter ablation.", "persona_chinese": "心脏电生理科患者，反复心悸；24小时Holter监测示频发室上性心动过速发作心率高达180 bpm，基础心电图见δ波符合WPW综合征，超声心动图结构正常，电生理检查证实旁路，计划导管消融术。"}
{"persona": "Hyperbaric medicine patient with diabetic foot infection; Wagner grade 3 ulcer on right heel with exposed bone, MRI confirms osteomyelitis, tissue culture shows polymicrobial infection including anaerobes, TcPO2 measurements show tissue hypoxia <30 mmHg, started on IV antibiotics and adjunctive hyperbaric oxygen therapy 2.4 ATA for 90 minutes daily.", "persona_chinese": "高压氧医学科患者，糖尿病足感染；右足跟Wagner 3级溃疡骨质外露，MRI证实骨髓炎，组织培养示多菌感染包括厌氧菌，TcPO2测定示组织缺氧<30 mmHg，已开始静脉抗生素及辅助高压氧治疗2.4 ATA每日90分钟。"}
{"persona": "Neuro-oncology patient with glioblastoma multiforme; MRI brain shows 5 cm heterogeneously enhancing right frontal mass with perilesional edema and midline shift, IDH1 wild-type, MGMT promoter unmethylated, completed gross total resection followed by concurrent temozolomide and radiation 60 Gy, now on adjuvant temozolomide cycles, KPS 80.", "persona_chinese": "神经肿瘤学科患者，多形性胶质母细胞瘤；脑MRI示右额叶5 cm不均匀强化肿块伴瘤周水肿及中线移位，IDH1野生型、MGMT启动子未甲基化，已完成肿瘤全切除后同期替莫唑胺及放疗60 Gy，现接受辅助替莫唑胺周期治疗，KPS 80分。"}
{"persona": "Cardiac surgery patient with severe aortic stenosis; transthoracic echocardiogram shows aortic valve area 0.6 cm², mean gradient 55 mmHg, left ventricular ejection fraction 45%, bicuspid aortic valve with heavy calcification, CT chest shows porcelain aorta, STS risk score 8%, referred for transcatheter aortic valve replacement.", "persona_chinese": "心脏外科患者，重度主动脉瓣狭窄；经胸超声心动图示主动脉瓣口面积0.6 cm²、平均压差55 mmHg、左室射血分数45%，二叶主动脉瓣伴重度钙化，胸部CT示瓷化主动脉，STS风险评分8%，转诊经导管主动脉瓣置换术。"}
{"persona": "Postdoctoral researcher investigating CRISPR-Cas9 gene editing for sickle cell disease; published 12 papers, seeking NIH R01 funding.", "persona_chinese": "博士后研究员，研究镰状细胞病的CRISPR-Cas9基因编辑；已发表12篇论文，正申请NIH R01资助。"}
{"persona": "Medical journalist covering the opioid crisis, interviewing addiction specialists and patients in recovery for a long-form investigative piece.", "persona_chinese": "医疗记者，报道阿片类药物危机，正为深度调查报道采访成瘾专科医生和康复患者。"}
{"persona": "Third-year medical student on surgery rotation, preparing for USMLE Step 2 CK while managing sleep deprivation.", "persona_chinese": "医学院三年级学生，外科轮转中，备考USMLE Step 2 CK的同时应对睡眠剥夺。"}
{"persona": "ICU nurse with 15 years' experience, now pursuing nurse practitioner certification part-time.", "persona_chinese": "ICU护士，15年工作经验，目前业余攻读执业护士资格认证。"}
{"persona": "Clinical pharmacist reviewing medication reconciliation for elderly patients with polypharmacy at a large teaching hospital.", "persona_chinese": "临床药师，在大型教学医院为多重用药的老年患者进行药物调和审核。"}
{"persona": "Bioethicist chairing hospital committee deliberating on allocation of scarce ECMO resources during pandemic surge.", "persona_chinese": "生物伦理学家，主持医院委员会讨论大流行高峰期稀缺ECMO资源的分配问题。"}
{"persona": "Pharmaceutical sales representative promoting new GLP-1 agonist to endocrinologists across three states.", "persona_chinese": "医药销售代表，向三个州的内分泌科医生推广新型GLP-1激动剂。"}
{"persona": "Health policy analyst drafting Medicare reimbursement recommendations for novel CAR-T cell therapies.", "persona_chinese": "医疗政策分析师，起草新型CAR-T细胞疗法的Medicare报销建议。"}
{"persona": "Laboratory technician running PCR tests for COVID-19; processing 200+ samples daily in a high-throughput facility.", "persona_chinese": "实验室技术员，进行COVID-19 PCR检测；在高通量实验室每日处理200+样本。"}
{"persona": "First-year resident in internal medicine, post-call after 28-hour shift, questioning career choice.", "persona_chinese": "内科住院医第一年，28小时值班后，开始质疑职业选择。"}
{"persona": "Genetic counselor explaining BRCA test results to anxious families, balancing technical accuracy with emotional support.", "persona_chinese": "遗传咨询师，向焦虑家庭解释BRCA检测结果，在技术准确性与情感支持间寻求平衡。"}
{"persona": "Medical illustrator creating 3D anatomical models for virtual reality surgical training platform.", "persona_chinese": "医学插画师，为虚拟现实手术培训平台制作3D解剖模型。"}
{"persona": "Hospital CEO navigating financial pressures while maintaining quality metrics and staff morale.", "persona_chinese": "医院首席执行官，在财务压力下维持质量指标和员工士气。"}
{"persona": "Radiologist interpreting 50-60 chest CTs daily, concerned about AI replacing diagnostic roles.", "persona_chinese": "放射科医生，每日阅片50-60例胸部CT，担心AI取代诊断岗位。"}
{"persona": "Clinical trial coordinator recruiting participants for Phase III Alzheimer's drug study; behind enrollment targets.", "persona_chinese": "临床试验协调员，为III期阿尔茨海默药物研究招募受试者；入组进度落后。"}
{"persona": "Medical malpractice attorney reviewing neurosurgery case involving alleged retained foreign body.", "persona_chinese": "医疗事故律师，审查涉嫌遗留异物的神经外科案件。"}
{"persona": "Public health epidemiologist tracking foodborne illness outbreak, analyzing surveillance data to identify contamination source.", "persona_chinese": "公共卫生流行病学家，追踪食源性疾病暴发，分析监测数据以识别污染源。"}
{"persona": "Medical device engineer designing next-generation insulin pump with closed-loop glucose monitoring.", "persona_chinese": "医疗器械工程师，设计带闭环血糖监测的新一代胰岛素泵。"}
{"persona": "Palliative care social worker helping families navigate end-of-life decisions and advance care planning.", "persona_chinese": "姑息治疗社工，帮助家庭应对临终决策和预先护理规划。"}
{"persona": "Telemedicine physician conducting virtual consultations across rural areas with limited broadband access.", "persona_chinese": "远程医疗医生，在宽带接入受限的农村地区开展虚拟会诊。"}
{"persona": "Medical librarian curating evidence-based resources, training clinicians on systematic literature searches.", "persona_chinese": "医学图书馆员，整理循证资源，培训临床医生进行系统文献检索。"}
{"persona": "Infection control specialist investigating nosocomial C. diff cluster in surgical ward.", "persona_chinese": "感染控制专员，调查外科病房的院内艰难梭菌聚集性感染。"}
{"persona": "Trauma surgeon in Level I center, averaging 80-hour work weeks, advocating for duty hour reform.", "persona_chinese": "一级创伤中心的创伤外科医生，平均每周工作80小时，倡导工作时长改革。"}
{"persona": "Medical education researcher studying impact of simulation-based training on surgical resident competency.", "persona_chinese": "医学教育研究者，研究模拟训练对外科住院医胜任力的影响。"}
{"persona": "Healthcare data scientist building predictive models for patient readmission risk using EHR data.", "persona_chinese": "医疗数据科学家，利用电子病历数据构建患者再入院风险预测模型。"}
{"persona": "Occupational therapist developing adaptive equipment for stroke survivors with upper extremity deficits.", "persona_chinese": "作业治疗师，为上肢功能障碍的卒中幸存者开发适应性辅具。"}
{"persona": "Medical interpreter bridging language barriers between Spanish-speaking patients and English-speaking providers.", "persona_chinese": "医疗翻译，在西班牙语患者和英语医护人员之间搭建语言桥梁。"}
{"persona": "Regulatory affairs specialist preparing FDA 510(k) submission for novel diagnostic test.", "persona_chinese": "监管事务专员，准备新型诊断检测的FDA 510(k)申报。"}
{"persona": "Emergency department charge nurse managing triage during mass casualty incident from highway pileup.", "persona_chinese": "急诊科护士长，管理高速公路连环车祸大规模伤亡事件的分诊。"}
{"persona": "Molecular biologist optimizing mRNA vaccine production protocols; troubleshooting lipid nanoparticle formulation stability.", "persona_chinese": "分子生物学家，优化mRNA疫苗生产工艺；解决脂质纳米颗粒制剂稳定性问题。"}
{"persona": "Medical school admissions dean reviewing 5,000+ applications, seeking diverse class while maintaining academic standards.", "persona_chinese": "医学院招生主任，审阅5000+份申请，在保持学术标准的同时寻求多元化班级构成。"}
{"persona": "Transplant coordinator managing organ allocation, on-call 24/7 for time-sensitive procurement decisions.", "persona_chinese": "器官移植协调员，管理器官分配，24/7待命处理时间敏感的获取决策。"}
{"persona": "Sleep technologist monitoring overnight polysomnography studies, scoring sleep stages and respiratory events.", "persona_chinese": "睡眠技术员，监测夜间多导睡眠图研究，评分睡眠分期和呼吸事件。"}
{"persona": "Veterinary epidemiologist investigating zoonotic disease transmission at wildlife-livestock interface.", "persona_chinese": "兽医流行病学家，调查野生动物-家畜交界处的人畜共患病传播。"}
{"persona": "Medical coding specialist ensuring accurate ICD-10 and CPT documentation for insurance reimbursement.", "persona_chinese": "医疗编码专员，确保ICD-10和CPT文档准确以获保险报销。"}
{"persona": "Neonatal nurse practitioner managing respiratory support for 24-week preemie in Level IV NICU.", "persona_chinese": "新生儿执业护士，在四级NICU为24周早产儿管理呼吸支持。"}
{"persona": "Health economics researcher conducting cost-effectiveness analysis of checkpoint inhibitors versus conventional chemotherapy.", "persona_chinese": "卫生经济学研究者，进行免疫检查点抑制剂与传统化疗的成本效益分析。"}
{"persona": "Peer review coordinator organizing blinded manuscript evaluations for high-impact medical journal.", "persona_chinese": "同行评审协调员，为高影响力医学期刊组织盲法稿件评估。"}
{"persona": "Surgical robotics technician maintaining da Vinci systems, providing intraoperative technical support.", "persona_chinese": "手术机器人技术员，维护达芬奇系统，提供术中技术支持。"}
{"persona": "Global health consultant designing maternal health intervention for resource-limited settings in sub-Saharan Africa.", "persona_chinese": "全球卫生顾问，为撒哈拉以南非洲资源有限地区设计孕产妇健康干预措施。"}
{"persona": "Medical anthropologist studying cultural beliefs about vaccination in immigrant communities.", "persona_chinese": "医学人类学家，研究移民社区关于疫苗接种的文化信仰。"}
{"persona": "Clinical documentation improvement specialist reviewing physician notes to ensure specificity for risk adjustment.", "persona_chinese": "临床文档改进专员，审核医生病历以确保风险调整的特异性。"}
{"persona": "Pharmacy benefit manager negotiating drug formulary contracts, balancing cost containment with patient access.", "persona_chinese": "药物福利管理人，谈判药品目录合同，在成本控制与患者可及性间寻求平衡。"}
{"persona": "Pediatric oncology fellow presenting novel leukemia treatment protocol at ASH annual meeting.", "persona_chinese": "儿科肿瘤专科医师，在ASH年会展示新型白血病治疗方案。"}
{"persona": "Medical examiner performing autopsies to determine cause of death in suspected fentanyl overdose cases.", "persona_chinese": "法医，对疑似芬太尼过量死亡病例进行尸检以确定死因。"}
{"persona": "Bioinformatics analyst processing whole-exome sequencing data to identify rare disease mutations.", "persona_chinese": "生物信息学分析师，处理全外显子组测序数据以识别罕见病突变。"}
{"persona": "Quality improvement director implementing sepsis bundle protocols across multi-hospital system.", "persona_chinese": "质量改进主管，在多医院系统推行脓毒症集束化方案。"}
{"persona": "Medical writer drafting package inserts and clinical study reports for pharmaceutical submissions.", "persona_chinese": "医学撰稿人，为药品申报撰写药品说明书和临床研究报告。"}
{"persona": "Disaster response physician deployed to earthquake zone, providing emergency care in field hospital with limited resources.", "persona_chinese": "灾难响应医生，派驻地震灾区，在资源有限的野战医院提供急诊救治。"}
{"persona": "High school chemistry teacher, 15 years at same school, recently diagnosed with hypertension during routine checkup; systolic 165/98, worried about medication side effects affecting classroom performance.", "persona_chinese": "高中化学教师，同一所学校任教15年，常规体检发现高血压；收缩压165/98，担心药物副作用影响课堂表现。"}
{"persona": "Freelance graphic designer working from home, severe lower back pain after 8-10 hour daily sessions at desk.", "persona_chinese": "自由职业平面设计师，在家办公，每天伏案8-10小时后严重腰痛。"}
{"persona": "Long-haul truck driver covering cross-country routes; best friend just had stroke at age 52, now questioning own cardiovascular risk with similar lifestyle of irregular sleep, fast food, sedentary hours, and 20-year smoking history.", "persona_chinese": "长途卡车司机，跨州线路；最好的朋友52岁刚中风，现在质疑自己的心血管风险，因为有相似的生活方式——睡眠不规律、快餐、久坐和20年吸烟史。"}
{"persona": "Restaurant chef, owns small bistro, recurring right wrist tendonitis from repetitive knife work; tried ice, NSAIDs, wrist brace—minimal relief.", "persona_chinese": "餐厅主厨，经营小餐馆，反复刀工导致右腕肌腱炎；尝试过冰敷、NSAIDs、护腕——效果甚微。"}
{"persona": "Software engineer at tech startup, 28 years old, experiencing panic attacks during standup meetings and code reviews; racing heart, sweating, sense of impending doom, never happened before joining this high-pressure environment six months ago.", "persona_chinese": "科技创业公司软件工程师，28岁，站立会议和代码评审时出现恐慌发作；心跳加速、出汗、濒死感，加入这个高压环境六个月前从未发生过。"}
{"persona": "Elementary school teacher noticing persistent hoarseness after teaching; voice gives out by afternoon, throat pain.", "persona_chinese": "小学教师，授课后持续声音嘶哑；下午声音就失声，喉咙疼痛。"}
{"persona": "Barista working morning shifts, pregnant with first child at 12 weeks, severe nausea affecting work attendance.", "persona_chinese": "咖啡师，早班，第一胎怀孕12周，严重孕吐影响出勤。"}
{"persona": "Construction foreman, 45, managing crew of 20; father recently diagnosed with pancreatic cancer stage IV, seeking information about genetic risk, screening options, and how to talk to his teenage kids about hereditary cancer risks while dealing with own anticipatory grief.", "persona_chinese": "建筑工头，45岁，管理20人团队；父亲最近确诊IV期胰腺癌，寻求遗传风险信息、筛查选择，以及如何在处理自己的预期性悲伤时与十几岁的孩子谈论遗传性癌症风险。"}
{"persona": "Uber driver, 12-hour shifts, developing hemorrhoids from prolonged sitting.", "persona_chinese": "Uber司机，12小时轮班，久坐引发痔疮。"}
{"persona": "Professional ballet dancer, 32, career-ending knee injury 3 months ago—torn ACL, meniscus damage; post-surgery depression, struggling with identity loss, physical therapy progress slow.", "persona_chinese": "职业芭蕾舞演员，32岁，3个月前职业生涯终结性膝伤——ACL撕裂、半月板损伤；术后抑郁，挣扎于身份丧失，物理治疗进展缓慢。"}
{"persona": "Accountant during tax season, pulling 70-80 hour weeks, migraine headaches 3-4 times weekly.", "persona_chinese": "会计师，报税季每周工作70-80小时，偏头痛每周3-4次。"}
{"persona": "Florist preparing for wedding season, hands developing contact dermatitis from flower stems and preservatives; red, itchy rash on fingers and palms, getting worse despite gloves.", "persona_chinese": "花店老板，婚礼季筹备中，花茎和防腐剂导致手部接触性皮炎；手指和手掌红肿瘙痒，尽管戴手套仍在恶化。"}
{"persona": "Airline pilot, 58, recent FAA medical exam flagged elevated PSA at 6.8 ng/mL; terrified about prostate cancer, more terrified about losing medical certificate and career if diagnosis confirmed, wondering about biopsy risks, treatment options that won't ground him, and whether to get second opinion before reporting to airline medical department.", "persona_chinese": "航空公司飞行员，58岁，最近FAA体检发现PSA升高至6.8 ng/mL；害怕前列腺癌，更害怕确诊后失去体检证明和职业生涯，想知道活检风险、不会让他停飞的治疗选择，以及是否应在向航空医疗部门报告前获得第二意见。"}
{"persona": "Yoga instructor experiencing paradoxical anxiety despite teaching relaxation; performs perfectly in class but has intrusive thoughts, insomnia.", "persona_chinese": "瑜伽教练，尽管教授放松却体验矛盾性焦虑；课堂表现完美但有侵入性思维、失眠。"}
{"persona": "Coal miner, 20 years underground, chronic cough with black sputum, shortness of breath climbing stairs.", "persona_chinese": "煤矿工人，20年井下作业，慢性咳嗽伴黑痰，爬楼梯气短。"}
{"persona": "Real estate agent, constantly on the go, skipping meals, recently fainted during property showing; woke up on client's kitchen floor, embarrassed, now worried something seriously wrong—has been losing weight unintentionally, feels weak, excessive thirst.", "persona_chinese": "房地产经纪人，经常奔波，不按时吃饭，最近看房时晕倒；在客户厨房地板上醒来，很尴尬，现在担心出了大问题——体重无意中下降，感觉虚弱，口渴明显。"}
{"persona": "Hairdresser standing 10 hours daily, varicose veins in both legs, aching pain worse by evening.", "persona_chinese": "理发师，每天站立10小时，双腿静脉曲张，晚上疼痛加重。"}
{"persona": "Firefighter, 34, colleague died in line of duty last month; experiencing nightmares, hypervigilance, avoiding fire station, drinking more.", "persona_chinese": "消防员，34岁，上月同事殉职；噩梦、过度警觉、回避消防站、饮酒增加。"}
{"persona": "Personal trainer at gym, developed eating disorder—orthorexia, obsessed with clean eating, losing muscle mass despite exercise.", "persona_chinese": "健身房私人教练，发展出饮食失调——健康食品痴迷症，痴迷于干净饮食，尽管锻炼仍在流失肌肉。"}
{"persona": "Journalist covering war zones, returned from Syria 6 months ago, can't shake intrusive memories of civilian casualties; startles at loud noises, emotional numbness with family, editor suggesting trauma counseling but he's resistant, thinks he should just 'tough it out' since he chose this career, wife threatening to leave if he doesn't get help.", "persona_chinese": "记者，报道战区，6个月前从叙利亚返回，无法摆脱平民伤亡的侵入性记忆；被巨响吓到，与家人情感麻木，编辑建议创伤咨询但他抗拒，认为自己应该'硬扛'因为是自己选择的职业，妻子威胁如果他不寻求帮助就离婚。"}
{"persona": "Warehouse worker lifting heavy boxes daily, herniated disc L5-S1, workers' comp covering treatment but may lose job.", "persona_chinese": "仓库工人，每天搬重箱子，L5-S1椎间盘突出，工伤赔偿涵盖治疗但可能失业。"}
{"persona": "Nail salon technician, exposure to acetone and formaldehyde, persistent headaches and dizziness at work.", "persona_chinese": "美甲沙龙技师，接触丙酮和甲醛，工作时持续头痛头晕。"}
{"persona": "Police officer working night shift for 8 years, wife complaining about his irritability, sleep schedule completely disrupted, gained 40 pounds, blood pressure creeping up, relationship with kids suffering because he sleeps when they're home from school, contemplating leaving force but pension vesting in 2 years, wondering if melatonin or sleep clinic might help or if he needs career change.", "persona_chinese": "警察，夜班工作8年，妻子抱怨他易怒，睡眠完全紊乱，体重增加40磅，血压升高，与孩子关系受损因为他们放学回家时他在睡觉，考虑离职但养老金两年后才归属，想知道褪黑素或睡眠诊所是否有帮助，还是需要换职业。"}
{"persona": "Massage therapist with carpal tunnel syndrome in both hands; numbness, tingling, weakness—ironic since treats others' pain.", "persona_chinese": "按摩治疗师，双手腕管综合征；麻木、刺痛、无力——讽刺的是她治疗他人的疼痛。"}
{"persona": "Retail manager, holiday season stress, chest tightness and palpitations, afraid it's heart attack but too busy to see doctor.", "persona_chinese": "零售经理，假日季压力，胸闷心悸，害怕是心脏病发作但太忙没法看医生。"}
{"persona": "Musician playing violin in symphony orchestra, focal dystonia in left hand fingers causing involuntary contractions during performances; career in jeopardy, tried physical therapy, botox injections, psychological counseling, nothing working, researching sensory retraining techniques but losing hope, auditions for principal chair next month and can barely play scales.", "persona_chinese": "音乐家，交响乐团拉小提琴，左手手指局灶性肌张力障碍导致演出时不自主收缩；职业生涯岌岌可危，尝试过物理治疗、肉毒素注射、心理咨询，都没用，正研究感觉再训练技术但失去希望，下月首席小提琴手试镜但连音阶都勉强拉。"}
{"persona": "Farmer using pesticides without proper protection, persistent skin rashes, numbness in feet.", "persona_chinese": "农民，使用农药无适当防护，持续皮疹，足部麻木。"}
{"persona": "Telemarketer sitting all day, developing deep vein thrombosis symptoms—leg swelling, pain, redness.", "persona_chinese": "电话营销员，整天坐着，出现深静脉血栓症状——腿肿胀、疼痛、发红。"}
{"persona": "Architect, 41, pulling all-nighters to meet project deadlines, daughter diagnosed with Type 1 diabetes 3 weeks ago at age 9; trying to learn carb counting, insulin dosing, managing school nurses, recognizing hypo symptoms while balancing demanding career, marriage strained by medical stress, feeling overwhelmed and guilty for not noticing symptoms earlier like frequent urination and weight loss.", "persona_chinese": "建筑师，41岁，通宵赶项目截止日期，女儿3周前9岁确诊1型糖尿病；试图学习碳水化合物计数、胰岛素剂量、管理学校护士、识别低血糖症状，同时平衡高要求职业，婚姻因医疗压力紧张，感到不堪重负并内疚于未能更早注意到症状如频繁排尿和体重下降。"}
{"persona": "Convenience store clerk working graveyard shift, type 2 diabetes poorly controlled, A1c 9.5%, irregular meals.", "persona_chinese": "便利店店员，夜班，2型糖尿病控制不佳，A1c 9.5%，饮食不规律。"}
{"persona": "Electrician, 50, exposed to asbestos during renovations in old buildings, now coughing, chest pain, worried about mesothelioma.", "persona_chinese": "电工，50岁，旧楼改造时接触石棉，现咳嗽胸痛，担心间皮瘤。"}
{"persona": "Social media influencer, 26, constantly comparing herself to others online, developed body dysmorphic disorder; obsessive mirror checking, multiple cosmetic procedures, still dissatisfied, followers don't know she's struggling, posts perfect life while feeling miserable, started restricting food, exercising 3 hours daily, boyfriend concerned but she insists she's fine, losing brand deals because can't maintain posting schedule.", "persona_chinese": "社交媒体网红，26岁，不断与网上他人比较，发展出躯体变形障碍；强迫性照镜子，多次整容手术仍不满意，粉丝不知道她在挣扎，发布完美生活照片却感觉悲惨，开始限食、每天锻炼3小时，男友担心但她坚称没事，因无法维持发帖计划失去品牌合作。"}
{"persona": "Plumber frequently kneeling, severe bilateral knee osteoarthritis at age 52, bone-on-bone, considering knee replacement.", "persona_chinese": "水暖工，频繁跪地，52岁严重双膝骨关节炎，骨对骨，考虑膝关节置换。"}
{"persona": "Translator working with international clients across time zones, sleep deprivation chronic, falling asleep at desk.", "persona_chinese": "翻译，与跨时区国际客户合作，慢性睡眠剥夺，伏案睡着。"}
{"persona": "Daycare worker, constantly exposed to sick children, recurrent respiratory infections, wondering if immune system compromised.", "persona_chinese": "托儿所工作人员，经常接触生病儿童，反复呼吸道感染，怀疑免疫系统受损。"}
{"persona": "Professional gamer, 22, sitting 14+ hours daily streaming and competing, severe vitamin D deficiency, never goes outside, numbness in hands from repetitive mouse clicking, posture terrible causing neck and shoulder pain, sleep schedule completely backwards—sleeps 5am to 2pm, eats mostly delivery food, recent blood work showed prediabetes, parents worried but he's making good money and dismisses concerns.", "persona_chinese": "职业玩家，22岁，每天坐14+小时直播和竞技，严重维生素D缺乏，从不外出，重复鼠标点击导致手麻木，姿势糟糕引起颈肩痛，睡眠完全颠倒——早上5点睡到下午2点，主要吃外卖，最近血液检查显示糖尿病前期，父母担心但他赚钱不错并不以为意。"}
{"persona": "Event planner, high-stress job, developed stress-related IBS; alternating diarrhea and constipation, abdominal cramping before big events.", "persona_chinese": "活动策划师，高压工作，发展出压力相关肠易激综合征；腹泻便秘交替，大型活动前腹部痉挛。"}
{"persona": "Security guard at mall, varicose veins and chronic venous insufficiency from standing 12-hour shifts.", "persona_chinese": "商场保安，12小时站立轮班导致静脉曲张和慢性静脉功能不全。"}
{"persona": "Pastry chef, 39, roommate from culinary school just diagnosed with celiac disease after years of unexplained symptoms—bloating, diarrhea, fatigue, weight loss; she's now researching celiac to support friend, realizing she has some similar symptoms herself like occasional stomach issues and feeling tired despite sleeping well, wondering if she should get tested too or if it's just occupational hazard of constantly tasting food.", "persona_chinese": "糕点师，39岁，烹饪学校室友在多年不明原因症状后刚确诊乳糜泻——腹胀、腹泻、疲劳、体重下降；她现在研究乳糜泻以支持朋友，意识到自己也有一些类似症状如偶尔胃部不适和尽管睡眠良好仍感疲倦，想知道是否也应该检测或只是不断品尝食物的职业危害。"}
{"persona": "Makeup artist on film sets, developing chronic sinusitis from cosmetic product fumes and dust.", "persona_chinese": "影视化妆师，化妆品烟雾和粉尘导致慢性鼻窦炎。"}
{"persona": "Delivery driver climbing stairs all day, Achilles tendonitis making each step painful.", "persona_chinese": "快递员，整天爬楼梯，跟腱炎让每一步都痛苦。"}
{"persona": "Investment banker, 35, recently engaged, fiancée revealed she has BRCA1 mutation—her mother and sister both had breast cancer; couple trying to decide whether to do preventive bilateral mastectomy before wedding or wait, discussing egg freezing before potential chemotherapy, learning about ovarian cancer screening, he's overwhelmed trying to support her while processing own fears about future, wondering about impact on having children they planned.", "persona_chinese": "投资银行家，35岁，最近订婚，未婚妻透露她有BRCA1突变——她母亲和姐姐都患过乳腺癌；夫妇正试图决定是在婚礼前进行预防性双侧乳房切除术还是等待，讨论在可能的化疗前冷冻卵子，了解卵巢癌筛查，他在试图支持她的同时处理自己对未来的恐惧感到不知所措，担心对他们计划要孩子的影响。"}
{"persona": "Janitor using harsh cleaning chemicals daily without ventilation, asthma getting worse, wheezing even at home.", "persona_chinese": "清洁工，每天无通风使用强力清洁化学品，哮喘恶化，在家也喘息。"}
{"persona": "Professional photographer, chronic neck pain from looking through viewfinder, headaches radiating from base of skull.", "persona_chinese": "职业摄影师，取景器导致慢性颈痛，头痛从颅底放射。"}
{"persona": "Call center supervisor managing 50 employees, burnout severe; emotional exhaustion, cynicism toward work, feeling ineffective, considering quitting but sole breadwinner with three kids, spouse chronically ill with lupus requiring expensive treatments, health insurance through job is only reason staying, recent panic attack during team meeting, prescribed antidepressants but afraid of stigma in workplace.", "persona_chinese": "呼叫中心主管，管理50名员工，严重倦怠；情感耗竭、对工作愤世嫉俗、感觉无效，考虑辞职但是家里唯一经济来源有三个孩子，配偶患狼疮慢性病需要昂贵治疗，通过工作获得的健康保险是留下的唯一原因，最近团队会议时恐慌发作，开了抗抑郁药但害怕工作场所的污名。"}
{"persona": "Tattoo artist with repetitive strain injury in dominant hand from holding tattoo gun, considering career change.", "persona_chinese": "纹身艺术家，握纹身枪导致主手重复性劳损，考虑转行。"}
{"persona": "Landscaper, chronic sun exposure, dermatologist found several actinic keratoses, worried about skin cancer risk.", "persona_chinese": "园艺工人，长期日晒，皮肤科医生发现多处光化性角化病，担心皮肤癌风险。"}
{"persona": "Professional dancer on cruise ship, seasonal depression during months at sea, limited sunlight exposure, isolated from support network.", "persona_chinese": "邮轮职业舞者，海上数月季节性抑郁，日晒有限，与支持网络隔离。"}
{"persona": "Welder exposed to metal fumes for 25 years, neurological symptoms developing—tremor, coordination problems, memory issues.", "persona_chinese": "焊工，25年接触金属烟雾，神经系统症状发展——震颤、协调问题、记忆问题。"}
{"persona": "Kindergarten teacher, 55, experiencing perimenopausal symptoms during class—hot flashes disrupting lessons, brain fog making it hard to remember students' names, mood swings causing her to snap at children which she never did before, sleep disturbances leaving her exhausted, husband doesn't understand why she's so irritable, tried black cohosh and soy with no improvement, embarrassed to discuss with young colleagues, pediatrician suggested HRT but she's scared of breast cancer risk after reading online.", "persona_chinese": "幼儿园教师，55岁，课堂上出现围绝经期症状——潮热中断课程，脑雾让她难以记住学生名字，情绪波动导致她对孩子发火（以前从未如此），睡眠障碍让她筋疲力尽，丈夫不理解她为什么这么易怒，尝试过升麻和大豆无改善，不好意思与年轻同事讨论，儿科医生建议HRT但她在网上阅读后害怕乳腺癌风险。"}
{"persona": "High school senior applying to colleges, crippling test anxiety causing nausea and diarrhea before SATs.", "persona_chinese": "高三学生，申请大学，SAT考试前严重考试焦虑导致恶心腹泻。"}
{"persona": "College freshman, 800 miles from home, struggling with depression and homesickness; grades dropping, stopped attending classes.", "persona_chinese": "大一新生，离家800英里，抑郁和思乡；成绩下降，不再上课。"}
{"persona": "Graduate student in biology PhD program, developing repetitive strain injury from pipetting 6 hours daily in lab.", "persona_chinese": "生物学博士研究生，实验室每天移液6小时导致重复性劳损。"}
{"persona": "Medical student in third year clinical rotations, experiencing impostor syndrome and burnout, questioning if can handle residency.", "persona_chinese": "医学院三年级临床轮转，冒充者综合征和倦怠，质疑能否应对住院医培训。"}
{"persona": "Retired postal worker, 68, wife died 4 months ago from ovarian cancer; profound grief, not eating properly, lost 25 pounds, children worried about his deteriorating health and isolation.", "persona_chinese": "退休邮递员，68岁，妻子4个月前卵巢癌去世；深度悲伤，饮食不当，体重减轻25磅，孩子们担心他健康恶化和孤立。"}
{"persona": "Elderly woman, 82, living alone, fell twice in past month, afraid to tell daughter for fear of losing independence.", "persona_chinese": "老年女性，82岁，独居，上月跌倒两次，害怕告诉女儿怕失去独立性。"}
{"persona": "New mother, 6 weeks postpartum, exclusively breastfeeding, severe nipple pain and cracked bleeding, baby not gaining weight adequately, feeling like failure.", "persona_chinese": "新手妈妈，产后6周，纯母乳喂养，严重乳头疼痛和皲裂出血，婴儿体重增长不足，觉得自己很失败。"}
{"persona": "Stay-at-home dad caring for 3 kids under 5, experiencing isolation and depression, society questions his masculinity, no support network.", "persona_chinese": "全职奶爸，照顾3个5岁以下孩子，孤立和抑郁，社会质疑他的男子气概，无支持网络。"}
{"persona": "Middle school student being bullied for acne, developing social anxiety, refusing to go to school.", "persona_chinese": "初中生，因痤疮被霸凌，发展出社交焦虑，拒绝上学。"}
{"persona": "Teenager with Type 1 diabetes for 5 years, rebelling against disease management, skipping insulin doses, A1c 11.2%, parents terrified of DKA.", "persona_chinese": "青少年，1型糖尿病5年，反抗疾病管理，跳过胰岛素剂量，A1c 11.2%，父母害怕DKA。"}
{"persona": "Wheelchair user with spinal cord injury from car accident 2 years ago, developing pressure ulcers despite careful skin care, frustrated with limited mobility access in city.", "persona_chinese": "脊髓损伤轮椅使用者，2年前车祸，尽管细心皮肤护理仍发展出压疮，对城市有限的无障碍通道感到沮丧。"}
{"persona": "Deaf patient seeking primary care, repeatedly encounters medical staff who can't communicate effectively, no ASL interpreter available, feeling marginalized in healthcare system.", "persona_chinese": "聋哑患者，寻求初级医疗，反复遇到无法有效沟通的医护人员，无ASL手语翻译，在医疗系统中感到边缘化。"}
{"persona": "Blind man with diabetic retinopathy, learning to navigate world without sight, struggling with insulin administration without visual confirmation.", "persona_chinese": "糖尿病视网膜病变失明男性，学习无视力导航世界，无视觉确认下注射胰岛素挣扎。"}
{"persona": "Catholic priest, 58, hearing confessions about abuse and trauma daily, experiencing vicarious traumatization, no mental health support from diocese.", "persona_chinese": "天主教神父，58岁，每天听虐待和创伤告解，替代性创伤，教区无心理健康支持。"}
{"persona": "Rabbi in Orthodox community, diagnosed with Crohn's disease, struggling to maintain religious dietary laws during flare-ups and hospital stays.", "persona_chinese": "正统犹太社区拉比，确诊克罗恩病，发作和住院期间难以维持宗教饮食规则。"}
{"persona": "Army veteran, served 3 tours in Afghanistan, civilian life for 5 years now, chronic pain from shrapnel wounds, VA wait times for pain management 6 months out, self-medicating with alcohol.", "persona_chinese": "陆军退伍军人，阿富汗3次部署，现已平民生活5年，弹片伤口慢性疼痛，VA疼痛管理等待时间6个月，自我用酒精缓解。"}
{"persona": "Navy SEAL with traumatic brain injury from IED blast, memory problems affecting daily function, refuses to admit cognitive decline to command for fear of discharge.", "persona_chinese": "海豹突击队员，IED爆炸致创伤性脑损伤，记忆问题影响日常功能，拒绝向指挥官承认认知下降怕被开除。"}
{"persona": "Sculptor working with stone and metal, chronic silicosis from dust exposure, progressive shortness of breath limiting ability to work.", "persona_chinese": "雕塑家，石材金属工作，粉尘暴露致慢性矽肺，进行性呼吸困难限制工作能力。"}
{"persona": "Opera singer developing vocal cord nodules from overuse, ENT recommended voice rest for 6 weeks but has performance contracts, torn between career and health.", "persona_chinese": "歌剧演唱家，过度使用导致声带结节，耳鼻喉科建议声休6周但有演出合同，在职业和健康间撕裂。"}
{"persona": "Professional basketball player, 29, third ACL reconstruction, orthopedist suggesting retirement, facing identity crisis and financial uncertainty despite millions earned.", "persona_chinese": "职业篮球运动员，29岁，第三次ACL重建，骨科医生建议退役，尽管已赚数百万仍面临身份危机和财务不确定性。"}
{"persona": "Olympic swimmer diagnosed with exercise-induced asthma at peak of training for trials, worried bronchodilators might trigger doping violation.", "persona_chinese": "奥林匹克游泳选手，选拔赛训练高峰期诊断运动性哮喘，担心支气管扩张剂可能触发兴奋剂违规。"}
{"persona": "Marathon runner, female, amenorrhea for 18 months from low body fat and overtraining, bone density scan shows osteopenia at age 32.", "persona_chinese": "马拉松跑者，女性，低体脂和过度训练导致闭经18个月，32岁骨密度扫描显示骨质减少。"}
{"persona": "Entrepreneur launching tech startup, working 100-hour weeks, developed severe panic disorder with multiple ER visits thinking heart attacks, investors pressuring for results.", "persona_chinese": "企业家，启动科技公司，每周工作100小时，严重恐慌障碍多次急诊以为心脏病发作，投资者施压要结果。"}
{"persona": "Small business owner, restaurant forced to close during pandemic, filed bankruptcy, now depressed and suicidal, lost life savings.", "persona_chinese": "小企业主，疫情期间餐厅被迫关闭，申请破产，现抑郁有自杀倾向，失去毕生积蓄。"}
{"persona": "Dairy farmer, family farm for 4 generations, milk prices collapsed, working 18-hour days 7 days a week, severe sleep deprivation and stress-induced hypertension.", "persona_chinese": "奶农，家族农场4代，牛奶价格崩溃，每天工作18小时一周7天，严重睡眠剥夺和压力诱发的高血压。"}
{"persona": "Commercial fisherman in Alaska, prolonged time at sea in dangerous conditions, witnessed crew member swept overboard and drown, survivor's guilt and PTSD.", "persona_chinese": "阿拉斯加商业渔民，在危险条件下长时间出海，目睹船员被卷入海中淹死，幸存者内疚和PTSD。"}
{"persona": "Migrant farm worker, undocumented, exposed to pesticides daily, skin burns and respiratory symptoms but afraid to seek medical care due to immigration status.", "persona_chinese": "移民农场工人，无证，每天接触农药，皮肤灼伤和呼吸症状但因移民身份害怕就医。"}
{"persona": "Hotel housekeeper, immigrant from Guatemala, cleans 20+ rooms daily, chronic shoulder and back pain, paid minimum wage with no health insurance.", "persona_chinese": "酒店客房服务员，危地马拉移民，每天清洁20+间房，慢性肩背痛，最低工资无健康保险。"}
{"persona": "Casino dealer working graveyard shift in Las Vegas, carpal tunnel syndrome from shuffling cards, constant secondhand smoke exposure, circadian rhythm disorder.", "persona_chinese": "拉斯维加斯赌场荷官，夜班，洗牌导致腕管综合征，持续二手烟暴露，昼夜节律紊乱。"}
{"persona": "Cruise ship waiter, contracts norovirus outbreak affecting 300 passengers and crew, isolated in tiny cabin while ship continues voyage.", "persona_chinese": "邮轮服务员，感染诺如病毒暴发影响300名乘客和船员，船继续航行时隔离在狭小舱室。"}
{"persona": "Flight attendant, 20 years with airline, chronic jet lag and sleep disruption, recent diagnosis of breast cancer, radiation treatments conflict with flight schedule.", "persona_chinese": "空乘，航空公司20年，慢性时差和睡眠中断，最近诊断乳腺癌，放疗与航班时间冲突。"}
{"persona": "Stock trader on Wall Street, cocaine addiction to maintain performance during 14-hour days, starting to have chest pains at age 34.", "persona_chinese": "华尔街股票交易员，可卡因成瘾以维持14小时工作表现，34岁开始胸痛。"}
{"persona": "Insurance claims adjuster, develops compassion fatigue after denying coverage for families in crisis, moral injury causing depression and drinking problem.", "persona_chinese": "保险理赔员，拒绝危机家庭的保险后发展出同情疲劳，道德伤害导致抑郁和酗酒问题。"}
{"persona": "Real estate developer, 52, massive stress from failed project and creditors, developed stress cardiomyopathy (broken heart syndrome) after business partner lawsuit.", "persona_chinese": "房地产开发商，52岁，失败项目和债权人巨大压力，商业伙伴诉讼后发展出应激性心肌病（心碎综合征）。"}
{"persona": "Newspaper reporter, industry dying, took buyout at age 55, can't find work in digital media, wife has MS requiring expensive medications, depleting retirement savings.", "persona_chinese": "报纸记者，行业衰亡，55岁接受买断，数字媒体找不到工作，妻子患MS需昂贵药物，耗尽退休储蓄。"}
{"persona": "Book editor at publishing house, staring at screens 10+ hours daily, severe digital eye strain and headaches, blue light glasses not helping.", "persona_chinese": "出版社图书编辑，每天盯屏幕10+小时，严重数字眼疲劳和头痛，防蓝光眼镜无效。"}
{"persona": "Podcast host discussing mental health topics, paradoxically developing depression herself, feels like fraud, afraid followers will lose trust if she reveals struggle.", "persona_chinese": "心理健康话题播客主持人，矛盾地自己发展出抑郁症，感觉像骗子，害怕透露挣扎会失去粉丝信任。"}
{"persona": "Web developer, remote work for 3 years, social isolation extreme, hasn't left apartment in 2 months, vitamin D deficiency, developing agoraphobia.", "persona_chinese": "网络开发者，远程工作3年，极度社交隔离，2个月未出公寓，维生素D缺乏，发展出广场恐惧症。"}
{"persona": "Cybersecurity analyst monitoring threats 24/7, hypervigilance from work bleeding into personal life, can't relax, constant anxiety about data breaches.", "persona_chinese": "网络安全分析师，24/7监控威胁，工作的过度警觉渗入个人生活，无法放松，对数据泄露持续焦虑。"}
{"persona": "Factory worker in automotive plant, repetitive assembly line motion for 12 years, bilateral carpal tunnel requiring surgery, workers' comp dispute delaying treatment.", "persona_chinese": "汽车工厂工人，流水线重复动作12年，双侧腕管综合征需手术，工伤赔偿纠纷延迟治疗。"}
{"persona": "Textile mill worker in developing country, exposed to cotton dust for 15 years, byssinosis causing progressive lung disease, no occupational safety regulations.", "persona_chinese": "发展中国家纺织厂工人，15年棉尘暴露，棉尘病导致进行性肺病，无职业安全法规。"}
{"persona": "Oil rig worker in Gulf of Mexico, 3 weeks on rig then 3 weeks off, relationship with family deteriorating, son doesn't recognize him, considering leaving high-paying job.", "persona_chinese": "墨西哥湾石油钻井平台工人，3周在平台3周休息，与家人关系恶化，儿子不认识他，考虑离开高薪工作。"}
{"persona": "Coal mine safety inspector, witnessed fatal accident, guilt over not catching violation that led to death, leaving profession after 20 years.", "persona_chinese": "煤矿安全检查员，目睹致命事故，未发现导致死亡的违规感到内疚，20年后离职。"}
{"persona": "Astronaut in training, motion sickness severe during parabolic flights, afraid will be disqualified from space program after years of preparation.", "persona_chinese": "航天员训练中，抛物线飞行时严重晕动病，害怕多年准备后被太空计划取消资格。"}
{"persona": "Commercial airline pilot facing mandatory retirement at 65 in 6 months, entire identity wrapped up in flying, facing existential crisis about purpose.", "persona_chinese": "商业航空公司飞行员，6个月后65岁强制退休，整个身份都围绕飞行，面临关于人生目标的存在危机。"}
{"persona": "Ship captain on container vessel, 9 months at sea per year, wife filed for divorce via email, hasn't seen kids in 7 months, severe depression at sea with no mental health resources.", "persona_chinese": "集装箱船船长，每年9个月出海，妻子通过电子邮件提出离婚，7个月未见孩子，海上严重抑郁无心理健康资源。"}
{"persona": "Offshore wind turbine technician, fear of heights developing after near-fall incident, now required to climb 300-foot towers daily, job in jeopardy.", "persona_chinese": "海上风力涡轮机技术员，近摔事件后发展出恐高症，现需每天攀爬300英尺高塔，工作岌岌可危。"}
{"persona": "Environmental scientist documenting climate change impacts, eco-anxiety and grief over species extinction, feeling powerless to stop destruction.", "persona_chinese": "环境科学家，记录气候变化影响，生态焦虑和物种灭绝悲伤，对无力阻止破坏感到无助。"}
{"persona": "Wildlife conservationist in Africa, contracted malaria three times, also has chronic Lyme disease from tick bites, continues work despite health risks.", "persona_chinese": "非洲野生动物保护者，感染疟疾三次，还有蜱虫叮咬导致的慢性莱姆病，尽管健康风险仍继续工作。"}
{"persona": "Humanitarian aid worker just returned from Syrian refugee camp, witnessed unspeakable suffering, PTSD nightmares, trouble readjusting to comfortable American life.", "persona_chinese": "人道主义援助工作者，刚从叙利亚难民营返回，目睹难以言说的苦难，PTSD噩梦，难以重新适应舒适的美国生活。"}
{"persona": "Organ procurement coordinator, constantly on call for time-sensitive organ retrievals, emotional toll of interacting with grieving families, burnout after 8 years.", "persona_chinese": "器官获取协调员，时间敏感器官提取持续待命，与悲伤家庭互动的情感代价，8年后倦怠。"}
{"persona": "Forensic pathologist performing autopsies, chronic nightmares and intrusive images, can't eat meat anymore, therapist suggesting career change.", "persona_chinese": "法医病理学家，进行尸检，慢性噩梦和侵入性图像，无法再吃肉，治疗师建议换职业。"}
{"persona": "Crime scene investigator, 15 years documenting murders and violence, desensitized to death in ways that disturb family, divorce pending.", "persona_chinese": "犯罪现场调查员，15年记录谋杀和暴力，对死亡的麻木让家人不安，离婚在即。"}
{"persona": "Public defender in overburdened system, carrying 200+ cases, working 80-hour weeks, chronic migraines and ulcers from stress, clients calling her at 3am.", "persona_chinese": "公设辩护律师，系统负担过重，处理200+案件，每周工作80小时，压力导致慢性偏头痛和溃疡，客户凌晨3点打电话。"}
{"persona": "District attorney prosecuting child abuse cases, vicarious trauma from reviewing evidence, own children same age as victims, can't separate work from home life.", "persona_chinese": "地区检察官，起诉儿童虐待案件，审查证据的替代性创伤，自己孩子与受害者同龄，无法分开工作和家庭生活。"}
{"persona": "Immigration judge deciding asylum cases, moral distress over denying cases that may result in deportation to danger, nightmares about consequences of decisions.", "persona_chinese": "移民法官，裁决庇护案件，拒绝可能导致遣返到危险地区的案件道德痛苦，对决定后果的噩梦。"}
{"persona": "Prison guard in maximum security facility, constant threat of violence, hypervigilance and PTSD, relationship with wife suffering from inability to emotionally connect.", "persona_chinese": "最高安全级别监狱狱警，持续暴力威胁，过度警觉和PTSD，与妻子关系因无法情感连接而受损。"}
{"persona": "911 dispatcher taking emergency calls for 10 years, compassion fatigue, heard people die over phone multiple times, developed severe anxiety disorder.", "persona_chinese": "911调度员，10年接听紧急电话，同情疲劳，多次在电话中听到人死亡，发展出严重焦虑障碍。"}
{"persona": "Firefighter/paramedic, pulled dead child from car accident last month, can't stop seeing child's face, avoiding own young daughter, wife insisting on counseling.", "persona_chinese": "消防员/护理人员，上月从车祸中拉出死去的孩子，无法停止看到孩子的脸，回避自己的幼女，妻子坚持要咨询。"}
{"persona": "School counselor in high school, third student suicide this year, feeling responsible despite doing everything possible, questioning if in right profession.", "persona_chinese": "高中学校辅导员，今年第三个学生自杀，尽管尽了一切努力仍感到负责，质疑是否做对了职业。"}
{"persona": "Child protective services worker, removing children from abusive homes daily, vicarious trauma overwhelming, considering leaving field after 5 years.", "persona_chinese": "儿童保护服务工作者，每天从虐待家庭移除儿童，替代性创伤压倒性，5年后考虑离开该领域。"}
{"persona": "Oncology nurse caring for terminal patients, developing anticipatory grief with each patient bond, compassion fatigue making it hard to provide emotional support.", "persona_chinese": "肿瘤科护士，照顾临终患者，每次与患者建立联系都发展出预期性悲伤，同情疲劳让情感支持变得困难。"}
{"persona": "Veterinarian performing euthanasia multiple times weekly, accumulating grief, suicidal ideation, profession has highest suicide rate but colleagues don't talk about it.", "persona_chinese": "兽医，每周多次实施安乐死，累积悲伤，自杀意念，职业自杀率最高但同事不谈论。"}
{"persona": "Animal shelter worker, euthanizing healthy animals due to overpopulation, moral injury and depression, started drinking to cope.", "persona_chinese": "动物收容所工作者，因过剩对健康动物实施安乐死，道德伤害和抑郁，开始喝酒应对。"}
{"persona": "Fashion model, 19, anorexia nervosa to maintain size 0, hair falling out, amenorrhea for 8 months, agency pushing her to lose more weight.", "persona_chinese": "时装模特，19岁，为保持0号身材患神经性厌食症，头发脱落，闭经8个月，经纪公司推她再减重。"}
{"persona": "Actor in Hollywood, constant rejection and uncertainty, developed social anxiety despite being in public-facing career, self-medicating with benzodiazepines.", "persona_chinese": "好莱坞演员，持续拒绝和不确定性，尽管面向公众的职业仍发展出社交焦虑，用苯二氮卓自我治疗。"}
{"persona": "Film director shooting intense drama, identifying too much with dark subject matter, depression worsening, using substances to manage during 18-hour shooting days.", "persona_chinese": "电影导演，拍摄强烈戏剧，过度认同黑暗主题，抑郁恶化，18小时拍摄日期间使用物质管理。"}
{"persona": "Stunt performer in action movies, multiple concussions from falls and car crashes, chronic headaches and memory problems, hiding symptoms to keep working.", "persona_chinese": "动作电影特技演员，摔倒和车祸导致多次脑震荡，慢性头痛和记忆问题，隐藏症状以继续工作。"}
{"persona": "Broadway performer, eight shows per week, vocal strain and chronic fatigue, no sick days possible during run, pushed through stress fracture in foot.", "persona_chinese": "百老汇表演者，每周八场演出，声带劳损和慢性疲劳，演出期间不可能请病假，带着足部应力性骨折坚持。"}
{"persona": "Stand-up comedian using dark humor about own mental health, audience laughs while he's seriously contemplating suicide, fame masking deep depression.", "persona_chinese": "单口喜剧演员，用关于自己心理健康的黑色幽默，观众大笑而他认真考虑自杀，名气掩盖深度抑郁。"}
{"persona": "Video game tester playing same level 12 hours daily for months, severe eye strain, headaches, developing seizure disorder from flashing lights.", "persona_chinese": "电子游戏测试员，数月每天玩同一关卡12小时，严重眼疲劳、头痛，闪光导致癫痫发作障碍。"}
{"persona": "YouTube content creator, pressure to constantly produce viral content, algorithm changes destroyed income, anxiety and depression from online harassment and hate comments.", "persona_chinese": "YouTube内容创作者，持续产生病毒内容的压力，算法变化摧毁收入，网络骚扰和仇恨评论导致焦虑和抑郁。"}
{"persona": "Twitch streamer broadcasting 10+ hours daily, parasocial relationships with viewers blurring boundaries, stalker showed up at house, now has PTSD.", "persona_chinese": "Twitch主播，每天直播10+小时，与观众的准社交关系模糊界限，跟踪狂出现在家，现有PTSD。"}
{"persona": "Esports coach managing teenage players, parental pressure and burnout in young athletes causing mental health crisis, feels responsible for their wellbeing.", "persona_chinese": "电竞教练，管理青少年选手，父母压力和年轻运动员倦怠导致心理健康危机，对他们的幸福感到负责。"}
{"persona": "Professional race car driver, crashed at 180mph 6 months ago, severe road rash and burns healed, but PTSD making it terrifying to get back behind wheel.", "persona_chinese": "职业赛车手，6个月前以180英里时速撞车，严重擦伤和烧伤愈合，但PTSD让重新驾驶变得恐怖。"}
{"persona": "Rock climber attempting El Capitan free solo, intrusive thoughts about falling, anxiety interfering with performance, questioning if risk worth it after friend's fatal fall.", "persona_chinese": "攀岩者，尝试El Capitan自由独攀，关于坠落的侵入性思维，焦虑干扰表现，朋友致命坠落后质疑风险是否值得。"}
{"persona": "Extreme skier, avalanche survivor, buried for 20 minutes before rescue, now has panic attacks in enclosed spaces and nightmares about suffocation.", "persona_chinese": "极限滑雪者，雪崩幸存者，救援前被埋20分钟，现在封闭空间恐慌发作和窒息噩梦。"}
{"persona": "Mixed martial arts fighter, repeated blows to head causing chronic traumatic encephalopathy symptoms, slurred speech developing, family begging him to retire.", "persona_chinese": "综合格斗选手，反复头部打击导致慢性创伤性脑病症状，言语不清发展，家人恳求他退役。"}
{"persona": "Professional surfer, shark attack survivor, lost part of leg, struggling with phantom limb pain and PTSD, trying to return to sport with prosthetic.", "persona_chinese": "职业冲浪者，鲨鱼袭击幸存者，失去部分腿，挣扎于幻肢痛和PTSD，试图用假肢回归运动。"}
{"persona": "Ice hockey player, 5 documented concussions, likely more undiagnosed, early signs of CTE, depression and anger issues, only 28 years old.", "persona_chinese": "冰球运动员，5次记录的脑震荡，可能更多未诊断，CTE早期迹象，抑郁和愤怒问题，只有28岁。"}
{"persona": "Equestrian show jumper, thrown from horse, fractured vertebrae, now paralyzed from waist down, adjusting to life in wheelchair, grieving loss of independence.", "persona_chinese": "马术障碍赛骑手，从马上摔下，椎骨骨折，现腰部以下瘫痪，适应轮椅生活，悲伤失去独立性。"}
{"persona": "Gymnastics coach accused of abusive training methods, young gymnast developed eating disorder under her coaching, guilt and lawsuit threatening career.", "persona_chinese": "体操教练，被指控虐待性训练方法，年轻体操运动员在她的指导下发展出饮食失调，内疚和诉讼威胁职业。"}
{"persona": "Retired NFL player, 42, multiple untreated concussions during career, early-onset dementia, behavioral changes frightening wife and children.", "persona_chinese": "NFL退役球员，42岁，职业生涯中多次未治疗的脑震荡，早发性痴呆，行为变化让妻子和孩子害怕。"}
{"persona": "Olympic gymnast who won gold at 16, now 20 and body breaking down from years of intense training, forced early retirement, identity crisis.", "persona_chinese": "奥运体操运动员，16岁赢得金牌，现20岁，多年高强度训练让身体垮了，被迫提前退役，身份危机。"}
{"persona": "Tennis pro with severe tennis elbow despite physical therapy, cortisone injections providing diminishing returns, facing surgery that could end career.", "persona_chinese": "网球职业选手，尽管物理治疗仍有严重网球肘，可的松注射效果递减，面临可能终结职业生涯的手术。"}
{"persona": "CrossFit trainer, rhabdomyolysis from overtraining, kidneys damaged, learning balance between pushing limits and safety the hard way.", "persona_chinese": "CrossFit教练，过度训练导致横纹肌溶解症，肾脏受损，以艰难方式学习推动极限与安全之间的平衡。"}
{"persona": "Bodybuilder using anabolic steroids for competition, developing liver damage and gynecomastia, also experiencing roid rage affecting relationships.", "persona_chinese": "健美运动员，比赛使用合成类固醇，发展出肝损伤和男性乳房发育症，还经历类固醇狂怒影响人际关系。"}
{"persona": "Yoga teacher developing hip impingement from extreme flexibility poses, ironic that practice meant to heal is causing injury.", "persona_chinese": "瑜伽老师，极端柔韧姿势导致髋关节撞击，讽刺的是旨在治愈的练习正在造成伤害。"}
{"persona": "Personal trainer who developed exercise addiction, training 4+ hours daily, missing social events, relationships suffering, can't take rest days.", "persona_chinese": "私人教练，发展出运动成瘾，每天训练4+小时，错过社交活动，人际关系受损，无法休息。"}
{"persona": "Elderly man, 76, prostate cancer diagnosed 2 years ago on active surveillance, PSA slowly rising, urologist recommending treatment but patient terrified of incontinence and impotence side effects.", "persona_chinese": "老年男性，76岁，2年前诊断前列腺癌采取主动监测，PSA缓慢上升，泌尿科医生建议治疗但患者害怕尿失禁和阳痿副作用。"}
{"persona": "Retired teacher, 70, caring for husband with Alzheimer's for 5 years, caregiver burnout extreme, own health declining, refuses outside help out of guilt and love.", "persona_chinese": "退休教师，70岁，5年照顾阿尔茨海默病丈夫，照护者倦怠极端，自己健康下降，出于内疚和爱拒绝外部帮助。"}
{"persona": "Widow, 78, living in assisted living facility, chronic loneliness and depression, children visit once per month, contemplating suicide despite no terminal illness.", "persona_chinese": "寡妇，78岁，住在辅助生活设施，慢性孤独和抑郁，孩子每月探望一次，尽管无绝症仍考虑自杀。"}
{"persona": "Grandfather, 73, diagnosed with lung cancer from 40 years of smoking, trying to quit now but damage done, regret overwhelming, wants more time with grandchildren.", "persona_chinese": "祖父，73岁，40年吸烟诊断肺癌，现在尝试戒烟但损害已成，悔恨压倒性，想与孙辈有更多时间。"}
{"persona": "Elderly immigrant woman, 81, speaks no English, navigating complex healthcare system alone, missed appointments due to transportation issues and confusion.", "persona_chinese": "老年移民女性，81岁，不会英语，独自应对复杂医疗系统，因交通问题和困惑错过预约。"}
{"persona": "Nursing home resident, 85, chronic pain from arthritis, opioid prescription causing constipation and confusion, quality of life poor.", "persona_chinese": "养老院居民，85岁，关节炎慢性疼痛，阿片类药物处方导致便秘和意识混乱，生活质量差。"}
{"persona": "Retired veteran, 72, multiple health problems from Agent Orange exposure in Vietnam, VA benefits difficult to navigate, wife died last year.", "persona_chinese": "退休老兵，72岁，越南橙剂暴露导致多种健康问题，VA福利难以导航，妻子去年去世。"}
{"persona": "Grandmother raising 3 grandchildren after daughter's opioid overdose death, 68 years old, exhausted and overwhelmed, own health needs neglected.", "persona_chinese": "祖母，女儿阿片类药物过量死亡后抚养3个孙辈，68岁，疲惫不堪，自己的健康需求被忽视。"}
{"persona": "Elderly man with Parkinson's disease, tremors worsening, losing independence, caregiver wife also elderly and struggling physically to help him.", "persona_chinese": "老年男性帕金森病，震颤恶化，失去独立性，照护者妻子也年迈并在身体上挣扎帮助他。"}
{"persona": "Retired factory worker, 69, mesothelioma from asbestos exposure 30 years ago, terminal diagnosis, seeking legal compensation for family before death.", "persona_chinese": "退休工厂工人，69岁，30年前石棉暴露导致间皮瘤，终末诊断，在死前为家庭寻求法律赔偿。"}
{"persona": "Senior citizen, 74, cataracts in both eyes, can't drive anymore, feeling isolated in rural area with no public transportation.", "persona_chinese": "老年人，74岁，双眼白内障，无法再开车，在无公共交通的农村地区感到孤立。"}
{"persona": "Elderly woman, 80, falling repeatedly due to balance issues, hip fracture 6 months ago, terrified of falling again, becoming housebound.", "persona_chinese": "老年女性，80岁，平衡问题反复跌倒，6个月前髋部骨折，害怕再次跌倒，变得足不出户。"}
{"persona": "Retiree on fixed income, medication costs forcing choice between food and prescriptions, rationing diabetes medication to save money.", "persona_chinese": "固定收入退休人员，药物费用迫使在食物和处方间选择，配给糖尿病药物以省钱。"}
{"persona": "Man, 71, hearing loss worsening, refuses hearing aids out of vanity, social isolation increasing as he withdraws from conversations.", "persona_chinese": "男性，71岁，听力损失恶化，出于虚荣拒绝助听器，退出对话导致社交隔离增加。"}
{"persona": "Pregnant woman, 38, third trimester, gestational diabetes requiring insulin, stress about baby's health, glucose monitoring overwhelming.", "persona_chinese": "孕妇，38岁，孕晚期，妊娠糖尿病需胰岛素，婴儿健康压力，血糖监测令人不堪重负。"}
{"persona": "Mother of newborn twins, severe sleep deprivation, hallucinating from exhaustion, postpartum depression developing, afraid to tell doctor.", "persona_chinese": "新生双胞胎母亲，严重睡眠剥夺，疲惫幻觉，产后抑郁发展，害怕告诉医生。"}
{"persona": "Father whose infant died of SIDS 3 months ago, marriage falling apart from grief, unable to enter baby's nursery, considering divorce.", "persona_chinese": "婴儿3个月前SIDS死亡的父亲，婚姻因悲伤破裂，无法进入婴儿房，考虑离婚。"}
{"persona": "Single mother working two jobs to support kids, no time for own healthcare, ignoring breast lump for 6 months out of fear and no insurance.", "persona_chinese": "单亲妈妈，两份工作养孩子，无时间自己医疗，出于恐惧和无保险忽视乳房肿块6个月。"}
{"persona": "Parent of child with autism, navigating school IEP meetings, fighting for services, emotionally exhausted, marriage strained.", "persona_chinese": "自闭症儿童家长，应对学校IEP会议，争取服务，情感疲惫，婚姻紧张。"}
{"persona": "Father of teenager with drug addiction, enabling behavior while trying to help, family savings depleted on rehab, siblings resentful.", "persona_chinese": "青少年毒瘾孩子的父亲，试图帮助时启用行为，家庭积蓄耗尽在康复上，兄弟姐妹怨恨。"}
{"persona": "Mother of child with terminal brain tumor, watching child deteriorate, anticipatory grief overwhelming, trying to make remaining time meaningful.", "persona_chinese": "晚期脑瘤儿童的母亲，看着孩子恶化，预期性悲伤压倒性，试图让剩余时间有意义。"}
{"persona": "Parent of child killed by drunk driver, PTSD and complicated grief, anger consuming them, can't forgive, attending victim support groups.", "persona_chinese": "醉驾司机杀死孩子的家长，PTSD和复杂性悲伤，愤怒吞噬他们，无法原谅，参加受害者支持小组。"}
{"persona": "Adoptive mother of child with reactive attachment disorder from early trauma, child violent toward her, guilt about feeling afraid of own child.", "persona_chinese": "早期创伤导致反应性依恋障碍儿童的养母，孩子对她暴力，对害怕自己孩子感到内疚。"}
{"persona": "Parent of child with severe food allergies, constant hypervigilance about cross-contamination, anxiety about school lunch and birthday parties.", "persona_chinese": "严重食物过敏儿童的家长，对交叉污染持续过度警觉，对学校午餐和生日派对焦虑。"}
{"persona": "Stepfather trying to bond with teenager who resents him, family dynamics stressful, biological father undermining relationship, developing stress-related IBS.", "persona_chinese": "继父试图与怨恨他的青少年建立联系，家庭动态压力大，生父破坏关系，发展出压力相关IBS。"}
{"persona": "Foster parent caring for child with fetal alcohol syndrome, behavioral challenges overwhelming, questioning ability to continue, support system lacking.", "persona_chinese": "照顾胎儿酒精综合征儿童的寄养父母，行为挑战压倒性，质疑继续能力，缺乏支持系统。"}
{"persona": "Teenage girl, 16, diagnosed with PCOS, struggling with weight gain, acne, and irregular periods, feeling unfeminine, classmates making cruel comments.", "persona_chinese": "青少年女孩，16岁，诊断PCOS，挣扎于体重增加、痤疮和月经不调，感觉不女性化，同学刻薄评论。"}
{"persona": "College student, 20, binge drinking culture on campus, blacked out twice last month, concerned about developing alcohol problem like father.", "persona_chinese": "大学生，20岁，校园暴饮文化，上月两次断片，担心像父亲一样发展出酒精问题。"}
{"persona": "Graduate student, 27, teaching assistant while completing dissertation, stipend below poverty line, stress affecting physical health, losing weight unintentionally.", "persona_chinese": "研究生，27岁，完成论文同时担任助教，津贴低于贫困线，压力影响身体健康，体重无意下降。"}
{"persona": "Law student, 24, exam anxiety so severe vomited during LSAT, now on beta blockers for bar exam, questioning if legal career right fit.", "persona_chinese": "法学院学生，24岁，考试焦虑严重LSAT期间呕吐，现服用β受体阻滞剂准备律师资格考试，质疑法律职业是否合适。"}
{"persona": "Dental student, 25, hand tremor developing from performance anxiety during practical exams, worried won't be able to perform procedures on patients.", "persona_chinese": "牙科学生，25岁，实践考试期间表现焦虑导致手抖发展，担心无法对患者进行操作。"}
{"persona": "Art student, 22, developed tendonitis in drawing hand, physical therapy not helping, facing possibility of not being able to pursue career.", "persona_chinese": "艺术学生，22岁，绘画手发展出肌腱炎，物理治疗无效，面临无法追求职业生涯的可能性。"}
{"persona": "Engineering student, 23, academic pressure intense, stimulant abuse to study, developing dependence on Adderall obtained without prescription.", "persona_chinese": "工程学生，23岁，学业压力强，滥用兴奋剂学习，对无处方获得的Adderall发展出依赖。"}
{"persona": "International student from China, homesick and culturally isolated, language barrier affecting grades, family pressure to succeed overwhelming.", "persona_chinese": "中国国际学生，思乡和文化孤立，语言障碍影响成绩，家庭成功压力压倒性。"}
{"persona": "Student athlete on scholarship, torn between academic demands and training schedule, stress fractures ignored to keep competing, risking permanent injury.", "persona_chinese": "奖学金学生运动员，学业要求和训练时间表之间撕裂，忽视应力性骨折以继续比赛，冒永久伤害风险。"}
{"persona": "PhD candidate, 31, advisor retired unexpectedly, research project stalled, sunk 7 years into degree, considering quitting, feeling like failure.", "persona_chinese": "博士候选人，31岁，导师意外退休，研究项目停滞，投入7年学位，考虑退出，感觉像失败者。"}
{"persona": "Homeless veteran living in tent city, diabetic without regular access to insulin, foot wound infected, refusing shelter due to PTSD triggers.", "persona_chinese": "无家可归退伍军人，住在帐篷城，糖尿病无法定期获得胰岛素，足部伤口感染，因PTSD触发拒绝收容所。"}
{"persona": "Undocumented immigrant with kidney stones, severe pain, afraid to go to ER due to fear of deportation, self-treating with herbs.", "persona_chinese": "无证移民，肾结石，剧痛，因害怕被驱逐不敢去急诊，用草药自我治疗。"}
{"persona": "Refugee from Somalia, female genital mutilation as child, now pregnant and terrified of childbirth complications, trauma resurfacing.", "persona_chinese": "索马里难民，儿童时期女性生殖器切割，现怀孕害怕分娩并发症，创伤再现。"}
{"persona": "Transgender man, 25, difficulty finding doctor knowledgeable about hormone therapy, previous provider misgendered him, avoiding healthcare.", "persona_chinese": "跨性别男性，25岁，难以找到了解激素治疗的医生，以前的医生用错性别称呼他，回避医疗。"}
{"persona": "Sex worker, 32, no health insurance, exposed to STIs regularly, afraid of judgment from healthcare providers, untreated HIV infection.", "persona_chinese": "性工作者，32岁，无健康保险，经常暴露于性传播感染，害怕医疗提供者的评判，未治疗的HIV感染。"}
{"persona": "Muslim woman wearing hijab, experiencing discrimination in healthcare settings, providers making assumptions about oppression, not listening to actual concerns.", "persona_chinese": "戴头巾的穆斯林女性，在医疗环境中遭受歧视，医疗提供者对压迫做出假设，不倾听实际关切。"}
{"persona": "Indigenous person from reservation, historical trauma from forced sterilization in family, deep mistrust of medical system, avoiding necessary cancer screening.", "persona_chinese": "保留地土著人，家族强制绝育的历史创伤，对医疗系统深度不信任，回避必要的癌症筛查。"}
{"persona": "African American woman, 45, high-risk pregnancy, medical racism concerns after reading maternal mortality statistics, advocating fiercely for own care.", "persona_chinese": "非裔美国女性，45岁，高危妊娠，阅读孕产妇死亡率统计后担心医疗种族主义，为自己的护理激烈倡导。"}
{"persona": "Person with intellectual disability, 28, difficulty communicating pain to healthcare providers, family advocating but wishes could self-advocate.", "persona_chinese": "智力障碍人士，28岁，难以向医疗提供者传达疼痛，家人倡导但希望能自我倡导。"}
{"persona": "Elderly lesbian couple, 75 and 77, hospital not recognizing them as family, visitation rights denied during illness, no legal protection.", "persona_chinese": "老年女同性恋伴侣，75和77岁，医院不承认她们为家庭，生病期间探视权被拒，无法律保护。"}
{"persona": "Person living in poverty, 40, tooth abscess spreading to jaw, can't afford dental care, emergency room won't treat, infection worsening.", "persona_chinese": "贫困人士，40岁，牙脓肿扩散到下颌，无力负担牙科护理，急诊室拒绝治疗，感染恶化。"}
{"persona": "Rural resident, 55, nearest hospital 90 miles away, chest pain episode, delayed care due to distance, permanent heart damage resulted.", "persona_chinese": "农村居民，55岁，最近医院90英里外，胸痛发作，距离导致护理延迟，造成永久性心脏损伤。"}
{"persona": "Former inmate recently released, 38, chronic hepatitis C from prison, facing stigma and difficulty accessing treatment despite cure available.", "persona_chinese": "最近释放的前囚犯，38岁，监狱慢性丙型肝炎，尽管有治愈方法仍面临污名和获得治疗的困难。"}
{"persona": "Person with severe mental illness, 45, medication side effects causing weight gain and diabetes, caught between managing psychiatric symptoms and metabolic health.", "persona_chinese": "严重精神疾病人士，45岁，药物副作用导致体重增加和糖尿病，在管理精神症状和代谢健康之间受困。"}
{"persona": "Child in foster care, 12, attachment issues from multiple placements, trauma history causing behavioral problems, new foster parents overwhelmed.", "persona_chinese": "寄养儿童，12岁，多次安置导致依恋问题，创伤史导致行为问题，新寄养父母不堪重负。"}
{"persona": "Teenager with cerebral palsy, 17, frustrated by low expectations from teachers, intellectually gifted but physical limitations cause people to underestimate cognitive ability.", "persona_chinese": "脑瘫青少年，17岁，对教师低期望感到沮丧，智力天赋但身体限制导致人们低估认知能力。"}
{"persona": "Young adult with Down syndrome, 24, wants independence but family overprotective, seeking job and apartment, fighting for autonomy.", "persona_chinese": "唐氏综合征年轻成人，24岁，想要独立但家庭过度保护，寻求工作和公寓，为自主权而战。"}
{"persona": "Child of deaf parents, 14, serving as family interpreter since young age, parentification causing resentment and missing own childhood.", "persona_chinese": "聋哑父母的孩子，14岁，从小担任家庭翻译，父母化导致怨恨和错过自己的童年。"}
{"persona": "Immigrant farmworker's child, 10, acting as medical interpreter for parents despite limited English and medical knowledge, burden too great.", "persona_chinese": "移民农场工人的孩子，10岁，尽管英语和医学知识有限仍为父母担任医疗翻译，负担太重。"}
{"persona": "Teenager with sickle cell disease, 16, frequent hospitalizations causing school absences, chronic pain, friends don't understand why can't participate in activities.", "persona_chinese": "镰状细胞病青少年，16岁，频繁住院导致缺课，慢性疼痛，朋友不理解为什么不能参加活动。"}
{"persona": "Young cancer survivor, 22, fertility preserved before treatment, now in remission but facing early menopause from chemotherapy, grief over lost fertility.", "persona_chinese": "年轻癌症幸存者，22岁，治疗前保存生育力，现缓解但化疗导致早期绝经，对失去生育能力的悲伤。"}
{"persona": "Person with chronic fatigue syndrome, 35, illness not visible, accused of faking by family and coworkers, medical gaslighting from doctors.", "persona_chinese": "慢性疲劳综合征人士，35岁，疾病不可见，被家人和同事指控装病，医生的医疗煤气灯效应。"}
{"persona": "Patient with fibromyalgia, 42, chronic widespread pain, dismissed by multiple doctors as psychosomatic, feeling unheard and hopeless.", "persona_chinese": "纤维肌痛患者，42岁，慢性广泛疼痛，被多位医生认为是心身疾病而驳回，感到未被倾听和绝望。"}
{"persona": "Person with lupus, 38, autoimmune disease causing fatigue and joint pain, looks healthy so people don't believe sick, invisible illness struggle.", "persona_chinese": "狼疮患者，38岁，自身免疫疾病导致疲劳和关节痛，看起来健康所以人们不相信生病，隐形疾病挣扎。"}
{"persona": "Individual with Lyme disease, 40, chronic symptoms persisting after treatment, medical controversy over chronic Lyme, difficulty finding doctor who believes condition.", "persona_chinese": "莱姆病患者，40岁，治疗后慢性症状持续，慢性莱姆病医学争议，难以找到相信病情的医生。"}
{"persona": "Person with Ehlers-Danlos syndrome, 29, joint hypermobility causing frequent dislocations, chronic pain, genetic connective tissue disorder often misdiagnosed.", "persona_chinese": "Ehlers-Danlos综合征人士，29岁，关节过度活动导致频繁脱位，慢性疼痛，遗传性结缔组织疾病常被误诊。"}
{"persona": "Cyclist hit by car, 31, traumatic brain injury, slow recovery, personality changes distressing to family, wondering if will ever be same person.", "persona_chinese": "骑自行车者被车撞，31岁，创伤性脑损伤，恢复缓慢，性格变化让家人痛苦，想知道是否会恢复原样。"}
{"persona": "Burn survivor, 27, face and hands scarred from house fire, multiple reconstructive surgeries, stares from strangers causing social anxiety.", "persona_chinese": "烧伤幸存者，27岁，房屋火灾面部和手部疤痕，多次重建手术，陌生人的注视导致社交焦虑。"}
{"persona": "Amputee, 35, lost leg to diabetes complications, adjusting to prosthetic, phantom limb pain severe, depression about altered body image.", "persona_chinese": "截肢者，35岁，糖尿病并发症失去腿，适应假肢，幻肢痛严重，对改变的身体形象抑郁。"}
{"persona": "Person with ostomy bag after colorectal surgery, 48, embarrassed about body, afraid of leaks, avoiding social situations and intimacy.", "persona_chinese": "结直肠手术后造口袋人士，48岁，对身体感到尴尬，害怕泄漏，回避社交场合和亲密关系。"}
{"persona": "Individual recovering from stroke, 58, left side paralysis, speech difficulties, frustration at inability to communicate, family treating like child.", "persona_chinese": "卒中恢复人士，58岁，左侧瘫痪，言语困难，无法沟通的挫折，家人像对待孩子一样对待。"}
{"persona": "Person living with HIV, 44, undetectable viral load but still facing stigma, difficulty dating, disclosure anxiety.", "persona_chinese": "HIV感染者，44岁，病毒载量检测不到但仍面临污名，约会困难，披露焦虑。"}
{"persona": "Individual with schizophrenia, 36, medication-compliant but side effects limiting quality of life, weight gain, sedation, tremors.", "persona_chinese": "精神分裂症患者，36岁，遵守用药但副作用限制生活质量，体重增加、镇静、震颤。"}
{"persona": "Person with borderline personality disorder, 28, struggling with emotion regulation and relationships, therapy helping but progress slow, self-harm urges.", "persona_chinese": "边缘性人格障碍人士，28岁，情绪调节和人际关系挣扎，治疗有帮助但进展缓慢，自我伤害冲动。"}
{"persona": "Individual with OCD, 33, intrusive thoughts and compulsive behaviors consuming hours daily, exposure therapy terrifying but committed to trying.", "persona_chinese": "强迫症患者，33岁，侵入性思维和强迫行为每天消耗数小时，暴露疗法令人恐惧但致力于尝试。"}
{"persona": "Person with hoarding disorder, 55, home unsafe with narrow pathways, family threatening intervention, attachment to objects stronger than logic.", "persona_chinese": "囤积障碍人士，55岁，家中不安全仅有狭窄通道，家人威胁干预，对物品的依恋强于逻辑。"}
{"persona": "Individual with body dysmorphic disorder focused on nose, 24, multiple consultations with plastic surgeons, most refusing surgery, obsessive mirror checking.", "persona_chinese": "身体变形障碍人士，专注于鼻子，24岁，多次咨询整形外科医生，大多数拒绝手术，强迫性照镜子。"}
{"persona": "Person with trichotillomania, 19, compulsive hair pulling since childhood, eyebrows and eyelashes gone, wearing wig, shame preventing socialization.", "persona_chinese": "拔毛癖人士，19岁，自童年强迫性拔毛，眉毛和睫毛消失，戴假发，羞耻阻止社交。"}
{"persona": "Truck driver, 52, sleep apnea severe, falling asleep at wheel, DOT medical card at risk, CPAP compliance difficult on road.", "persona_chinese": "卡车司机，52岁，严重睡眠呼吸暂停，方向盘前睡着，DOT医疗卡面临风险，路上CPAP依从性困难。"}
{"persona": "Taxi driver in major city, exposure to violence, held up at gunpoint twice, PTSD and hypervigilance, can't work nights anymore.", "persona_chinese": "大城市出租车司机，暴力暴露，两次被持枪抢劫，PTSD和过度警觉，无法再夜间工作。"}
{"persona": "School bus driver, 64, prediabetic, hypertension, sedentary job with irregular schedule making healthy eating difficult.", "persona_chinese": "校车司机，64岁，糖尿病前期，高血压，久坐工作和不规律时间表让健康饮食困难。"}
{"persona": "Construction worker, 38, hearing loss from years without ear protection, tinnitus constant, workers' comp claim denied.", "persona_chinese": "建筑工人，38岁，多年无耳保护导致听力损失，持续耳鸣，工伤赔偿索赔被拒。"}
{"persona": "Roofer working in extreme heat, 45, heat exhaustion twice this summer, employer pressure to keep working, inadequate breaks.", "persona_chinese": "屋顶工人，极端高温工作，45岁，今夏两次中暑，雇主压力继续工作，休息不足。"}
{"persona": "Painter exposed to solvents and fumes for 20 years, 50, neurological symptoms and liver damage, never wore respirator properly.", "persona_chinese": "油漆工，20年暴露于溶剂和烟雾，50岁，神经系统症状和肝损伤，从未正确佩戴呼吸器。"}
{"persona": "Mechanic, 42, chronic back pain from awkward positions under cars, disc problems, considering career change but no other skills.", "persona_chinese": "机修工，42岁，汽车下尴尬姿势导致慢性背痛，椎间盘问题，考虑转行但无其他技能。"}
{"persona": "Dry cleaner owner, 58, exposed to perchloroethylene for decades, kidney problems developing, small business can't afford safer equipment.", "persona_chinese": "干洗店老板，58岁，数十年暴露于全氯乙烯，肾问题发展，小企业无力负担更安全设备。"}
{"persona": "Garbage collector, 47, needlestick injury from improperly disposed sharps, HIV exposure prophylaxis, anxiety waiting for test results.", "persona_chinese": "垃圾收集员，47岁，不当处置的锐器针刺伤，HIV暴露预防，等待检测结果的焦虑。"}
{"persona": "Mortician, 52, formaldehyde exposure causing respiratory problems and skin irritation, considering leaving profession after 25 years.", "persona_chinese": "殡仪师，52岁，甲醛暴露导致呼吸问题和皮肤刺激，25年后考虑离开职业。"}
{"persona": "Pest control technician, 39, chronic exposure to pesticides, worried about long-term health effects, wife concerned about bringing chemicals home to kids.", "persona_chinese": "害虫控制技术员，39岁，长期暴露于杀虫剂，担心长期健康影响，妻子担心将化学品带回家给孩子。"}
{"persona": "Bartender, 33, alcoholic working around alcohol daily, 2 years sober but job triggering, financial need preventing career change.", "persona_chinese": "调酒师，33岁，酒精依赖者每天在酒精周围工作，戒酒2年但工作触发，经济需要阻止职业变化。"}
{"persona": "Sex therapist, 48, listening to intimate problems daily, vicarious trauma affecting own intimate relationship, boundary issues.", "persona_chinese": "性治疗师，48岁，每天倾听亲密问题，替代性创伤影响自己的亲密关系，边界问题。"}
{"persona": "Substance abuse counselor in recovery, 41, relapsed after 5 years sober, professional license at risk, shame and guilt overwhelming.", "persona_chinese": "康复中的物质滥用咨询师，41岁，戒酒5年后复发，职业执照风险，羞耻和内疚压倒性。"}
{"persona": "Midwife, 52, witnessed stillbirth during delivery, traumatic experience, considering leaving profession, can't shake images.", "persona_chinese": "助产士，52岁，分娩期间目睹死产，创伤经历，考虑离开职业，无法摆脱图像。"}
{"persona": "Phlebotomist, 29, needle phobia developing after accidental self-stick, ironic career choice becoming impossible to continue.", "persona_chinese": "采血师，29岁，意外自我针刺后发展出针头恐惧症，讽刺的职业选择变得无法继续。"}
{"persona": "Radiation therapist, 44, anxious about own radiation exposure despite safety protocols, considering changing to different medical field.", "persona_chinese": "放射治疗师，44岁，尽管安全规程仍担心自己的辐射暴露，考虑转向不同医疗领域。"}
